{
  "items": {
    "articles": {
      "5-reasons-why-i-started-learning-programming": {
        "category": "web-development",
        "itemType": "article",
        "metadata": {
          "title": "5 Reasons Why I Started Learning Programming",
          "description": "In this article I want to explain, why I made (such a hard in my case) decision and dived into completely unknown area and put this on top of all of my previous long-term projects and creative activities. This post is one of the ways to celebrate my 1-year anniversary of learning programming. Also I hope, that my reasons to start learning web development may inspire you to follow my example ;-)",
          "link": "/5-reasons-why-i-started-learning-programming",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "content": "\n## Hello, World!\n\n17th of December 2020 is a very important date for me. That day I officially froze my existing creative projects, in which I have been involved for years, and started learning programming.\n\nIt was a hard decision, because it was not easy to give up on projects I was developing and putting a lot of effort for years (blog, social media accounts, workshops & next ebook) in favor of a new, vast, completely unknown field in which I did not know if I could manage at all…\n\nBut I was extremely determined and I knew that if I want to master, I need to focus on programming learning only. No side projects, no distractions. So what caused my determination you may ask? Oh, there were a lot of very different reasons and that is what this article is about, so keep reading!\n\n## Influence of the Walter Isaacson’s Book “The Innovators”\n\nI just love Isaacson’s books. I read his Steve Jobs & Leonardo da Vinci biographies (these two individuals inspire me a lot), so I was sure, that “The Innovators” will be great. But I didn’t expect, that the book will change my life, give me and make me addicted to a new hobby.\n\nHonestly, I thought that programming is boring and there is no place for creativity. I’ve never been so wrong in my life… This book and stories about all of those creative individuals mentioned by Isaacson opened my eyes. I felt immediately, that I want and need to be one of those people, to belong to software & web developers community.\n\n## Creative Process Management Reasearch\n\nEven though I had not been interested in programming, digital technologies or… transistors before I started reading “The Innovators”, I wanted to know, how engineers and programmers created their inventions in terms of creative process management, which was my actual interest and hobby at the time (and still is).\n\nI was expecting, that my theory of Creative Process Management (published in my ebook and on my blog) will apply also in web development, but I couldn’t imagine, how it is similar to rules I was using in my other creative activities.\n\nI’ve understood, that there is no difference between painting, composing music, writing a book and programming in terms of Creative Process Management rules. In addition, I realized that by knowing how to program, I would be able to create applications that will help creators (including myself) to organize their creative process & notes!\n\n## Curiosity\n\nI like intellectual challenges, so one of the reasons I’ve decided to test myself in programming learning were questions, I was curious to answer:\n\n- Is programming really boring? (No!)\n- Is there a place for creativity? (Oh, yes!)\n- Are my intellectual abilities sufficient to master it? (Yes ;-)\n- Can I manage this without previous programming experience? (With no doubt)\n- Would my previous creative experience be useful? (A lot!)\n- How far can I dive into it and how long it would take? (See my portfolio ;-)\n\n## A Few Apps Ideas\n\nI wanted to learn programming to develop a few apps I had in mind before I wrote my first “Hello, World”:\n- mind mapping app with the possibility to put keywords in any place on the canvas (done!)\n- tagged notes app to organize and easy filter my notes (done!)\n- my own blogging platform (done!)\n… and many other ideas – some of them are in progress, some of them are done.\n\nAlso I wanted to create my own personal web site from scratch with blogging features and a possibility to publish and run my apps. I had a website that was created by my friend Piotr, about whom I’ll talk more below, but… I wanted to run my apps on it and there were no possibilities to do that & I also wanted to be independent.\n\nI’ve created a lot of things, music, articles, mind maps, sketchnotes, content and even wrote 2 ebooks, but… this time I wanted to create something that others could interact with, something that is usefull & available globally. That was a new stage of my creative self-development.\n\n### I Could Count on the Help & Guidance of a Friend\n\nI have a friend, Piotr Wnuczek, and he is a programmer & web developer. He built a website for me, when I decided to run a blog in 2018, and without his help I couldn’t reach so many people with my articles.\n\nSo when I was thinking about the possibility of learning web development & programming, I had a living example that it is possible, because I was a witness of Piotr’s programming development and successes. So I considered, that if he could, I also can try.\n\nBesides I knew, that there is a person, who can guide me and give me a hand if I need to. And I was right! We often see each other and every time I’m visiting him, he gives me precious advises.\n\n### Summary\n\nNow you know almost everything about my reasons to freeze my previous long-term projects to make a space for undistracted programming learning. I'd never decide to dive into programming world, if there was only one of mentioned reasons - it all worked together. And I'm happy - that was a best decision in my life.\n\n## Happy coding!\n"
        }
      },
      "summary-of-my-first-year-of-learning-web-development-roadmap-projects-and-tips-for-newbies": {
        "category": "web-development",
        "itemType": "article",
        "metadata": {
          "title": "Summary of my first year of learning web development. Roadmap, projects and tips for newbies",
          "description": "Read this article, if you plan to become a front-end web developer in 2022. You can use my advice based on 1-year of non-commercial experience and follow my roadmap, which contains links to free sources.",
          "link": "/summary-of-my-first-year-of-learning-web-development-roadmap-projects-and-tips-for-newbies",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "content": "\n## My very first mistake and failure at the beginning. Do not choose a programming language, choose a path!\n\nI started learning programming one year ago (you can read about my motivation and reasons to start learning in [previous article](/5-reasons-why-i-started-learning-programming)). But, actually, I made one extra try earlier, 1,5 year ago, when I spent few weeks trying to learn Python. Why did I choose Python? Because I read that it's a best programming language and especially the best for newbies...\n\nAnd maybe that is the true, but I was bored building small console apps... It means that the result of the app ran was some text or calculations printed in console - no visual elements, no interface. Now I know, that you can do all of these things with Python, but not at the beginner level.\n\nSo I gave up with Python and console apps and went back to my other creative activities (blog, social media accounts, music composing). After a few months I tried to figure out, how to plan my programming development and how to choose a langauge.\n\nThen I read, that I need to choose a path, not a language. A programming language is only a tool. So among the available paths I chose a front-end development, because it allows you to create simple web pages and user interfaces practically immediately after learning a few things!\n\nBesides I understood, that I want to create web pages and web applications, so this path was the best option to manage this goal. So then, when I knew exactly what I want to do and achieve, I could find out, what languages and technologies I need to master.\n\n## HTML & CSS\n\nAll front-end developers start from HTML & CSS. These markup languages are the foundation, the sceleton and skin of web pages. HTML & CSS are not stricly speaking programming languages, so it's a nice thing to start coding in them. No variables, no functions, no loops.\n\nAfter a few hours of learning you can create simple web page in your browser which contains headers, lists, sections with content, images etc. thank to HTML tags. You would be able to add background & font colors, different fonts, text and items allign, text decoration etc. with a few CSS lines.\n\nSounds great!\n\nPersonally, I did these first steps with Khan Academy free online course [Intro to HTML/CSS: Making webpages](https://www.khanacademy.org/computing/computer-programming/html-css). In addition, I did also [this free polish online course](http://how2html.pl/).\n\nI'm very grateful to Khan Academy for my programming initiation. I finished all their [computer programming courses](https://www.khanacademy.org/computing/computer-programming) and I'm sure that I wouldn't be in the place I am now without them. \n\n## Javascript (ES5 + processing.js)\n\nJavaScript is a main programming langauge of the web. JS brings interactivity to web pages and applications and plays a role of \"muscles\" and \"brain\" in the web page/ app body. Thanks to that you can render different views, collect data from the user, allow him to push buttons, work with database or browser's local storage, run logic & algorithms and do a lot of magical things, like animations, games etc.\n\nI learned basics of JS along with another Khan Academy course - [Intro to JS: Drawing & Animation with processing.js](https://www.khanacademy.org/computing/computer-programming/programming) & more advanced & complex topics with [Advanced JS: Games & Visualizations with processing.js](https://www.khanacademy.org/computing/computer-programming/programming-games-visualizations).\n\nThat was really fun, because in mentioned courses I learned JavaScript by drawing different things with the code and help of processing.js library. It was very visual, so I loved it (I am a big fan of visula notes and mind maps)! After compliting those courses I built a few simple games (like [Old School 2D Racing Game](https://vadimgierko.github.io/old-school-2d-racing-game/)) & animations (like [Let It Snow](https://vadimgierko.github.io/let-it-snow/)).\n\n## HTML + CSS + JS (+ jQuery)\n\nFinally, when I knew basics of these languages, I could combine them & started creating web pages and simple web applications along these courses:\n- [HTML/JS: Making webpages interactive](https://www.khanacademy.org/computing/computer-programming/html-css-js)\n- [HTML/JS: Making webpages interactive with jQuery](https://www.khanacademy.org/computing/computer-programming/html-js-jquery)\n\nApps were ugly, but... worked!\n\n## Upgrading from JavaScript ES5 to ES6 & from processing.js to p5.js\n\nWhen I completed all of Khan Academy courses, I found out, that JavaScript (ES5) version they were using is outdated... so I switched to ES6 standard with [The Modern JavaScript Tutorial](https://javascript.info/).\n\nThe same thing happend with processing.js library, because I found out, that this library will not be updating, so I needed to switch to it's modern version - p5.js with help of [official p5.js references](https://p5js.org/reference/):\n\n*p5.js is a JavaScript library for creative coding, with a focus on making coding accessible and inclusive for artists, designers, educators, beginners. Using the metaphor of a sketch, p5.js has a full set of drawing functionality.*\n\n*However, you’re not limited to your drawing canvas. You can think of your whole browser page as your sketch, including HTML5 objects for text, input, video, webcam, and sound.*\n\nThen I started using [p5 online code editor](https://editor.p5js.org/) and it would be impossible without knowledge of modern JS standard (ES6) & p5.js library. i made a lot creative projects and apps in that editor with p5.js: racing game, quiz app, falling snow animation, snake game, simulation of my office's queuing system, math app for children and more.\n\n## React\n\nWhen I felt comfortable in working with Web Holy Trynity (HTML, CSS, JS) and my applications started become more and more complex, I learned the JavaScript framework (library stricly speaking) React.js.\n\nI felt in love in its possibilities. It wasn't easy at the beginning to figure it out and I had a few tries, but I've managed basics of React along these courses:\n\n- [React Official Tutorial](https://reactjs.org/tutorial/tutorial.html)\n- [React Official Tutorial 2 - step by step guide](https://reactjs.org/docs/hello-world.html)\n- [React Type of Web Tutorial](https://typeofweb.com/kurs/react-js/)\n- [Getting started with React](https://developer.mozilla.org/en-US/docs/Learn/Tools_and_testing/Client-side_JavaScript_frameworks/React_getting_started)\n- [Learning React. Modern Patterns for Developing React Apps (Eve Porcello & Alex Banks book)](https://www.oreilly.com/library/view/learning-react-2nd/9781492051718/)\n\nWhen I switched to React instead of developing in pure JavaScript/ HTML/ CSS, my apps became larger, more complex, better structured and shiped faster. Now I'm developing my apps thanks to create-react-app in React, so that's how I became a React Developer.\n\n## Bootstrap\n\nI became familiar with [Bootstrap](https://getbootstrap.com/docs/5.0/getting-started/introduction/), the world’s most popular framework for building responsive, mobile-first sites, to speed up and simplify my apps styling and responsive web design.\n\nWith Bootstrap my pages and apps became standardized, beautiful and looked really fine both on computers and smartphones. I had no need to play or struggle with CSS anymore (of course I used CSS, but rather inline in my components JSX).\n\nWhen I got Bootstrap 4.6 version, I needed to switch to the newest upcoming version - 5.0...\n\n## React Router\n\nI needed a routing for my apps and web pages, but if you are working with front-end and have no back-end background, you need to figure out it somehow. And the tool I needed was React Router!\n\nYou can find all necessary information about it here:\n[React Training / React Router](https://reactrouter.com/web/guides/quick-start)\n\nFrom that moment my apps had dynamically generated links and it was not only convenient (and a standard) for users, but also routes helped me to better organize my apps, its rendering & passing data between components.\n\n## Firebase\n\nMy apps were really complex at the moment, but I was struggling because of lack of database, so potential users of my apps (including me) could put their data (text content, images etc.) only to browser's local storage.\n\nThanks to this my previous blog application allowed user to create a new article, save it and it was visible only in that particular users browser. It was nice for excercise purpose, but it wasn't enough for real-world apllications.\n\nSo, finally, after experimenting with local storage and fetching I was prepared for real database experience! And Firebase was the savior. I learned how to work with Firebase from [official Firebase docs](https://firebase.google.com/docs/reference/js).\n\nAnd of course, when I figure out, how Firebase 8 works and felt comfortable with that edition, Firebase 9 came out...\n\n## Continuous learning\n\nThis is common thing in programming world, especially in web development. You need to be prepeared and aware of that new frameworks, updates or new languages can show up any day. It means, that you need to upgrade your apps and your skills constantly or you'll be outdated very soon.\n\n## Summary - What You Can Achieve In A Year Thanks To Dedication to the One Thing Only\n\nThis year of total dedication to the one thing - learning programming - has resulted in the fact that:\n- starting from a total scratch a year ago, I am able to create and publish full-stack responsive interactive web application or web page with users authentication and database integration & done a lot of open source projects, such as among others:\n   - [Blogging Platform App](https://vadimgierko.github.io/blogging-platform), where you can run your blog/s for free & edit articles with Markdown Editor,\n   - [Linky Notes](https://vadimgierko.github.io/linky-notes/), the app that allows you to create tagged notes & easilly filter them by tags,\n   - [Mind Maps App](https://vadimgierko.github.io/MIND-MAP-APP/), the app that allows you to create mind maps online,\n- I proved myself intellectually, creatively and managed to implement myself in a completely new field through self-learning along available free online sources,\n- I gained an additional profession - JavaScript / React developer -  and broadened my horizons tremendously,\n- I am proud of myself and the man that I have became during this year.\n\nI hope that my story will inspire you and encourage you to start learn programming or... start learning anything else this year. Now you can see, how much can be done and learned in one year if you are devoted to the one thing / topic only, especially if it's a wide complex field.\n\nI were coding at least for 1000 hours during this year in my speare time after a day full-time job and that was a key:\n- focus on the one thing - learning & apply new knowledge to your projects step by step (in my case)\n- reject all unnecessary unsustainable things and activities, such as:\n   - pointless surfing on the Internet or social media,\n   - watching news, movies or series,\n   - hanging out with people with whom there is nothing to talk about,\n   - but also engaging in projects that do not get anywhere or do not produce the results we expect...\n\nIf you'll decide to dive into web development in 2022, you can follow my roadmap!\n\n*Happy Coding* (or whatever else you will be doing) in 2022!\n"
        }
      },
      "zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia": {
        "category": "creative-process-management",
        "itemType": "article",
        "metadata": {
          "title": "Zarządzanie Procesem Twórczym, czyli jak zapanować nad chaosem tworzenia",
          "description": "Chcesz być bardziej kreatywnym/ą, generować więcej wartościowych pomysłów i przekuwać je w zrealizowane projekty? Poznaj Zarządzanie Procesem Twórczym!",
          "link": "/zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia",
          "img": {
            "src": "/img/system-zarzadzania-procesem-tworczym-vadim-gierko.jpg",
            "alt": "ilustracja system zarządzania procesem twórczym"
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "content": "\nJeśli chcesz:\n\n- być bardziej kreatywnym/ą,\n- generować więcej wartościowych pomysłów,\n- zrozumieć, skąd tak naprawdę biorą się pomysły,\n- przekuwać swoje pomysły w zrealizowane projekty,\n- mieć natchnienie i olśnienie na zawołanie,\n- pokonać blokadę twórczą,\n- zapanować nad twórczym chaosem,\n\nto koniecznie musisz poznać Zarządzanie Procesem Twórczym!\n\n## Czym jest Zarządzanie Procesem Twórczym?\n\nZarządzanie Procesem Twórczym jest jedną z moich pasji i zainteresowań, wyzwaniem intelektualnym i przedmiotem badań w ciągu ostatnich kilku lat.\n\nEfektem tej pracy były:\n\n- pierwszy ebook *Łowca pomysłów* z 2016 r. oraz zawarta w nim pierwsza, dość intuicyjna i metafizyczna Koncepcja Przestrzeni Informacyjno-Energetycznej, z której czerpie się pomysły;\n- blog *Łowca Pomysłów* (od XII 2018 do XII 2020), na którym w ciągu 2 lat opublikowałem kilkanaście obszernych artykułów nt. ZPT (statystyki i tytuły wpisów na blogu patrz tutaj);\n- drugi ebook [*Zarządzanie Procesem Twórczym*](/ebook-zarzadzanie-procesem-tworczym) z w pełni ukształtowaną Koncepcją i Systemem Zarządzania Procesem Twórczym.\n\nNajważniejszym celem mojej obecności i publikowania w Internecie jest dzielenie się wiedzą na temat Zarządzania Procesem Twórczym. Dzięki niej będziesz bardziej skutecznie i produktywnie generować i realizować wartościowe pomysły i rozwiązania w ramach swoich Projektów. Co prawda, od końca 2020 roku przystopowałem na jakiś czas z publikacjami, ponieważ zacząłem uczyć się programowania.\n\nTego, co mam Wam do przekazania, nie znajdziecie w żadnym kompletnym opracowaniu (oprócz mojego ebooka ;-). Nie tylko dlatego, że poszczególne jej fragmenty są porozrzucane w dziesiątkach opracowań, ale także dlatego, że większość z tej wiedzy wygenerowałem samodzielnie podczas swojej pracy twórczej oraz badań. Bierz i korzystaj!\n\n## Geneza pojęcia\n\nKiedy pisałem pierwszego ebooka oraz zaczynałem dzielić się swoją wiedzą na Instagramie (IX 2018 r.), a później na blogu Łowcy Pomysłów, nie ukułem jeszcze terminu Zarządzanie Procesem Twórczym (w skrócie: ZPT), tylko pisałem w sposób bardziej lub mniej skoordynowany o Procesie Twórczym, Natchnieniu, Olśnieniu, Inkubacji, Kreatywności itd.\n\nSam termin skrystalizował się mniej więcej wiosną 2019 r. Jestem autorem tego pojęcia i jeśli wpiszesz go w Google, to się przekonasz, że nikt oprócz mnie nie posługuje się tym określeniem.\n\n### Definicja Procesu Twórczego\n\nZanim zdefiniujemy Zarządzanie Procesem Twórczym, należy zdefiniować najpierw, czym jest Proces Twórczy, ponieważ ten drugi jest pojęciem węższym.\n\nGdybyśmy mieli zdefiniować Proces Twórczy w najprostszy i zarazem najszerszy sposób, to jest nim ogół czynności (a nie tylko proces myślowy!), które prowadzą do powstania jakościowo nowych wytworów materialnych i niematerialnych.\n\n#### Rozbudowana definicja ZPT\n\nW związku z tym w jednoimiennym ebooku zdefiniowałem Zarządzanie Procesem Twórczym jako:\n\nszereg działań i czynności, mających na celu świadome i optymalne wykorzystanie:\n- narzędzi Twórczego Umysłu, tj.: wyobraźnia, wizualizacja, improwizacja, synteza, dialog wewnętrzny, intuicja, kreatywność,\n- wiedzy na temat przebiegu Procesu Twórczego i jego struktury (etapów, punktów krytycznych),\n- wiedzy i umiejętności Organizacji Pracy Twórczej,\n- dostępnych zasobów i narzędzi (materialnych i niematerialnych),\n- naszych indywidualnych cech i zdolności oraz potencjału,\n\nw celu stworzenia i zapewnienia maksymalnie sprzyjających warunków (zewnętrznych i wewnętrznych) dla pomyślnego ukierunkowania Procesu Twórczego, dzięki czemu zakończy się on sukcesem – stworzeniem czegoś jakościowo nowego.\n\n#### Uproszczona definicja ZPT\n\nInnymi słowy,\n\nUmiejętność Zarządzania Procesem Twórczym jest niezbędna, by uruchomić i zorganizować Proces Twórczy w taki sposób, by zawsze kończył się co najmniej wygenerowaniem pomysłu/ rozwiązania postawionego Problemu Twórczego (nawet bez jego “fizycznej” realizacji/ materializacji).\n\n## Zarządzanie całością, ale też każdym aspektem z osobna\n\nProces Twórczy jest procesem bardzo złożonym. Jest nie tylko wieloetapowym procesem, który przebiega na poziomie świadomości i podświadomości, ale także angażuje wszystkie narzędzia Twórczego Umysłu, nasze zdolności i predyspozycje, zasoby i narzędzia, wymaga odpowiedniej organizacji pracy.\n\nW związku z tym, na Zarządzanie Procesem Twórczym składa się:\n\n- zarówno zarządzanie wszystkimi procesami, narzędziami i warunkami, które mają wpływ na Proces Twórczy i jego wynik, jako całością,\n- ale także zarządzanie każdym z tych elementów z osobna.\n\nZapewne jest tak, że niektórymi aspektami już w tym momencie zarządzasz (i wykorzystujesz) lepiej, niż innymi. Efekt Procesu Twórczego zależy natomiast od całokształtu i “wypadkowej” wydajności każdego z procesów i narzędzi biorących w nim udział.\n\nMożna oczywiście “pociągnąć” cały Proces Twórczy na jednym z nich, ale jest to bardzo czaso- i energochłonna oraz niewydajna praca, która najczęściej nie przynosi zadowalających efektów.\n\nDlatego niezbędną jest podstawowa wiedza (i w ogóle świadomość) nt. każdego z obszarów Zarządzania Procesem Twórczym.\n\n## Świadome a intuicyjne ZPT. Trzymasz stery czy jesteś zakładnikiem/czką?\n\nProcesem Twórczym można zarządzać świadomie lub podświadomie (intuicyjnie).\n\nWielu twórców, a także większość z nas, którzy nie uważają się za “twórców/ artystów” (co jest oczywiście ogromnym błędem!), intuicyjnie zarządza swoim Procesem Twórczym, czyli tworzy tak, jak… czuje. Właśnie dlatego tak często jesteśmy zakładnikami natchnienia, motywacji, rozmaitych bodźców zewnętrznych i wewnętrznych.\n\nDziałamy impulsywnie, reaktywnie (czyli nasze działania zawsze są odpowiedzią na bodziec z zewnątrz) i nie mamy w gruncie rzeczy żadnej świadomej kontroli (mimo że może nam się wydawać inaczej) nad Procesem Twórczym (m. in. z powodu braku wiedzy na temat Zarządzania Procesem Twórczym).\n\nOwszem, intuicyjne Zarządzanie Procesem Twórczym może być świetną, nieskrępowaną zabawą i prowadzić do wartościowych odkryć i wytworów. Wszak Podświadomość i Intuicja są potężnymi narzędziami Twórczego Umysłu – w końcu to właśnie z Podświadomości wyłaniają się pomysły! Niemniej jednak jest to bardzo nieefektywny/ nieproduktywny sposób zarządzania swoją twórczością.\n\nOczywiście, nie musisz być produktywny/a i efektywny/a, ale jeśli chcesz tworzyć “seryjnie”, regularnie i na najwyższych obrotach (wymaga tego od Ciebie np. charakter Twojej pracy), to nie możesz tworzyć wyłącznie intuicyjnie.\n\nIm szybciej nauczysz się świadomego Zarządzania Procesem Twórczym, tym lepiej dla Ciebie i Twojej twórczości/ pracy.\n\nKażdy z nas na pewno miewał pojedyncze twórcze olśnienia/ nagły przypływ natchnienia i wtedy powstawało coś nowego (wiersz, piosenka, rysunek, tekst, referat, biznesplan itd.).\n\nJeśli z kolei chcemy tworzyć regularnie (a jeśli chcesz odnieść sukces (także twórczy) – musisz to robić), trzeba nauczyć się tym Olśnieniem i Natchnieniem zarządzać w sposób świadomy. W tym celu stworzyłem Koncepcję i System Zarządzania Procesem Twórczym.\n\n## 4 filary Zarządzania Procesem Twórczym\n\nZarządzanie Procesem Twórczym opieram na 4 filarach, które stanowią (subiektywnie wybrane) obszary: teoretyczny (koncepcyjny), praktyczny, organizacyjny i wizualny.\n\n![ilustracja system zarządzania procesem twórczym](img/system-zarzadzania-procesem-tworczym-vadim-gierko.jpg)\n\n### I. Koncepcja teoretyczna ZPT. Wiedza nt. przebiegu i struktury Procesu Twórczego\n\nProces Twórczy, mimo że dla wielu może wydawać się czymś chaotycznym, posiada dość ścisłą, określoną strukturę: Etapy i (jak to określiłem) „Punkty Krytyczne”, przez które musimy przebrnąć, by ostatecznie coś stworzyć.\n\nKoncepcja przebiegu i struktury Procesu Twórczego, na której oparte jest ZPT, wywodzi się z klasycznej teorii etapów Procesu Twórczego Helmholtza-Poincarégo-Wallasa.\n\nWedług tej koncepcji, na Proces Twórczy składają się następujące etapy:\n\n- Przygotowanie\n- Inkubacja\n- Olśnienie\n- Weryfikacja\n\nKlasyczną koncepcję etapów Procesu Twórczego opisałem w jednym z pierwszych artykułów na poprzednim blogu pt. 4 etapy Procesu Twórczego, czyli skąd się biorą pomysły? Nota bene był to drugi najczęściej czytany artykuł (ponad 3900 razy)! Obecnie zagadnienie to jest szczegółowo omówione w moim ebooku, natomiast zastanawiam się nad tym, aby opublikować ten obszerny wpis tutaj…\n\nWzbogaciłem i rozwinąłem dotychczasową teorię nt. etapów Procesu Twórczego, wprowadzając kilkanaście innowacji.\n\nW mojej opinii, uzupełniły i odmieniły klasyczną koncepcję w znacznym stopniu. Na tyle, bym mógł mówić o niej w obecnej formie jako o własnej.\n\nM. in. wprowadziłem i zdefiniowałem Punkty Krytyczne (wróć do powyższej ilustracji):\n\n- Punkt Inicjujący,\n- Martwy Punkt,\n- Punkt Zwrotny;\n- Etap Olśnienia z kolei “zdegradowałem” do punktu – Punktu Przełomowego, ponieważ jest to “błysk”, a nie długotrwały etap.\n\nEtapom i Punktom Krytycznym poświęciłem osobne obszerne rozdziały w moim ebooku i jest to jedyne miejsce, gdzie możesz zaczerpnąć wiedzę nt. tych autorskich innowacji. Są one omówione bardzo szczegółowo i do każdego z etapów jest dołączony osobny zestaw Pytań Kontrolnych.\n\nWspomniane Etapy i Punkty Procesu Twórczego są osią Koncepcji i Systemu ZPT i pryzmatem, przez który zawsze patrzę na swoje Projekty i twórczość innych osób. Już sama wiedza na temat istnienia etapów Procesu Twórczego jest wystarczająca, by inaczej (lepiej, bardziej świadomie i uporządkowanie) podejść do tworzenia.\n\nJest to niezbędna wiedza teoretyczna, poparta moimi wieloletnimi badaniami, analizą literatury przedmiotu i doświadczeniem, bez której niemożliwe jest sprawne Zarządzanie Procesem Twórczym.\n\nZresztą, rozwój Koncepcji Zarządzania Procesem Twórczym trwa nadal, tyle że “nie uzewnętrzniam swoich postępów”, ponieważ szykuję coś naprawdę wielkiego i nie chcę na razie tracić energii na pisanie bloga. Wolę skupić się na rozwoju nowego, bardziej kompletnego i interaktywnego produktu, o czym możecie przeczytać tutaj.\n\nDzięki zrozumieniu struktury i przebiegu Procesu Twórczego będzie Ci łatwiej zdiagnozować, w jakim „miejscu” jest aktualnie Twój Projekt, co pozwoli dobrać odpowiednie działania, których efektem ma być rozwój i realizacja Projektu.\n\nPonadto, dzięki tej wiedzy zaczniesz rozumieć i właściwie interpretować pewne trudności, które zawsze pojawiają się podczas Pracy Twórczej. Zrozumiesz ich źródła i będziesz wiedzieć, jak temu zaradzić i jak na to reagować.\n\nJuż sama zmiana myślenia na ten temat może doprowadzić do kardynalnej poprawy jakości Twojego Procesu Tworzenia. I w pewnym sensie, światopoglądu.\n\n### Pytania Kontrolne:\n\n(to jest przykład, jak wyglądają pytania kontrolne po każdym z rozdziałów w moim ebooku)\n\n- Czy zastanawiałem/am się nad tym, jak przebiega Proces Twórczy/ tworzenia?\n- Czy według mnie wiedza nt. przebiegu Procesu Twórczego i zarządzania nim poprawiłaby jakość mojej twórczości?\n- Czy w swojej pracy/ działalności/ hobby muszę być kreatywny/a, realizować projekty (nieważne czy są mniej lub bardziej twórcze), generować pomysły?\n- Czy jestem otwarty/a na nowe spojrzenie, wiedzę i przetestowanie nowych rozwiązań, aby tworzyć lepiej, zarówno pod względem ilości, jak i jakości?\n\n### II. System Zarządzania Procesem Twórczym krok po kroku\n\nByła teoria, teraz czas na praktykę! Mimo że wspomniałem, iż samo uświadomienie sobie tego, jak działa Proces Twórczy (Koncepcja teoretyczna przebiegu i struktury Procesu Twórczego), może zdziałać cuda, jeśli chodzi o naszą twórczą produktywność i kreatywność, to jednak cuda te pojawiają się wyłącznie w praktyce – implementacji założeń Koncepcji podczas realizacji Projektów.\n\nTak naprawdę każdy Twórca ma swój System Zarządzania Procesem Twórczym. Jest nim pewny zestaw określonych czynności, które zawsze podejmujemy podczas Pracy Twórczej nad jakimś Projektem lub pomysłem. Są to pewne nawyki, które towarzyszą naszemu tworzeniu, pewne warunki czy czynności, które wprowadzają nas w stan flow, “twórczy klimat”. Każdy ze znanych twórców miał swoje, czasami “dziwne” przyzwyczajenia.\n\nTeż mam swój System, który powstał w oparciu o moje twórcze doświadczenia oraz wnioski z moich dociekań teoretycznych. W trakcie swoich badań, Koncepcję teoretyczną przekształciłem w praktyczny System Zarządzania Procesem Twórczym.\n\nSkładają się na niego szczegółowe Pytania Kontrolne, wskazówki, checklisty i rady, które krok po kroku przeprowadzą nas przez cały Proces tworzenia i pracy nad Projektem. Krok po kroku, odpowiadając na poszczególne pytania i podejmując wymienione działania, będziesz przybliżał/a się do realizacji Twojego Projektu.\n\nNa końcu każdego rozdziału mojego ebooka znajduje się lista Pytań Kontrolnych odnoszących się bezpośrednio do lektury. Jeśli wydrukujesz same Pytania Kontrolne (a tego jest ponad 20 stron), otrzymasz najbardziej skondensowany przewodnik po Procesie Twórczym.\n\nZresztą, na końcu poprzedniego rozdziału tego wpisu widziałeś/aś przykład takich pytań. Poniżej także.\n\n### Pytania Kontrolne:\n\n- Czy mam swój System ZPT (nawet jeśli jest podświadomy) – sekwencję kroków, które podejmuję w trakcie tworzenia? Zapisz te kroki i zastanów się nad nimi.\n- Czy w ogóle zakładałem/am, że można zarządzać Procesem Twórczym?\n- Czy zarządzam swoją twórczością/ Projektami świadomie czy bardziej intuicyjnie?\n- Ile swoich pomysłów/ Projektów wrzuciłem/am do szuflady i nie zrealizowałem/am? A o ilu swoich pomysłach w ogóle zapomniałem/am? Dlaczego? - Czy dobrze mi z tym? Może problem tkwi w braku Organizacji i Systemu Pracy Twórczej?\n- Czy uważam, że stać mnie na więcej w aspekcie twórczym?\n\n\n### III. Organizacja Pracy Twórczej\n\nO tym, jak ważna jest organizacja pracy (każdej, niekoniecznie twórczej), nie trzeba chyba wspominać. Jeśli nie stworzysz sobie maksymalnie sprzyjających warunków (które oczywiście będą się zmieniać w trakcie Twojego rozwoju twórczego oraz w zależności od rodzaju Projektów), to Twój Proces Twórczy może się niepotrzebnie wydłużyć (ale także zaburzyć).\n\nOrganizacja Pracy Twórczej jest częścią fundamentu naszych działań kreatywnych i każdego naszego Projektu. I wydaje się, że akurat na ten aspekt ZPT mamy największy realny wpływ.\n\nSystem Organizacji Pracy Twórczej jest uzupełnieniem Systemu Zarządzania Procesem Twórczym. Pokażę Ci, jak ja to robię oraz co w tym zakresie proponują eksperci. Pamiętaj jednak, że jest to sprawa w dużym stopniu indywidualna.\n\nNa Organizację Pracy Twórczej składa się m. in.: analiza naszych potrzeb twórczych, organizacja Miejsca Pracy Twórczej, organizacja Sesji Pracy Twórczej i wiele innych obszarów.\n\nNp. z lektury rozdziału o *Organizacji Pracy Twórczej* dowiesz się m. in. o tym jak:\n- organizować (fizycznie) swój Projekt (stworzymy Folder Projektu),\n- zapanować nad (i uporządkować) wszystkimi swoimi pomysłami (założymy [Wielką Księgę Pomysłów](/jak-uporzadkowac-pomysly-wielka-ksiega-pomyslow)),\n- zorganizować i usprawnić swoją Pracę Twórczą w domu, biurze, ale także w każdym innym miejscu. Powiemy m. in. o Niezbędniku Łowcy Pomysłów oraz Mobilnej Teczce Aktualnych Projektów,\n- [jak dokumentować swój Proces Twórczy/ pracę nad Projektem](/dokumentacja-procesu-tworczego-dlaczego-warto-jak-to-robic-krok-po-kroku), tworzyć listy działań oraz zrobić Twórcze Porządki.\n\n### IV. Narzędzia Myślenia Wizualnego w Procesie Twórczym\n\nNarzędzia Myślenia Wizualnego, tj. [mapy myśli](/mapy-mysli-jak-je-tworzyc-i-jak-z-nich-korzystac), [notatki wizualne](/jak-notowac-efektywnie-rob-notatki-wizualne) (i inne rodzaje notatek nielinearnych), rysowanie i wszelkie wizualizacje (wykresy, schematy) nie tylko sprzyjają powstawaniu oraz rozwojowi pomysłów i Projektów, ale także są narzędziami planowania i organizacji.\n\nBez Narzędzi Myślenia Wizualnego nie poradziłbym sobie z organizacją swojej Pracy Twórczej, nie rozwinąłbym w takim stopniu swoich pomysłów i Projektów, nie sformułowałbym wspomnianej Koncepcji, ani nie napisałbym tylu tekstów na poprzednim blogu.\n\nZ rozdziału o narzędziach myślenia wizualnego dowiesz się, [jak tworzyć i wykorzystywać mapy myśli](/mapy-mysli-jak-je-tworzyc-i-jak-z-nich-korzystac), [notatki wizualne](/jak-notowac-efektywnie-rob-notatki-wizualne) oraz rysowanie (bez żadnych umiejętności w tym zakresie) w procesie generowania i rozwoju pomysłów oraz planowania i realizacji Projektów.\n\nMapy myśli są podstawą mojej pracy zarówno twórczej, jak i zawodowej. Każdy artykuł, wiele postów, każdy z moich Projektów, powstał w oparciu o mapy myśli, które zacząłem tworzyć jeszcze na studiach. Są one także moim podstawowym sposobem na utrwalanie wiedzy, a codziennie przyswajam naprawdę dużo wiedzy z książek oraz artykułów.\n\nWykresy zawarte w moim ebooku, ale także w niektórych artykułach i wpisach, są przykładem wykorzystania Wizualizacji podczas Pracy Twórczej, odkrywczej, konceptualnej. Niejednokrotnie Wizualizacje „wyprzedzają” logiczne odkrycia podczas pracy nad rozwojem pomysłów i Projektów.\n\nWszelkie wizualizacje wspierają także burze mózgów (zarówno indywidualne, jak i grupowe), a także prezentacje pomysłów. Nie lekceważ potęgi Myślenia Wizualnego!\n\n## Nauka Zarządzania Procesem Twórczym\n\n*Jeśli nie tworzysz, nie będziesz prosperował, choćbyś był bardzo utalentowany i znakomicie wykwalifikowany*.\n\n© Cal Newport, autor książki *Praca głęboka*\n\nUważam, że Zarządzanie Procesem Twórczym jest jedną z superumiejętności XXI (w gruncie rzeczy każdego) wieku, którą warto posiadać. Wydaje się być oczywistym, że zalety bycia twórczym/ą nie wymagają uzasadnienia.\n\nWiększość z nas, jak już wspominałem, intuicyjnie zarządza swoim Procesem Twórczym, w związku z czym często jesteśmy zakładnikami naszego natchnienia. Naszą twórczością rządzi chaos (może i twórczy, ale jednak chaos). Możemy odnosić wrażenie, że pomysły raczej nam się „przydarzają”, niż że mamy nad nimi jakąkolwiek kontrolę.\n\nNie twierdzę oczywiście, że jesteśmy w stanie w 100% kontrolować efektu końcowego naszego Procesu Twórczego i naszej podświadomości. Twierdzę tylko, że mamy możliwość usprawnienia i ukierunkowania tego Procesu, co znacząco poprawia naszą twórczą produktywność.\n\nOd setek lat twórczość była owiana tajemnicą i panował pogląd, że trzeba się „z tym urodzić”. Na szczęście, twórczość została w dużym stopniu “odczarowana” i większość badaczy twierdzi, że tworzenia można się nauczyć. Jak najbardziej popieram i promuję to twierdzenie!\n\n### Dlaczego warto?\n\nWiedza i umiejętność Zarządzania Procesem Twórczym jest przydatna dla każdego, kto w ramach swojej działalności zawodowej, hobbystycznej lub nauki generuje i rozwija/ chce generować/ rozwijać nowe pomysły/ projekty.\n\nPonadto wiedza nt. przebiegu Procesu Twórczego i umiejętność zarządzania nim przyda się także osobom na stanowiskach kierowniczych, menadżerom, nauczycielom, rodzicom, liderom, czyli wszystkim osobom, które “mają pod sobą (kreatywnych) ludzi/ zespoły”.\n\nOpanowanie niełatwej sztuki Zarządzania Procesem Twórczym powoli Ci:\n\n- przejąć kontrolę nad swoim Procesem Twórczym,\n- wyzwolić się spod dyktatu natchnienia, weny, odpowiedniego „twórczego klimatu”,\n- tworzyć wtedy, kiedy się nie chce,\n- być bardziej produktywnym/ą twórczo,\n- tworzyć więcej/ „seryjnie”,\n- tworzyć lepiej pod względem jakości, jak i wartości,\n- zaoszczędzić więcej czasu i nerwów,\n- trzymać swoje Projekty „w ryzach”,\n- uporządkować swoją twórczość (niezależnie od tego, czym się zajmujesz),\n- przezwyciężyć większość stricte „twórczych/ artystycznych” problemów,\n- wypracować pewną „twórczą rutynę”,\n- „zaprogramować” swój umysł na tworzenie jakościowo nowych rzeczy i pomysłów.\n\n### Czy można nauczyć się Zarządzania Procesem Twórczym?\n\nNie mamy w 100% bezpośredniego wpływu na jakość, kształt, wartość pomysłu, ani na czas, niezbędny do jego wygenerowania, ale…\n\nMamy natomiast wpływ na sposób, w jaki zarządzamy Procesem Twórczym. To akurat możemy kontrolować.\n\nUmiejętność świadomego Zarządzania Procesem Twórczym bez wątpienia usprawni wszystkie nasze osiągnięcia twórcze i jakość pomysłów. Ponadto sprawi, że będziemy tworzyć efektywniej i szybciej.\n\nUważam, że świadomego ZPT można nauczyć się samodzielnie, drogą prób i błędów, analizy i refleksji, lektury odpowiedniej literatury oraz praktyki.\n\nJak się zmienia Twój Proces Twórczy, kiedy zaczynasz nim świadomie zarządzać? Odpowiedź jest zawarta w poniższej ilustracji!\n\n![ilustracja Zarządzanie Procesem Twórczym przed i po lekturze](img/przed-po.jpg)\n\n### 3 sposoby nauki Zarządzania Procesem Twórczym\n\n#### Samodzielnie. Co do tego jest potrzebne?\n\nPraktyka, praktyka i jeszcze raz praktyka, czyli… tworzenie właśnie! Realizuj swoje większe i mniejsze Projekty Twórcze. No i refleksja. Dużo refleksji, analizy, robienia wniosków i “badania” sposobu (przyglądanie się), w jaki sposób tworzymy.\n\nI jeszcze warto dodać czytanie literatury przedmiotu – warto czerpać ze zdobyczy poprzedników, by nie wynajdywać roweru na nowo.\n\n#### Razem ze mną. Lektura niniejszego bloga, Instagram\n\nZajrzyj na mojego imiennego [Instagrama](https://www.instagram.com/vadim.gierko/) lub [Facebooka](https://pl-pl.facebook.com/lowcapomyslow/) (lepiej na Instagrama), gdzie łącznie obserwuje mnie ponad 1000 osób, opublikowałem tam ponad 200 postów (starsze posty zostały zarchiwizowane).\n\n#### Lektura ebooka *Zarządzanie Procesem Twórczym*\n\nEbook [*Zarządzanie Procesem Twórczym*](/ebook-zarzadzanie-procesem-tworczym) jest jedynym w swoim rodzaju praktycznym poradnikiem i przewodnikiem Zarządzania Procesem Twórczym krok po kroku.\n\nKsiążka ma prawie 300 stron i zawiera Koncepcję i System Zarządzania Procesem Twórczym w całej okazałości. Niniejszy artykuł jest tak naprawdę preludium do tej książki. Zresztą, jest to praktycznie skopiowany wprowadzający rozdział z dodatkiem kilku linków i kilkoma uzupełnieniami.\n\n![okładka ebooka Zarządzanie Procesem Twórczym](img/okładka-ebook-zarządzanie-procesem-twórczym-Vadim-Gierko-książka-1024x768.jpg)\n\n## Pytanie na koniec\n\nTo jak? Jesteś gotów/ gotowa do zgłębiania tajników Zarządzania Procesem Twórczym? Jeśli tak, to nie ukrywam, że jest przed Tobą dużo pracy oraz… odkryć! Poświęć chwilę na zastanowienie się nad pytaniami, które zawarłem w niniejszym tekście.\n\nJuż wiesz, czym jest Zarządzanie Procesem Twórczym. Jest to obszerna dziedzina. Nie żałuję ani jednego dnia w ciągu ostatnich kilku lat, kiedy krok po kroku zbierałem materiały, doświadczenia i konstruowałem swoją Koncepcję cegła po cegle.\n\nA Koncepcja nadal się rozwija, ponieważ jest Procesem Twórczym samym w sobie. Zakładam aktualizacje ebooka w przyszłości, który zostanie teraz najprawdopodobniej przeniesiony na stronę estante.pl, ale także dedykowany kurs online!\n"
        }
      },
      "jak-uporzadkowac-pomysly-wielka-ksiega-pomyslow": {
        "category": "creative-process-management",
        "itemType": "article",
        "metadata": {
          "title": "Jak uporządkować pomysły? Wielka Księga Pomysłów",
          "description": "Każdy pomysł trzeba zanotować. Jak z kolei zadbać o porządek w swoich notatkach, projektach i nie utracić żadnego pomysłu? Mam na to sposób - Wielka Księga Pomysłów! Czytaj dalej i załóż swoją Księgę!",
          "link": "/jak-uporzadkowac-pomysly-wielka-ksiega-pomyslow",
          "img": {
            "src": "/img/jak-uporzadkowac-pomysly-wielka-ksiega-pomyslow-vadim-gierko-artykul-organizacja-pracy.png",
            "alt": "ilustracja segregator wielka księga pomysłów organizacja pracy"
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "content": "\nZapisywanie pomysłów jest bardzo ważnym aspektem pracy twórczej. Jest to czynność, którą często zaniedbujemy, co skutkuje zapominaniem pomysłów oraz brakiem uruchomienia Procesu Twórczego (patrz [ten artykuł](/zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia)).\n\nZ kolei, jeśli notujemy pomysły, pojawia się kolejny problem: olśnienie i natchnienie może nas dopaść wszędzie i w każdym momencie. Dlatego notujemy najczęściej na wszystkim, co jest pod ręką.\n\nW związku z tym powstaje sterta notatek i jeden wielki bałagan. Dlatego warto zbierać swoje pomysły w jednym miejscu – w Wielkiej Księdze Pomysłów.\n\n## Czym jest Wielka Księga Pomysłów?\n\nZgodnie z zasadą “od ogółu do szczegółu”, najbardziej uniwersalnym i najprostszym sposobem przechowywania i organizacji pomysłów jest coś, co nazwałem Wielka Księga Pomysłów.\n\nKsięgą jest wyłącznie z nazwy. Może to być folder, teczka, gruby notes, zeszyt, szkicownik, natomiast w bardziej zaawansowanym przypadku – segregator.\n\nKilka lat temu zebrałem wszystkie skrawki, na których notowałem pomysły oraz przejrzałem zawartość komputera i przepisałem je do grubego zeszytu. Tak powstała Księga. Potem były kolejne zeszyty, teczki, segregator (ogólny na wszystkie pomysły). Z czasem niektóre pomysły urosły do rangi projektów i zacząłem zakładać dla nich osobne teczki/ segregatory.\n\nChciałbym powiedzieć, że zawsze mam przy sobie Księgę i że wszystko notuję wyłącznie w niej, ale tak niestety (albo „stety”!) nie jest. Niemniej jednak, dzięki niej wiem, co zrobić ze wszystkimi tymi świstkami, wycinkami, karteczkami, które powstały w przypływie nagłego natchnienia.\n\nDlatego moja Księga przypomina bardziej kolaż, niż skrzętnie prowadzony dziennik. Wszystko ostatecznie jest wklejane, wkładane, przepisywane lub wszywane do Księgi (lub Teczki projektu). Dzięki temu wiem, gdzie szukać tej serwetki lub paragonu, na którym zanotowałem jakiś pomysł – jest on w Wielkiej Księdze Pomysłów.\n\n## Od czego zacząć? Tworzymy Wielką Księgę Pomysłów krok po kroku\n\n### Zbierz wszystkie zanotowane pomysły i niedokończone Projekty\n\nZnajdź i uporządkuj swoje wcześniejsze Projekty. Mogą to być notatki, eseje, niedokończone książki, obrazy, utwory, rękodzieła, pomysły na biznes, wszystko, nad czym pracowałeś/aś.\n\n### Włóż je do jednego Segregatora\n\nWłóż wszystko, co znalazłeś, do jednego segregatora lub przepisz do zeszytu, notesu (lub w pliku/ach tekstowych).\n\n### Uzupełnij je pomysłami/ Projektami, które przechowujesz na komputerze/ telefonie\n\nTo samo zrób ze swoim komputerem i telefonem. Są one nieodzownym narzędziem pracy, rozrywki, twórczości, ale też… współczesnymi stajniami Augiasza. Wyszukaj wszystkie niedokończone, porzucone, zapomniane pomysły i Projekty. Nie skupiaj się na jednym formacie.\n\nMoje pomysły są zarejestrowane zarówno w formie tekstowej, dźwiękowej (motywy muzyczne), jak i wizualnej (kreatywne notatki, mapy myśli lub ich skany).\n\n### Stwórz cyfrową kopię Wielkiej Księgi Pomysłów na komputerze\n\nWrzuć wszystkie pliki do cyfrowego Wielkiego Folderu Pomysłów/ Wielkiej Księgi Pomysłów w formie elektronicznej na komputerze/ telefonie.\n\nWielka Księga Pomysłów może być, a w pewnym momencie musi przybrać formę elektroniczną. Powstaje wtedy Wielki Folder Pomysłów na komputerze (lub w chmurze). Elektroniczna oraz tradycyjna wersje Księgi muszą być “zsynchronizowane“. Wszelkie zmiany i dopiski należy uzupełniać w każdej z wersji, najlepiej po zakończonej sesji pracy.\n\nW Wielkim Folderze Pomysłów obowiązują takie same zasady, jak w Księdze. Najczęściej zaczynam od wersji papierowej, która z czasem się digitalizuje. Zdarza się, że najpierw powstaje plik tekstowy (np. krótki esej), który jest impulsem dla powstania szerszego Projektu. Projekt taki prowadzę zawsze symultanicznie w dwóch wersjach – papierowej i elektronicznej.\n\nAutor *Książeczki minimalisty* Leo Babauta, zaleca digitalizację wszystkiego, co jest w wersji papierowej, a potem pozbycie się papieru. Mimo że zgadzam się z Autorem w wielu kwestiach, to jednak nie potrafię pracować wyłącznie na komputerze. Po prostu muszę wydrukować to, co napisałem, i przyjrzeć się temu, gdyż w ten sposób jestem w stanie ogarnąć całość. Także, łatwiej mi jest wprowadzać zmiany i poprawki rysując/notując na papierze.\n\nMoja praca przypomina cykl: “coś” powstaje na papierze – przepisuję to na komputerze – drukuję – robię poprawki, dopisuję, redaguję wersję wydrukowaną – przepisuję ją na komputerze – drukuję aktualną wersję itd.\n\n### Kreatywne Porządki. Zobacz, ile stworzyłeś/aś!\n\nDzięki czynnościom, które opisałem w powyższych podrozdziałach, przekonasz się, że miałeś/aś wiele świetnych i ciekawych pomysłów. Będziesz miał/a okazję przypomnieć, co Cię interesowało, (na nowo odkryć) jakie miałeś/aś talenty, prześledzisz swój twórczy rozwój.\n\nByć może natkniesz się na jakiś niedokończony Projekt lub świetny pomysł, który znowu roznieci ogień Twojej Twórczości. Wydawało Ci się, że niczego ciekawego nie robiłeś/aś, a jednak robiłeś/aś, i to nie mało. Takie porządki są niezwykle inspirujące, dlatego też sprzątanie jest jednym z moich 10 sposobów na natchnienie.\n\n### Kiedy pomysł z Księgi przeistoczy się w Projekt – załóż osobny Folder Projektu i zrób jego cyfrową wersję\n\nMimo że mam Wielką Księgę Pomysłów, rozwój wielu pomysłów przeistoczył się w Projekty, których objętość zaczęła wykraczać poza możliwości mojej Księgi. Dlatego te projekty zostały wyodrębnione z Księgi.\n\nZawsze, kiedy pomysł staje się Projektem, wydzielam osobną teczkę lub koszulkę dla tego projektu. Taka teczka czy koszulka zawsze zawiera w sobie wszystko, co powstało w wyniku pracy nad Projektem. Jest to taki „śmietniczek” wypełniony kartkami, wycinkami, wydrukami itd. Taką teczkę/koszulkę również zabieram ze sobą, by w każdej wolnej chwili móc pracować nad rozwojem aktualnego Projektu.\n\n### Dbaj o porządek w Wielkiej Księdze Pomysłów i Folderach podczas każdej Sesji Pracy\n\nŻeby Wielka Księga Pomysłów, Foldery Projektów itd. nie pękły w szwach, to czas od czasu należy robić w nich „czystkę”. Wyrzucaj zbędne rzeczy, przepisuj, redaguj.\n\nSystematycznie przeglądaj/uzupełniaj Wielką Księgę Pomysłów (zarówno tradycyjną, jak i elektroniczną) oraz Teczki Projektów. Po każdej sesji pracy rób w niej “czystkę”\n\nTakie „wietrzenie magazynów” należy robić raz na jakiś czas, by nie powstał bałagan, najlepiej po ostatniej sesji pracy nad Projektem. Jedyny bałagan, na jaki możesz sobie pozwolić, to „nieład artystyczny”.\n\nNieład artystyczny tak długo jest „nieładem artystycznym”, dopóki nie przestaje nas inspirować oraz póki możemy odnaleźć się w naszych notatkach. Jeśli już nie, to znaczy że jest to zwykły bałagan, którego należy się wystrzegać i z którym należy zrobić porządek.\n\nRobienie porządku w swoich notatkach może być niezwykle inspirujące, gdyż możemy natknąć się na pomysł, o którym zapomnieliśmy. Także takie porządkowanie zapisek i zarejestrowanych pomysłów (w każdej postaci) pełni funkcję “oczyszczającą” i odblokowuje nasz umysł.\n\n## Dla potomnych\n\nWielka Księga Pomysłów jest historią naszej twórczości, naszego rozwoju, tym, co pozostawimy po sobie. Należy zatem na poważnie podejść do jej prowadzenia. Mimo że czasami prowadzenie i uporządkowywanie Księgi może wydawać się żmudne, to jednak efekty zawsze są inspirujące.\n\nNa koniec przypomnę historię Leonarda Da Vinci, który zapisywał swoje spostrzeżenia naukowe i artystyczne, osobiste przemyślenia, a nawet rozliczenia i listy. Sporządził on ok. 7000 stron notatek, zakłada się natomiast, że było ich jeszcze około 6000.\n\nPrzed śmiercią Da Vinci uporządkował swoje notatki, powiązał je tasiemkami i oprawił zeszyty i notatniki w skórę. Po śmierci jego notatki były przekazywane z rąk do rąk i odkrywane na nowo. Właśnie dzięki nim wiemy, że Leonardo był nie tylko genialnym artystą. Był także (a może przede wszystkim) wybitnym wynalazcą i naukowcem, który wyprzedził swoją epokę o kilkaset lat.\n\nIle może być warta taka Wielka Księga Pomysłów? Jeden ze zbiorów notatek Leonarda, zawierający opisy badań i eksperymentów, został kupiony przez Billa Gatesa za ponad 30 milionów dolarów.\n\n## DOWIEDZ SIĘ WIĘCEJ NT. ORGANIZACJI PRACY TWÓRCZEJ!\n\nWielka Księga Pomysłów, Foldery Projektów itd. są częścią mojego Systemu Organizacji Pracy Twórczej (a każdy Projekt, jeśli prowadzi do powstania czegoś jakościowo nowego, jest twórczy).\n\nOrganizacja Pracy Twórczej jest jednym z filarów [Zarządzania Procesem Twórczym](/zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia). Zagadnienie to zostało omówione w obszernym rozdziale [mojego ebooka](/ebook-zarzadzanie-procesem-tworczym), dlatego zapraszam do lektury!\n\nM. in. w ebooku opisałem dokładnie, w jaki sposób najlepiej jest zorganizować Wielką Księgę Pomysłów i poszczególne Foldery. W tych wskazówkach zostały uwzględnione prawidłowości mające miejsce w Koncepcji Zarządzania Procesem Twórczym.\n"
        }
      },
      "dokumentacja-procesu-tworczego-dlaczego-warto-jak-to-robic-krok-po-kroku": {
        "category": "creative-process-management",
        "itemType": "article",
        "metadata": {
          "title": "Dokumentacja Procesu Twórczego. Dlaczego warto i jak to robić krok po kroku?",
          "description": "Dokumentacja Procesu Twórczego nie jest czymś “pobocznym”, tylko bardzo ważną częścią Twojej Twórczości (a może nią być każdy rodzaj działalności!) i Twojej Pracy (Twórczej). Czytaj dalej i dowiedz się dlaczego oraz poznaj sposoby na skuteczną dokumentację swojej Twórczości i pomysłów!",
          "link": "/dokumentacja-procesu-tworczego-dlaczego-warto-jak-to-robic-krok-po-kroku",
          "img": {
            "src": "/img/dokumentacja-procesu-tworczego-segregator-vadim-gierko-pomysly.png",
            "alt": "ilustracja artykułu o dokumentacji procesu twórczego młoda kobieta otoczona podobiznami żarówek trzyma w ręku segregatory"
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "content": "\nDlaczego warto i w jaki sposób dokumentować swoją Twórczość? Czytaj dalej i wykorzystaj dodatkowe narzędzie/ możliwości produktów “ubocznych” Twojej Twórczości!\n\n## Dlaczego dokumentacja Procesu Twórczego jest arcyważna?\n\nBardzo ważną rzeczą przy pracy nad Projektami (tymi bardziej i mniej twórczymi) jest dokumentacja naszej pracy.\n\nO tym, jak ważna jest Dokumentacja Procesu Twórczego, pisałem już w swoim [ebooku](/ebook-zarzadzanie-procesem-tworczym), zawierającym rozwijaną latami [Koncepcję Zarządzania Procesem Twórczym](/zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia).\n\nDzięki dokumentowaniu swojej pracy nad Projektami:\n\n- Śledzisz swoje twórcze postępy i rozwój.\n- Śledzisz postępy i rozwój w ramach Projektu.\n- Pozostawiasz ślad, który czasami jest bogatszy, niż ostateczny “produkt”.\n- Przy okazji mogą pojawić się nowe, “poboczne” pomysły i skojarzenia. Pamiętaj, by wszystko zanotować!\n- Nie utracisz żadnego pomysłu ani żadnej wersji, do których być może wrócisz.\n- Masz wgląd w swój tok myślenia. Walter Isaacson w swojej książce Leonardo da Vinci użył dokładnie tego sformułowania: dzięki szczegółowym notatkom Leonarda, mamy wgląd w jego umysł. Zresztą, wszystko, co wiemy o da Vinci i jego dokonaniach, zawdzięczamy jego notatkom. Dokumentował i notował wszystko!\n- Uczysz się dyscypliny i organizujesz swoją pracę.\n- Bonus: jeśli dzielisz się swoją twórczością/ projektami/ działalnością w mediach społecznościowych lub na blogu – masz content na posty/ wpisy.\n\n## Jak dokumentować swój Proces Twórczy? Kilka rad z mojego ebooka\n\nMożna to zrobić na wiele sposobów, a oto moje sposoby, które stosuję i polecam, i które w sposób naturalny wynikają z zasad, które dotyczą prowadzenia [Wielkiej Księgi Pomysłów i Folderów Projektów](/jak-uporzadkowac-pomysly-wielka-ksiega-pomyslow).\n\n### Zawsze zapisuj/ notuj datę (+ copyright)\n\n- każdego pomysłu,\n- każdej ważniejszej poprawki,\n- wskazówki,\n- komentarze własne,\n- zmiany koncepcji.\n\n### Zachowuj wszystkie wersje Projektu\n\n(no chyba że niektóre praktycznie niczym się nie różnią)\n\nOwszem, może tego trochę się uzbierać… Ale uwierz mi, że mogą okazać się bardzo przydatne, jeśli na przykład „zawrócimy z nowej ścieżki” i będziemy chcieli wrócić na „stare śmieci” (ileż razy robiłem to ze swoim ebookiem!).\n\nJeśli nie będą się mieścić w głównym Folderze/ Segregatorze, załóż osobne Archiwum. Ponadto, możesz po prostu wysyłać sobie wszystkie kolejne zapisane wersje Projektu na maila (lub dysk Google), każdorazowo dodając do nazwy Projektu datę zapisu, a pozbyć się wersji papierowych.\n\n### Dbaj o chronologię\n\nUkładaj (papierowe, analogowe) materiały chronologicznie – w kolejności ich powstania. Jeśli korzystasz z Segregatora i Projekt ma postać papierową, układaj najbardziej aktualne notatki/ materiały na wierzchu. Dlatego też warto na każdej kartce, notatce itd. zapisywać datę.\n\nDlaczego warto trzymać najbardziej aktualne notatki na wierzchu? Dlatego że będziemy od razu na bieżąco, kiedy zajrzymy do Segregatora. Z kolei, jeśli uzbieramy dużo wersji naszego Projektu, to te starsze można umieścić w Archiwum Projektu, jeśli jest naprawdę duży.\n\nJeśli chodzi o wersję cyfrową, sprawa wydaje się być prosta: do pliku zawsze jest automatycznie przypisywana data powstania, poprawek.\n\nSugerowałbym natomiast zawsze dopisywać także datę powstania/ poprawki do tytułu i zapisywać każdą wersję. Warto też to robić w formacie rok.miesiąc.dzień, żeby później lista była chronologiczna.\n\n### Zapisuj wszystko na wiele sposobów i na kilku nośnikach\n\n- w wersji papierowej i cyfrowej,\n- na mailu i dysku/ chmurze,\n- na komputerze i telefonie,\n- a nawet na pendrive‘ach i dysku zewnętrznym!\n\nZawsze lepiej mieć mniej dostępnej pamięci na urządzeniach/ online, niż utracić efekty swojej pracy. Plusem tego jest także możliwość dostępu do Projektu w każdym miejscu.\n\n### Rób zdjęcia, skany i nagrania\n\nZrób sobie selfie z tablicą korkową i zawalonym biurkiem w tle – może\nto zdjęcie przejdzie kiedyś do historii. Rób zdjęcia/ skany notatek, dopisków na materiałach, zdjęcia prototypów.\n\nMożesz także nagrywać krótkie filmy dokumentujące to, co się akurat dzieje i które można udostępnić np. w stories. Możesz także nagrywać swoje myśli/ komentarze na dyktafon w telefonie.\n\nPamiętaj tylko, żeby nie trzymać wszystkiego na telefonie. Wrzucaj to do Folderu Projektu, którego dotyczy lub do innego miejsca przeznaczonego do Dokumentacji Procesu Twórczego.\n\nOprócz pożytku dla celów dokumentacyjnych, takie zdjęcie/ skan mogą być materiałem na content. Możesz to wrzucić na swoje social media, jeśli chcesz pokazać światu, nad czym pracujesz lub na jakim etapie jesteś. Coraz częściej robię takie zdjęcia i wrzucam je do mediów społecznościowych.\n\n### Notuj pomysły i zbieraj notatki\n\nJeśli w trakcie pracy nad Projektem wpadasz na jakieś nowe pomysły odnośnie Organizacji swojej Pracy Twórczej, Zarządzania Twoim Procesem Twórczym lub po prostu masz jakieś refleksje – zapisz je!\n\nTakie notatki wykorzystałem mnóstwo razy w swoim ebooku. W sumie, co najmniej połowa treści książki to praktycznie wierna kopia takich notatek, zbieranych latami. I to samo dzieje się teraz, kiedy zebrałem notatki z ostatnich dwóch lat w celu napisania dwóch kolejnych (mniejszych) ebooków (m. in. nt. map myśli).\n\n### Dbaj o właściwe prowadzenie Wielkiej Księgi Pomysłów i Folderów Projektów\n\nDokumentowanie Procesu Twórczego i całej naszej twórczości stanie się/ będzie naturalne, jeśli po prostu będziemy dbać o właściwe prowadzenie:\n\n- Wielkiej Księgi Pomysłów i\n- Folderów Projektów lub\n- przynajmniej zapisywać datę na każdej notatce (które najwyżej później uporządkujemy).\n\n### Dokumentuj rozwój Projektów, ale także całokształt swojego Rozwoju Twórczego\n\nA jeśli będziesz miał/a czas, chęć i potrzebę, to możesz (po uprzednim uporządkowaniu Wielkiej Księgi Pomysłów i wszystkich swoich dotychczasowych Projektów) zrobić mega obszerną dokumentację całej swojej twórczości i dokonań!\n\nNie czekaj – jak Mozart i Leonardo da Vinci – aż ktoś to zrobi po Twojej śmierci!\n\nW pewnym sensie zacząłem to robić porządkując i segregując swoją całą dotychczasową twórczość w przeznaczonych do każdego Projektu segregatorach.\n\nZ drugiej strony, traktuję tą stronę (vadimgierko.com) jako miejsce, w którym konsoliduję swoje Projekty. Na poprzedniej (lowcapomyslow.pl) nie miałbym takiej możliwości.\n\n## Nowe pomysły na udokumentowanie Procesu Twórczego: online lub cyfrowo\n\nCi, którzy mi zaufali i stali się właścicielami ebooka w opcji z gwarancją dożywotniej aktualizacji, mogą po raz kolejny przekonać się, że moje zapewnienia odnośnie tego, że Koncepcja będzie się dalej rozwijać, nie były pustymi obietnicami. A dowodem jest poniższy akapit.\n\nW tym momencie mógłbym dopisać (co też znajdzie się kiedyś w aktualizacji ebooka – w środku wydrukowanego egzemplarza jest już kilkadziesiąt dopisków, włożonych notatek i pomysłów) kolejne sposoby na Dokumentację naszego Procesu Twórczego:\n\n### Prowadzenie bloga/ dziennika online\n\nw którym opisywalibyśmy postępy naszego ogólnego Rozwoju Twórczego lub też wybranego Projektu.\n\n### Prowadzenie bloga/ dziennika online “na niby”\n\nnp. w dokumencie tekstowym na komputerze lub w notatkach na telefonie. To jest dobre rozwiązanie, jeśli nie chcemy za bardzo afiszować się z naszymi projektami/ działaniami. Po prostu pisz swój dziennik w dowolnej aplikacji/ urządzeniu, ale../ nie publikuj 😉\n\nDo takiego dziennika także warto wklejać zdjęcia, filmy, dodawać załączniki.\n\nMożesz sobie wyobrazić, że prowadzisz bloga i masz społeczność. Taka wizualizacja może zmotywować Cię do:\n\n- regularnej pracy nad Dziennikiem, ale także\n- przygotować Cię do prowadzenia bloga i budowania społeczności “w realu”.\n\nDużym atutem takiej formy prowadzenia Dziennika jest również to, że masz już gotowy do przekopiowania tekst do np.:\n\n- przyszłego bloga,\n- mediów społecznościowych,\n- przyszłej książki, ebooka, kursu 😉\n\n### Prowadzenie dziennika online w mediach społecznościowych\n\nFunkcję Twojego Dziennika Twórczego online może pełnić np. Instagram lub Facebook, lub inne medium społecznościowe. Mogą to być posty, ale też bardzo popularne obecnie stories. Tam możesz wrzucać właśnie zdjęcia, nagrania, krótkie wpisy itd.\n\nNo i w odróżnieniu od Dziennika “na niby”, tutaj rzeczywiście możesz od razu budować swoją społeczność i mieć namiastkę bloga. Chociaż… wcale nie musisz tego robić – możesz do tego podejść na luzie, bez większych oczekiwań. Potraktować jako test.\n\nTwoim zadaniem jest przede wszystkim regularne Twórcze Sprawozdania wobec samego/ej siebie, a nie walka o obserwujących czy lajki.\n\n## Moja dokumentacja Procesu Twórczego przed i obecnie\n\nPonieważ jestem “na wskroś analogowy”, to moje wcześniejsze Dokumentowanie Procesu Twórczego było wyłącznie analogowe:\n\n- mnóstwo notatek,\n- mapy myśli,\n- dopiski do wydrukowanych materiałów.\n\nPotem zacząłem coraz częściej pisać takie Twórcze Sprawozdania w dokumencie tekstowym ze względu na to, że:\n\n- czasami te notatki bardzo się rozrastały, a poza tym\n- łatwiej było później to wykorzystać w działalności online, o czym już wspominałem oraz\n- można bezpośrednio (lub do folderu) dodać zdjęcia, grafiki, mapy myśli.\n\n## Podsumowanie\n\nWiesz już, że Dokumentacja Procesu Twórczego jest bardzo ważną częścią Twojej Twórczej Pracy.\n\nPoznałeś/aś także sposoby na dokumentację swojej twórczości oraz jak to robić krok po kroku.\n\nPozostaje już tylko jedna rzecz – działanie!\n\nZacznij dokumentować swoją pracę nad Projektami, twórczość i wszelkie inne przejawy kreatywności. Wiesz przecież, jak można później to wykorzystać – możliwości jest naprawdę dużo!\n\nJeśli z kolei dokumentujesz już swój Proces Twórczy, to sprawdź, czy możesz uzupełnić swój sposób o wybrane wskazówki z niniejszego artykułu.\n\nDaj znać, jak Ci idzie lub podziel się swoimi patentami tutaj lub na moim Instagramie pod postem z Ilustracją do tego artykułu.\n"
        }
      },
      "jak-media-spolecznosciowe-stymuluja-rozwoj-tworczy-i-kreatywnosc-przyklad-instagrama": {
        "category": "creative-process-management",
        "itemType": "article",
        "metadata": {
          "title": "Jak media społecznościowe stymulują rozwój twórczy i kreatywność? Przykład Instagrama",
          "description": "Tworzysz, ale nie ma Cię w mediach społecznościowych? A może jesteś, ale nie dzielisz się tam swoją twórczością z innymi? Wiele tracisz! Klikaj w artykuł, a dowiesz się, jak możesz zostać lepszym Twórcą i zwiększyć swoją kreatywność dzięki mediom społecznościowym!",
          "link": "/jak-media-spolecznosciowe-stymuluja-rozwoj-tworczy-i-kreatywnosc-przyklad-instagrama",
          "img": {
            "src": "/img/instagram-media-spolecznosciowe-rozwoj-tworczy-kreatywnosc-vadim-gierko-notatka-wizualna-1024x1024.jpg",
            "alt": "notatka wizualna jak instagram stymuluje kreatywność i rozwój twórczy"
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "content": "\nTworzysz (grasz na instrumencie, rysujesz, projektujesz, śpiewasz, tańczysz, zajmujesz się rękodziełem itd.), ale nie ma Cię w mediach społecznościowych?\n\nA może masz Instagrama, Facebooka, Tiktoka lub Youtube’a, ale nie dzielisz się swoją twórczością z innymi? Wiele tracisz!\n\nI nie chodzi o lajki, udostępnienia, komentarze i… przyciąganie potencjalnych klientów, tylko o Twój Twórczy Rozwój i kreatywność!\n\nCzytaj dalej, a opowiem Ci, jak możesz zostać lepszym Twórcą i zwiększyć swoją kreatywność dzięki mediom społecznościowym. Twój Wewnętrzny Artysta z pewnością Ci podziękuje! Po lekturze tego artykułu od razu zaczniesz dzielić się swoją twórczością z innymi!\n\nŻeby Cię ostatecznie przekonać do dalszej lektury, powiem o sobie tylko dwie rzeczy, żebyś mi zaufał/a.\n\nPo pierwsze, znam się na [Zarządzaniu Procesem Twórczym](/zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia), czego dowodem jest np. mój prawie 300-stronicowy [ebook](/ebook-zarzadzanie-procesem-tworczym) oraz [warsztaty](/warsztaty-zarzadzania-procesem-tworczym), które prowadziłem.\n\nPo drugie, rozwijam dwa profile na Instagramie:\n\n- imienny ([@vadim.gierko](https://www.instagram.com/vadim.gierko/)), na którym właśnie promuję Zarządzanie Procesem Twórczym i edukuję w tym zakresie,\n- [*Kreatywne Notatki*](https://www.instagram.com/kreatywnenotatki/), na którym dzielę się notatkami wizualnymi ze swoją ponad 2300-osobową społecznością, która zapisała moje posty kilka tysięcy razy.\n\n*PS. [Kreatywne Notatki są też na Facebooku](https://www.facebook.com/kreatywnenotatkipl/) i również skupiają wokół siebie ponad 2500 osób.*\n\nTo jak, wkraczamy w nową erę Twojego Rozwoju Twórczego dzięki mediom społecznościowym (w szczególności dzięki Instagramowi)?\n\n## Dlaczego Instagram?\n\nJedni kochają Instagrama, drudzy nienawidzą. I każdy ma trochę racji. Ja należę do tej pierwszej kategorii, mimo że nie zawsze tak było.\n\nInstagram przekonał mnie do siebie wtedy, kiedy zacząłem dzielić się swoją twórczością, przemyśleniami i wiedzą nt. Zarządzania Procesem Twórczym. Mój Projekt dzięki temu zaczął nabierać obrotów i się rozwijać. Wypromowałem bloga Łowca Pomysłów (2018-2020), a potem wydałem ebooka.\n\nA potem z niego wyłonił się kolejny projekt… profil Kreatywne Notatki!\n\nInstagram jest miejscem, w którym warto być i dzięki któremu Twój Projekt, twórczość i działalność wystartują jak rakieta.\n\nCokolwiek robisz, niezależnie od tego, czy na tym zarabiasz, czy nie – warto jest wyjść z tym do ludzi. Zarówno Ty, jak i Twoja Twórczość, kreatywność, działalność, hobby, projekt skorzystacie na tym.\n\nW jaki sposób? Czytaj dalej i poznaj najważniejsze argumenty!\n\n## Profil na Instagramie jest dziennikiem Twojego projektu i twórczego rozwoju\n\nTreści, które wrzucasz na swój profil na Instagramie (posty, grafiki, relacje, filmy itd.), tworzą chronologiczny dziennik Twojego Projektu/ firmy/ marki/ Twórczego Rozwoju.\n\nDlaczego to jest takie ważne?\n\n*O tym, dlaczego dokumentacja Procesu Twórczego jest arcyważna, napisałem w tym artykule -> [Dokumentacja Procesu Twórczego. Dlaczego warto i jak to robić krok po kroku?](/dokumentacja-procesu-tworczego-dlaczego-warto-jak-to-robic-krok-po-kroku).*\n\nŻaden pomysł, żadna “złota myśl”, którą się podzieliłeś/aś na Instagramie (czy była to zaplanowana publikacja, czy też improwizowałeś/aś), nie zginą i zawsze masz do nich dostęp.\n\nWidzisz (i inni, w szczególności Twoi obserwujący, także widzą), jak Twój projekt/ firma/ marka “rośnie” oraz jak się rozwijasz jako Twórca. Ten wzrost jest nie tylko powodem do dumy i satysfakcji z efektów Twojej pracy i zaangażowania, ale także źródłem cennej wiedzy.\n\nJeśli poświęcisz chwilę na analizę statystyk profilu, a nawet po prostu przejrzysz stare posty, zauważysz, co robiłeś/aś nie tak (a jest to bardzo ważny wniosek, gdyż nie będziesz w przyszłości marnować czasu na bezskuteczne działania), co “działa”, a co nie.\n\n## Profil na Instagramie jest Twoim portfolio i CV\n\nZ raportu z badań *Artysta-zawodowiec* wynika, że “niewielu studentów kierunków artystycznych jest gotowych do zaprezentowania swojej twórczości, a niespełna 50% studentów ostatniego roku ma przygotowane portfolio”…\n\nMimo że badania dotyczyły przyszłych wykształconych artystów, pokazują one bardzo niepokojącą statystykę. Skoro artyści boją się lub nie są przygotowani do tego, by pokazać, czym się zajmują, to co dopiero mają powiedzieć “amatorzy”. Nie powielajmy tych błędów i pokazujmy światu, co stworzyliśmy.\n\nTwój profil (w zależności od tego, co publikujesz) może stać się czymś w rodzaju “portfolio”. W ten sposób traktuję swój profil Kreatywne Notatki. Jest to galeria moich notatek wizualnych. Przyjemność sprawia mi już sam “rzut oka” na swój profil.\n\nPonadto, Twoja galeria/ feed jest świadkiem i unaocznieniem Twojego Twórczego Rozwoju. Możesz zobaczyć, jak wyglądały moje notatki półtora roku temu, przewijając galerię w dół. Dzięki temu widzisz, jak i czy się rozwijasz, a to jest niezbędne, by stawać coraz lepszym Twórcą.\n\nJeśli robisz coś ciekawego (a w szczególności niszowego) i możesz w jakiś sposób pokazać to na zdjęciu, grafice, to wystarczy komuś pokazać swój profil, zamiast opowiadać o tym. Inni chcą widzieć, co zrobiłeś/aś, a nie słuchać o tym.\n\nOczywiście, profil na Facebooku także jest w pewnym sensie Twoim portfolio, ale według mnie Instagram jest pod tym względem zdecydowanie bardziej “przejrzysty” – jest do tego wprost stworzony.\n\n## Instagram jest skarbcem inspiracji. Inspirujesz się i inspirujesz innych\n\nMożliwość obserwowania określonych hasztagów porządkuje treści, które są Ci wyświetlane, dzięki czemu nie scrollujesz bezmyślnie wszystkiego, jak leci (jak to np. ma miejsce na Facebooku) i nie tracisz swojego czasu.\n\nTakże zapisywanie interesujących postów jest dziecinnie proste (dziecinnie proste i przyjemne jest też później odnalezienie i przejrzenie tych postów), dzięki czemu tworzysz swój “skarbiec inspiracji”. Mam taki analogowy skarbiec, który nazywam Wielka Księga Pomysłów.\n\nPomysły chodzą parami… W tym sensie Instagram jest świetnym miejscem, do którego warto zajrzeć, by się zainspirować i nauczyć się czegoś nowego.\n\nWszystkich instagramowych “tricków” (cykle postów, sposób robienia zdjęć, określony schemat pisania postów itd.) nauczyłem się wyłącznie poprzez obserwowanie innych i wyławiania najciekawszych pomysłów.\n\nInstagram w związku z tym jest rajem dla wyznawców filozofii “kradnij jak artysta“. Na Instagramie możesz też śledzić swoją konkurencję!\n\nInspirujące mogą być zarówno same posty, jak i profile w całości oraz osobowości, które znajdziesz na Instagramie. Choćby z tego względu warto być na Instagramie.\n\nPonadto, angażując się na Instagramie i udostępniając efekty swojej pracy/ twórczości, możesz zainspirować innych. Niezwykle miło czyta się komentarze/ wiadomości od osób, które mówią Ci, że to, co udostępniasz, zainspirowało ich do czegoś. To niesamowicie motywuje do działania i dalszego Twórczego Rozwoju oraz dzielenia się jego efektami!\n\n## Instagram jest po prostu wizualnie piękny i estetyczny\n\nInstagram jest portalem społecznościowym, który kładzie nacisk na aspekt wizualny i estetykę treści na nim udostępnianych. Tak naprawdę jest to portal, na który (w założeniu) trzeba wrzucać piękne zdjęcia i grafiki, dbać o spójny i estetyczny profil – to przyciąga większość użytkowników.\n\nAle… na Instagramie znajdziesz także mnóstwo profili, których głównym celem wcale nie jest wrzucanie pięknych zdjęć. Przyznam, że jestem kiepskim fotografem, ale jakoś musiałem sobie radzić, a to też jest dodatkowy rozwój w kolejnym obszarze!\n\nDlatego jeśli uważasz, że nie jesteś dobrym/ą fotografem/ką, niech Cię to nie powstrzymuje przed założeniem profilu. Musisz przede wszystkim dokładnie wiedzieć, co chcesz przekazać, a później zastanawiać się nad formą postów.\n\nWłaśnie też z tego powodu wykorzystałem swoją mocną stronę – umiejętność tworzenia notatek wizualnych i map myśli. Zdecydowanie wolę dzielić się notatkami wizualnymi i ilustracjami, niż np. zdjęciami.\n\n*O tym, jak je tworzyć, przeczytasz w dwóch obszernych artykułach:*\n\n- [Jak notować efektywnie? Rób notatki wizualne!](/jak-notowac-efektywnie-rob-notatki-wizualne)\n- [Mapy myśli. Jak je tworzyć i jak z nich korzystać?](/mapy-mysli-jak-je-tworzyc-i-jak-z-nich-korzystac)\n\nDziałając na Instagramie i obserwując posty innych, “wyczujesz”, jak się robi “znośne” zdjęcia i grafiki (zresztą, Canva jest w zasięgu każdego).\n\nNa pewno od czasu do czasu warto wrzucić zdjęcie swojej osoby, ponieważ obserwujący chcą Cię poznać. Nie kryj się wyłącznie za nickiem, logo lub nazwą firmy.\n\n## Instagramowa społeczność jest źródłem feedbacku, wsparcia i motywacji\n\nProfil na Instagramie jest źródłem bardzo wartościowego feedbacku (informacji zwrotnej) nt. tego, co tworzysz.\n\nFeedback jest rzeczą kluczową, jeśli naprawdę chcesz się dzielić z innymi wartościową treściami, przemyśleniami, wiedzą, twórczością, pasją. Lub też chcesz dotrzeć do potencjalnych klientów ze swoim produktem/ usługą. Ilość komentarzy i polubień jednoznacznie wskazuje, co dla Twoich odbiorców jest ciekawe, czego potrzebują i chcą więcej, co ich angażuje.\n\nTak naprawdę poranne przemyślenia nt. tego, jaką rolę odgrywają moi obserwujący w moim rozwoju i rozwoju mojego profilu, stały się Punktem Inicjującym tego artykułu. Oto kilka najświeższych przykładów:\n\n- jak piszę artykuł czy szkic nowego ebooka, wrzucam na stories ankietę do głosowania, czy ten temat jest ciekawy,\n- kiedy nie mogłem się zdecydować, czy lepszą miniaturką będzie kolorowe, czy czarno-białe logo, więc… zapytałem o to swoich obserwujących,\n- po kilku miesiącach prowadzenia swojego pierwszego profilu (Łowca Pomysłów) dostrzegłem, że największym zainteresowaniem wśród moich postów cieszą się notatki wizualne, założyłem profil Kreatywne Notatki, na którym wrzucam tylko notatki. I to był strzał w dziesiątkę – Kreatywne Notatki rozwijają się kilkakrotnie szybciej i obecnie dają mi największe pole do popisu.\n\nJeśli podążasz w kilku kierunkach w swoim Twórczym Rozwoju i nie wiesz, na czym masz się skoncentrować, aby Twoja instagramowa (ale także realna) twórczość/ działalność przyciągała ludzi. Feedback da Ci jednoznaczną podpowiedź.\n\nDlatego analizuj statystyki i wsłuchuj się w to, co mówią Twoi odbiorcy, rób wnioski i nie bój się zmian!\n\n## Budujesz zaangażowaną społeczność\n\n![notatka wizualna jak zwiększyć liczbę followersów](img/vadim-gierko-kreatywne-notatki-folowers-instagram-haremska-sprawny-marketing-819x1024.jpg)\n\nZakładając profil na Instagramie i udostępniając na nim treści, budujesz wokół siebie i swojej Twórczości społeczność obserwujących. Jest to jeden z najważniejszych elementów, niezależnie od tego, jaki jest cel Twojej obecności na Instagramie.\n\nWierni i zaangażowani obserwujący stanowią trzon Twojej działalności – komentują, lajkują i udostępniają Twoje posty, dzięki czemu Twój profil się rozwija, a społeczność się poszerza. Dzięki nim nie tworzysz “w próżnię”.\n\nOgromnym plusem Instagrama jest możliwość każdorazowego dotarcia do nowych potencjalnych obserwujących (i po prostu nowych osób, które zobaczą, co tworzymy) poprzez używanie hasztagów. Dlatego im więcej publikujemy, tym więcej osób jesteśmy w stanie przyciągnąć na swój profil.\n\nW tym sensie Instagram działa na zasadzie wyszukiwarki. Zdarza się, że moje stare posty, mimo że minęło już kilka miesięcy, nadal przyciągają nowe osoby ze względu na obserwowane przez nich hasztagi.\n\nJeśli będziesz chciał/a wykorzystać swój profil w celach komercyjnych (lub już to robisz), społeczność, którą uda Ci się zbudować, może stanowić źródło Twoich klientów. Jeśli uda Ci się zaangażować i zainteresować obserwujących Twojego profilu, jest duże prawdopodobieństwo, że niektórzy z nich szybko podejmą decyzję zakupową. Sam osobiście kupiłem kilka produktów od osób, które obserwuję na Instagramie, a także wielu moich obserwujących zakupiło mojego ebooka.\n\nWspominałem też, że społeczność jest źródłem feedbacku, który jest niezbędny dla rozwoju Twojego profilu. Im bardziej fani są zaangażowani, tym chętniej podzielą się z Tobą swoją (szczerą) opinią, dzięki czemu nie tylko lepiej dostosujesz swoje posty do ich potrzeb, ale także uzyskasz wskazówki, w którym kierunku ogólnie musisz zmierzać w swojej twórczości/ projekcie/ działalności, by się prężnie rozwijały.\n\n## Stajesz się częścią społeczności osób o podobnych zainteresowaniach i od nich się uczysz\n\nOprócz tego, że sam/a masz możliwość budowania społeczności wokół swojego profilu, możesz także dołączyć do innych społeczności, np. osób, które mają podobne zainteresowania.\n\nObserwując profile, które Cię inspirują/ interesują/ profile konkurencji, możesz się wiele nauczyć, podejrzeć, co i jak robią (także w kwestii pomysłów na prowadzenie profilu).\n\nPonadto, angażując się na innych profilach (np. komentując posty), zwracasz na siebie uwagę (jeśli Twoje komentarze są wartościowe) i być może przyciągniesz tym samym nowych obserwujących.\n\nZ własnego doświadczenia powiem, że jak zacząłem wrzucać swoje notatki wizualne na Instagram, odkryłem, że są także inne osoby w Polsce, które nie tylko robią podobne rzeczy, ale także na tym zarabiają. Nie jest tych osób za wiele, ale ucieszyła mnie myśl, że inni także zajmują się tą niszową działalnością.\n\nDzięki Instagramowi dowiedziałem się też, że w Lublinie, w którym mieszkam, jest kilkunastu entuzjastów myślenia wizualnego i miałem okazję z nimi się spotkać w realu! Właśnie pierwsze spotkanie natchnęło mnie na to, by zacząć robić więcej notatek, dzielić się nimi, a w konsekwencji założyć drugi profil.\n\nKolejnym plusem jest możliwość “zaprzyjaźnienia się” z kimś, z kim być może nawiążesz jakiegoś rodzaju współpracę lub po prostu rozwijać się razem i wzajemnie wspierać.\n\n## Instagram jest źródłem motywacji do dalszego rozwoju\n\nJuż sam fakt posiadania profilu na Instagramie motywuje do wrzucania postów i, co za tym idzie, regularnego tworzenia i rozwoju.\n\nJeśli założyliśmy profil po to, by się dzielić się swoją wiedzą, twórczością, radami czy nawet życiem prywatnym i po prostu pięknymi zdjęciami, to nasza motywacja najprawdopodobniej jest już na wysokim poziomie. Ale kiedy widzimy odzew – motywacja zwiększa się po stokroć! Oczywiście, trzeba uważać, by nie doprowadziło to do uzależnienia.\n\nUważam, że jednym ze sposobów, by przełamać Martwy Punkt w naszej twórczości/ projekcie/ pomyśle/ działalności, jest założenie dedykowanego profilu na portalu społecznościowym, którego celem i misją będzie właśnie wyjście do ludzi ze swoją działalnością.\n\nDlatego jeśli doświadczasz kryzysu twórczego, braku natchnienia, motywacji, a Twój Projekt/ Rozwój Twórczy stoi w miejscu – wyjdź do ludzi i załóż konto na Instagramie!\n\nMoja społeczność bardzo mnie motywuje do działania, tworzenia i dzielenia się swoją wiedzą i efektami pracy. Miło jest widzieć, że pewna część obserwujących reaguje praktycznie na każdy post, przegląda relacje, komentuje i wysyła wiadomości.\n\nNajbardziej się cieszę, kiedy moje posty są udostępniane i zapisywane (moje notatki zostały zapisane ponad 3000 razy! (stanem na koniec 2020 roku)), ponieważ wtedy wiem, że odbiorcy otrzymali ode mnie wartościową treść, którą chcieli się podzielić lub też zachowali dla siebie. Dzięki temu nasz przekaz idzie w świat, a o to przede wszystkim chodzi, niezależnie od tego, czy chcemy zarabiać na tym, co robimy, czy nie.\n\nOsobiście uważam, że “wejście” na Instagrama było najlepszą decyzją od momentu, kiedy napisałem pierwszego ebooka (wycofany już “Łowca pomysłów”). Mimo że ebook został wydany, nie podjąłem faktycznie żadnych działań promocyjnych, więc… niewiele się działo.\n\nMimo że nadal rozwijałem koncepcję Zarządzania Procesem Twórczym, zaprezentowaną w książce, to czułem, że gotuję się we własnym sosie, a mimo to niewiele osób o tym wiedziało. Dzielenie się tym na Instagramie było strzałem w dziesiątkę.\n\nNigdy bym nie napisał tyle treści, nie zrobiłbym tylu notatek, nie wpadłbym na tyle nowych pomysłów, gdybym nie założył profilu. Dlatego nie zwlekaj z działaniem!\n\nMożesz także (i jeśli zaczniesz się udzielać, przyjdzie to naturalnie) motywować i wspierać innych użytkowników. Niejednokrotnie otrzymywałem wiadomości lub czytałem komentarze, w których inni użytkownicy oznaczali mój profil i dziękowali czy to za inspirację, czy też za motywację do działania.\n\nPodrzucam też co jakiś czas pomysły innym instagramowiczom, jeśli na takowe wpadnę przeglądając ich posty lub profile, i cieszę się, że niektóre z nich zostały zrealizowane.\n\nPamiętaj, że “dawanie” może być bardziej motywujące, niż “branie”, a na Instagramie masz ku temu stworzone niezwykle sprzyjające warunki.\n\n## Promujesz siebie, swoją markę i swoją twórczość\n\nProfil na Instagramie może stać się Twoim potężnym (a nawet darmowym) narzędziem marketingowym. W momencie, kiedy wrzucasz post, masz szansę (o niebo większą niż na Facebooku) dotrzeć do dużej liczby osób, które być może zainteresują się tym, co robisz, kim jesteś, co masz do powiedzenia, pokazania lub… sprzedania.\n\nCoraz więcej firm zakłada profile także na Instagramie, gdyż jego użytkownicy kupują reklamowane tu produkty. I nie mówię tu tylko o dużych firmach, ale także (i może przede wszystkim) o osobach zajmujących się rękodziełem, artystach, autorach ebooków i książek, szkoleniowcach. Sam niejednokrotnie kupiłem produkty, które widziałem na Instagramie.\n\nAle promocja wcale nie jest zarezerwowana wyłącznie dla osób, które chcą zarobić na swoich zainteresowaniach.\n\nJeśli Twoim celem jest po prostu dzielenie się efektami swojej pracy, hobby, wiedzą, masz misję, powołanie itd. i nie zależy Ci (przynajmniej na razie) na ich monetyzacji, to i tak Twoim celem jest dotarcie do jak największej liczby osób.\n\nKażdy Twój post, każde stories, każda grafika i opis postu to jest promocja Twojego profilu i Twojej marki (nawet jeśli nie określasz tego jako markę).\n\nNapisałeś/aś artykuł? Wrzuć grafikę i zachętę na Instagrama. Zrobiłeś/aś szkolenie/warsztaty? Napisz o tym. Robisz coś ciekawego? Pokaż proces w stories.\n\nNieważne, że nic na tym nie zarobiłeś/aś. Inni widzą, co robisz, widzą, że jest to dobre. Nikt sam z siebie nie odkryje Twojego profilu, a także nie zainteresuje się tym, co robisz, jeśli tego nie pokażesz.\n\nTwój profil jest Twoim portfolio, Twoim CV, Twoim blogiem, Twoją ofertą, wizytówką. Instagram i Facebook generowały połowę wejść na mojego poprzedniego bloga. Większość ciekawych blogów (a co za tym idzie bardziej rozbudowanych artykułów, darmowych ebooków itd.) odkryłem właśnie dzięki Instagramowi.\n\nNawet jeśli nie masz czegoś, co chcesz promować, to nigdy nie wiesz, czy za jakiś czas nie będziesz miał/a pomysłu na produkt/usługę, a wtedy będziesz już trochę spóźniony/a, gdyż zaangażowanej społeczności nie buduje się “ot tak”. Bądź przygotowany/a.\n\nPonadto, promować możesz swoją przyszłą książkę/ projekt lub cokolwiek innego, co jest dopiero w Twojej głowie. Możesz zatem przetestować potencjalny popyt i wybadać, czego potrzebuje Twój potencjalny odbiorca/klient i to całkiem za darmo.\n\nDaj znać, nad czym pracujesz!\n\n## Profil na Instagramie jest Twoim blogiem\n\nJeśli planujesz założenie bloga w przyszłości (osobnej strony www), ale nie do końca jesteś pewnien/a, że temu podołasz (regularnie pisać wartościowe treści), to Instagram będzie dobrym miejscem “na próbę”.\n\nJest mnóstwo profili, których założyciele traktują je właśnie jako blogi osobiste. Nigdy nie uważałem się za pisarza, ani nigdy nie byłem dobry w wymyślaniu chwytliwych haseł, ale Instagram niejako “zmusił” mnie do opanowania pewnych podstaw w tym zakresie. Podglądając, co i jak piszą inni, wypracowałem swój schemat pisania postów, co też przełożyło się na statystyki i zainteresowanie.\n\nJeśli piszesz w miarę regularnie, to chcąc nie chcąc, jakość Twoich tekstów (zarówno krótkich instagramowych wpisów oraz artykułów na blogu) będzie się polepszać. Nauczysz się mieścić w ograniczonej liczbie znaków (nieoceniona umiejętność), pisać zachęcające do dalszej lektury pierwsze zdanie, pisać o najważniejszych rzeczach i dzielić się naprawdę wartościowymi treściami, które inni będą chcieli czytać i zapisywać.\n\nNawet jeśli nie chcesz mieć bloga, nie chcesz pisać artykułów itd., warsztat pisarski, który wypracujesz dzięki regularnym wpisom, może się przydać w wielu dziedzinach.\n\nDzięki temu, że opublikowałem dużo postów, zabierając się za pisanie kolejnego ebooka miałem już kilkadziesiąt stron dobrego tekstu, który mogłem wykorzystać. Każdy, kto choćby raz próbował coś napisać, wie, co znaczy zaczynać pisanie “od zera”.\n\nKiedy założyłem bloga, także korzystałem z fragmentów napisanych już wcześniej postów przy pisaniu artykułów. Pomijam oczywiście fakt, że im więcej piszesz, tym łatwiej i lepiej ci to pisanie wychodzi.\n\nPonadto, pisząc wartościowe posty na Instagramie, budujesz swoją markę (nawet jeśli nie myślisz o niej jako o marce) oraz pozycję eksperta w dziedzinie, którą się zajmujesz.\n\nChyba nie muszę mówić, jak to jest ważne, jeśli przynajmniej trochę zastanawiasz się nad tym, by ze swojego hobby, zainteresowań, wiedzy uczynić w przyszłości dochodową działalność.\n\nSpołeczność, którą uda Ci się zebrać dzięki swoim wpisom, zacznie postrzegać Cię jako osobę, która wie, o czym mówi i potrafi dobrze robić to, na czym się zna. Od takiej osoby chce się uczyć, kupować i taką osobą chce się inspirować.\n\nMimo że spora część instagramowej społeczności nie czyta opisów do postów, są tacy, którzy wiernie i dokładnie czytają każde słowo, dlatego nie lekceważ siły słowa pisanego, nawet jeśli Twoje zdjęcia, grafiki czy stories są na najwyższym poziomie.\n\n## Prowadzenie profilu na Instagramie jest wyjątkowo dyscyplinujące\n\nJak już wspominałem, Instagram (jak i wszystkie media społecznościowe) wymaga regularności.\n\nMa to wpływ zarówno na zaangażowanie Twojej społeczności (obserwujący wiedzą i oczekują, że w miarę często będziesz dzielił/a się z nimi wartościowymi treściami), jak i na statystyki i zasięgi.\n\nJeśli zaczniesz działać na Instagramie, nie możesz tego robić z doskoku. Z drugiej strony, “filozofia” Instagrama sama będzie motywowała Ciebie do działania, dlatego jeśli pracujesz nad jakimś Projektem i brakuje Ci dyscypliny (tak jak ja mam w przypadku pisania ebooka), to założenie profilu może Ci w tym pomóc.\n\nNa początku zawsze masz dużo energii, pomysłów i natchnienia do tworzenia i dzielenia się treściami. Społeczność rośnie, statystyki są coraz lepsze, poprzeczka jest coraz wyżej. Ale po pewnym czasie kończą się pomysły, zapał i motywacja.\n\nTo jest naturalna kolej rzeczy, gdyż Proces Twórczy jest sinusoidą (czego się dowiesz z tego artykułu -> [*Zarządzanie Procesem Twórczym, czyli jak zapanować nad chaosem tworzenia*](/zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia) oraz z mojego [ebooka](/ebook-zarzadzanie-procesem-tworczym)) – raz na górze, raz pod górkę.\n\nI wtedy, patrząc na to, co osiągnąłeś/ęłaś, masz dodatkową motywację (lub presję), by tego nie zaprzepaścić, ponieważ społeczność bardzo szybko o Tobie zapomni, jeśli nie będziesz się przypominać.\n\nPonadto taka dyscyplina i w pewnym sensie rutyna zmusza Cię do ogólnie regularnego tworzenia (czy nauki, czy robienia zdjęć – czymkolwiek się zajmujesz), dzięki czemu nie masz przestoju i ciągle się rozwijasz.\n\nUczysz się też tworzyć pod presją czasu i wtedy, kiedy nie masz natchnienia. Jest to bardzo cenna umiejętność, którą niestety da się wypracować tylko w ten sposób, ale się opłaca. Natchnienie i motywacja nie pojawiają się znikąd, tylko są efektem naszej pracy. Dlatego jeśli potrzebujesz dyscyplinującego “kopa”, Instagram Ci go zapewni.\n\n## Uczysz się i systematyzujesz swoją wiedzę\n\nNa Instagramie święcą triumfy tzw. studygramy, czyli profile osób, które od jakiegoś czasu czegoś się uczą (szkoła, studia, korepetycje, itd.) i wrzucają (najczęściej piękne) zdjęcia swoich notatek, książek, biurka, ściąg, materiałów edukacyjnych itd.\n\nOsobiście bardzo lubię odwiedzać takie profile. Z jednej strony, prowadząc taki profil, motywujesz siebie do nauki i tworzysz “pamiętnik/dziennik” swoich postępów, z drugiej zaś motywujesz innych (i być może dostarczasz im cennej wiedzy). Ponadto, komentarze, lajki i zaangażowanie społeczności, która śledzi Twój studygram, jest dodatkowym czynnikiem motywującym.\n\nMimo że moje profile nie są studygramami w ścisłym rozumieniu tego słowa, ale również traktuję je jako m. in. jako dziennik swoich postępów w zgłębianiu tajników Zarządzania Procesem Twórczym oraz zbiór efektów swojej nauki – notatek wizualnych.\n\nOdkąd zauważyłem u innych użytkowników, że można tworzyć cykle postów lub np. w określony sposób porządkować posty (układ) na swoim profilu, ukierunkowało to i uporządkowało moją twórczość. Jeśli w Twoim projekcie panuje chaos, to Instagram pomoże Ci zrobić z tym porządek (jeśli oczywiście poświęcisz jakiś czas na refleksję i analizę innych profili).\n\nJeśli wpadam na jakiś pomysł/ hasło/ temat, to zawsze robię o tym wzmiankę na Instagramie, dzięki czemu mam dostęp do tego pomysłu w przyszłości i widzę, jak się “wpisuje” w pozostałem treści.\n\nPublikowanie na Instagramie (przy jednoczesnym sprawdzaniu statystyk) zmusza do wyklarowania najważniejszych i najciekawszych rzeczy, na których możesz i na których warto się skupić. Do takich wniosków nie dojdziesz nie udzielając się w profilach społecznościowych.\n\nPonadto Instagram to nauka… o samym Instagramie i ogólnie mediach społecznościowych, ale o tym piszę poniżej.\n\n## Rozwój profilu na Intsagramie to przyspieszony kurs social media\n\n![notatka wizualna co blokuje twojego instagrama](img/vadim-gierko-kreatywne-notatki-instagram-bledy-content-marketing-sprawny-1024x957.jpg)\n\nZanim założyłem pierwszy swój profil – *Łowcę Pomysłów* (obecnie @vadim.gierko) na Instagramie (oraz na Facebooku), nie byłem fanem portali społecznościowych. Teraz wiem, dlaczego. Dlatego, że nie umiałem z nich korzystać we właściwy sposób.\n\nDyscyplina, regularność oraz chęć dostarczania wartościowych treści sprawiły, że zacząłem działać szybciej, lepiej, bardziej twórczo i… socialmedialnie.\n\nNigdy nie pociągało mnie uzewnętrznianie się ze swoim życiem prywatnym, ale jak się okazało, spodobało mi się dzielenie się swoimi projektami.\n\nDopiero kiedy zacząłem udostępniać efekty swojej pracy, dostrzegłem “wartość dodaną” portali społecznościowych. Tworzysz wartościowe treści, dzielisz się nimi, dajesz coś od siebie społeczności, a także skupiasz wokół siebie osoby, które mimo że mieszkają daleko od Ciebie, mają podobne zainteresowania.\n\nOdkąd jestem na Instagramie, przeczytałem mnóstwo artykułów, postów i poradników nt. tego, jak i jakie treści tworzyć, jak je udostępniać, jak budować zaangażowanie. Zaczęło mnie to interesować, ponieważ chciałem podzielić się tym, co wiem, z jak największą liczbą osób. Widziałem w tym cel, chciałem uczynić świat lepszym miejscem i dać innym sprawdzone narzędzia, dzięki którym ich twórczość wejdzie na wyższy poziom. To jest całkiem inny rodzaj motywacji.\n\nMimo że Facebook i Instagram mają wiele wspólnych cech (i mechanizmów), to jednak bardzo się różnią. Nie ukrywam, że jestem fanem Instagrama (i przez dłuższy czas po prostu powielałem treści na Facebooku), ale zdaję sobie sprawę z tego, jak wykorzystać zalety każdego z tych portali z pożytkiem dla moich projektów i twórczości.\n\nSpołeczność Instagrama nadal rośnie, ale daleko jest jej (na razie) do wielkości społeczności Facebooka. I właśnie z tego powodu warto tam być! Po pierwsze, będziesz miał/a mniejszą konkurencję (nawet, jeśli nie zamierzasz z nikim konkurować). Po drugie, masz możliwość ugruntowania swojej pozycji w określonym obszarze tematycznym zanim inni tam się pojawią. Czas działa na Twoją korzyść, dlatego nie odkładaj tego na później.\n\nWszystkiego, co musisz wiedzieć o social media, nauczysz się w trakcie rozwoju swojego profilu na portalach społecznościowych. Wystarczy, że będziesz podglądał/a, co robią inni, jak to robią, testował/a, co się sprawdza, a co nie. Dlatego znowu wspomnę o dyscyplinie i regularności. Nie bój się popełniać błędów, ale wyciągaj z nich wnioski. To wszystko wymaga czasu.\n\n## W ramach podsumowania: prowadzenie profilu w mediach społecznościowych to także twórczość!\n\nJak widzisz, prowadzenie profilu w mediach społecznościowych to nie lada wyzwanie i… twórczość sama w sobie! Tworząc treści na swój profil stajesz się Twórcą Internetowym.\n\nZobacz, ile musisz się napracować i ile rzeczy musisz stworzyć: treści opisów, grafiki/ zdjęcia, spójny profil, ciekawy przekaz, budowanie relacji, podstawowa wiedza z zakresu marketingu online itd.\n\nProwadzenie profilu jest ciągłą nauką, Procesem Twórczym, wymaga kreatywności, generowania i realizacji pomysłów. I jeśli chcesz to robić dobrze, musisz być Twórcą Seryjnym – jeden post w miesiącu to zdecydowanie za mało.\n\nW związku z tym musisz więcej tworzyć nie tylko online, ale i offline, co będzie Cię dodatkowo motywować i dyscyplinować. Dlatego jeśli jeszcze nie zacząłeś/aś dzielić się swoją twórczością w Internecie – oto jest ten moment! Jeśli z kolei robisz to, ale po lekturze tego wpisu zdajesz sobie sprawę, że można to zrobić lepiej – do dzieła!\n\nJedną z inspiracji do napisania niniejszego artykułu była jedna z pierwszych notatek na moim Instagramie sprzed roku (patrz poniżej);\n\n![mapa myśli instagram](img/wizualna-kreatywna-notatka-sketchnoting-mind-map-instagram-pomysl-vadim-gierko-1024x1024.jpg)\n"
        }
      },
      "jak-jedno-postanowienie-noworoczne-moze-odmienic-twoje-zycie-jesli-skupisz-sie-wylacznie-na-nim-przez-rok-studium-mojego-przypadku": {
        "category": "creative-process-management",
        "itemType": "article",
        "metadata": {
          "title": "JAK JEDNO POSTANOWIENIE NOWOROCZNE MOŻE ODMIENIĆ TWOJE ŻYCIE, JEŚLI SKUPISZ SIĘ WYŁĄCZNIE NA NIM PRZEZ ROK? STUDIUM (MOJEGO) PRZYPADKU",
          "description": "Jeśli chcesz odmienić swoje życie w 2022 roku i właśnie planujesz swoje postanowienie (postanowienia) noworoczne, to dobrze trafiłeś/aś! W tym wpisie podzielę się z Tobą podsumowaniem tego, co udało mi się osiągnąć w 2021 roku dzięki skupieniu się wyłącznie na jednej rzeczy! Zawarłem też kilka wskazówek, które pomogą Ci osiągnąć to samo. Czytaj dalej!",
          "link": "/jak-jedno-postanowienie-noworoczne-moze-odmienic-twoje-zycie-jesli-skupisz-sie-wylacznie-na-nim-przez-rok-studium-mojego-przypadku",
          "img": {
            "src": "/img/postanowienie-noworoczne-notatka-wizualna-vadim-gierko-esencjalizm-1850x2048.jpg",
            "alt": "notatka wizualna skup się na jednej rzeczy w 2022"
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "content": "\n## Moje życie i twórczość przed skupieniem się na jednej rzeczy\n\nCi z Was, którzy śledzili moje poczynania w latach 2018-2020, pamiętają, że w tym okresie (oprócz pracy na etacie) skupiałem się (a raczej rozpraszałem) na kilku obszarach:\n\n- prowadziłem (nieistniejącego już) bloga *Łowca Pomysłów*, na którym opublikowałem kilkanaście obszernych artykułów (łącznie ponad 120 stron po wydrukowaniu),\n- aktywnie publikowałem posty nt. [Zarządzania Procesem Twórczym](/zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia) na jednoimiennym profilu na [Instagramie](https://www.instagram.com/vadim.gierko/) i [Facebooku](https://pl-pl.facebook.com/lowcapomyslow/),\n- prowadziłem także profil Kreatywne Notatki na [Instagramie](https://www.instagram.com/kreatywnenotatki/) i [Facebooku](https://www.facebook.com/kreatywnenotatkipl/), gdzie wrzucałem swoje notatki wizualne i mapy myśli. Udało mi się zgromadzić ponad 2300-osobową społeczność na każdym z portali,\n- prowadziłem [warsztaty z notowania wizualnego](/warsztaty-myslenia-wizualnego-notatki-wizualne-mapy-mysli) oraz [warsztaty Zarządzania Procesem Twórczym](/warsztaty-zarzadzania-procesem-tworczym),\n- czytałem ok. 50 książek popularno-naukowych rocznie,\n- no i zwieńczeniem tego było wydanie [300-stronicowego ebooka](/ebook-zarzadzanie-procesem-tworczym), w którym przedstawiłem autorską koncepcję i system Zarządzania Procesem Twórczym (obecnie nie jest dostępny w sprzedaży),\n- a tak na marginesie, to robiłem to wszystko prowadząc działalność poza pracą na etacie…\n\nTo było szaleństwo... Owszem, taki tryb zaowocował mnóstwem wspaniałych (moim zdaniem) produktów mojej twórczości. Ale w pewnym momencie, pod koniec 2020 roku, byłem już totalnie wypalony. Ciągłą produkcją artykułów, postów, notatek wizualnych i obecnością online. Frustrację pogorszył również fakt, że te aktywności i ich produkty, w moim odczuciu, nie zaprowadziły mnie tam, gdzie chciałem być. Nie pozwoliły mi także osiągnąć tych rezultatów, które zakładałem.\n\n## Martwy Punkt i refleksja\n\nW pewnym momencie zatrzymałem się na dłuższą chwilę i oddałem się refleksji. Zapytałem sam siebie o następujące rzeczy:\n\n- Co chcę osiągnąć zarówno w twórczości, życiu zawodowym, jak i w rozwoju osobistym?\n- Co mogę zrobić, żeby to osiągnąć?\n- Jaka jest jedna najważniejsza rzecz, która może mnie ku temu doprowadzić?\n- W jaki sposób i w jakiej dziedzinie mogę wykorzystać pełnię swoich możliwości intelektualnych i twórczych? W dodatku, by poprawić swoją sytuację zawodową i jednocześnie rozwinąć się jako Twórca?\n\n## Inkubacja i pierwsze wnioski\n\nMoja Inkubacja trwała kilka jesiennych tygodni, w których próbowałem “ratować, co się da”. Innymi słowy znaleźć argumenty do robienia tych samych (lub choćby niektórych) rzeczy, którymi się zajmowałem. A musiałem o to walczyć, ponieważ… doszedłem do wniosku, że żadna z nich w obecnej postaci i w sposób, w jaki je robiłem, nie zaprowadzi mnie tam, gdzie chcę.\n\nByło to bardzo przykre i bolesne. Moje dotychczasowe dwuletnie projekty były nierozerwalną częścią mnie. Nie wyobrażałem sobie, że będzie coś, co pozwoli mi się zrealizować jako Twórca w takim samym stopniu. W grę nie wchodziło natomiast przebranżowienie się dla samego przebranżowienia się.\n\nNiemniej jednak, było coś, a konkretnie jedna dziedzina, która kusiła mnie od wakacji 2020 roku. Nigdy wcześniej nie brałem tej dziedziny pod uwagę, ponieważ uważałem, że jest nudna, trudna i wymaga specjalistycznej wiedzy na wejściu.\n\nTak się złożyło, że w tamtym momencie kilka czynników nałożyło się na siebie nawzajem i rozpaliły moją chęć do brnięcia w nieznane:\n\n- mój przyjaciel od lat działał w tej dziedzinie oraz bardzo mi pomógł z moim blogiem i stroną www,\n- przeczytałem niesamowitą książkę Waltera Isaacsona *Innowatorzy*, który całkowicie zmienił moje spojrzenie na tę dziedzinę i przekonał mnie, że być może nie ma obecnie bardziej twórczego obszaru do działania,\n- zdałem sobie sprawę, że opanowanie tych umiejętności pozwoli mi jednocześnie wykorzystać całą swoją wiedzę nt. [Zarządzania Procesem Twórczym](/zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia) oraz dotychczasowe twórcze doświadczenia zarówno podczas pracy/ nauki, jak i tworzenia, ale także pozwoli mi zdobyć nowy intratny zawód,\n- co jest równie ważne, wtedy też przeczytałem książkę Grega McKeowna *Esencjalista*, pod wpływem której podjąłem decyzję, że nie mogę się zajmować kilkoma projektami/ obszarami, ani mieć kilku celów. Cel musi być jeden. Musi być tylko jedna dziedzina/ projekt, któremu się poświęcę w całości i na którym się skupię. Nic innego nie może rozpraszać mojej twórczej i intelektualnej energii.\n- także, do tych wniosków doprowadziła mnie wcześniej przeczytana książka Cala Newporta *Praca Głęboka*, którą mega polecam.\n\n\n## Olśnienie i jedno postanowienie noworoczne\n\nWtedy nastąpił rozbłysk i wszystko ułożyło się w jedną uporządkowaną całość, przyprawioną nieugiętą motywacją i determinacją. Postanowiłem, że w 2021 roku... nauczę się programować!\n\nDomyślam się, że dla tych z Was, którzy mnie obserwowali od dwóch lat w mediach społecznościowych (oraz dla wszystkich osób, które mnie znały osobiście), może to być bardzo duże zaskoczenie. Wszak wydaje się, że nie ma innej bardziej odległej od tego, czym się zajmowałem, dziedziny, niż ta…\n\nTeż tak na początku (i przez poprzednie lata swojego życia) myślałem. Nigdy nie byłem w większym błędzie…\n\n## Sprecyzuj jeden cel i drogę do niego\n\nZgodnie z założeniami esencjalizmu, o którym wspomniałem kilka akapitów wstecz, zabrałem się za dokładne sprecyzowanie swojego celu. Wszak, pojęcie *programowanie* (jak się okazało) jest pojęciem niezwykle szerokim.\n\nZacząłem czytać nt. nauki programowania i ścieżek, które mogę wybrać, by były w 100% zgodne z moimi oczekiwaniami i doprowadziły mnie do osiągnięcia poziomu, do którego zmierzam. Zdecydowałem się iść w kierunku tworzenia stron i aplikacji webowych (front-end & web development).\n\nNie ukrywam, że w przypadku tak szerokiej dziedziny, poświęciłem ok. 2 tygodnie na:\n\n- ustalenie harmonogramu działań,\n- listy zagadnień, języków i technologii, które muszę poznać i, co nie mniej ważne, w jakiej kolejności,\n- z jakich sprawdzonych źródeł będę korzystać podczas nauki (wszystkie są darmowe),\n- jakich narzędzi będę używał (również za free),\n- jakie projekty muszę stworzyć, by to wszystko skonsolidować,\n- co będzie miernikiem mojego sukcesu za rok (powiem od razu, że prawie dwukrotnie “przebiłem” swoje założenia) oraz na każdym etapie.\n\nDopiero wtedy, kiedy ustaliłem zakres powyższych punktów (w miarę mojej ówczesnej wiedzy i rozeznania), 17 grudnia 2020 roku zacząłem swoją przygodę z programowaniem. Jak widać, zacząłem realizować postanowienie noworoczne 2 tygodnie przed czasem 😉\n\n## Odrzuć wszystko, co nie prowadzi do Twojego celu\n\nUstalenie planu działań to jedno. Należało też “zrobić miejsce” dla tego wszystkiego w moim dość burzliwym twórczo życiu.\n\nTo było najtrudniejszy punkt. Nie będę wdawał się w szczegóły i po prostu wymienię rzeczy, z których zrezygnowałem (oprócz oczywiście pracy na etacie), by zostać programistą w 2021 roku:\n\n- zamroziłem nowopowstałego (we wrześniu 2020 r.) bloga (czyli stronę, na której obecnie jesteś, następczynię bloga *Łowca Pomysłów*),\n- zaprzestałem publikowania zarówno postów, jak i notatek na profilach na Instagramie (także na Kreatywnych Notatkach),\n- zamknąłem działalność, zaprzestałem sprzedaży ebooka za pośrednictwem swojego sklepu oraz nie angażowałem się już w żadne warsztaty (nawet te online),\n- zniknąłem z mediów społecznościowych, nie tylko jako twórca contentu, ale także jako użytkownik-obserwator. Wchodziłem tam tylko raz w tygodniu na kilka minut, i to tylko na profil Kreatywne Notatki. Co ciekawe, po roku nieobecności, ten profil nie tylko nie stracił obserwujących, ale nawet trochę się powiększył, więc zasłużył na to, by do niego powrócić za jakiś czas. Chociaż czasami czytałem pewne treści o tematyce programistycznej (o dziwo na insta jest tego dość sporo!),\n- zaprzestałem oglądania, czytania i słuchania wiadomości,\nnigdy nie oglądałem seriali, jak również nie grałem w gry, więc nie musiałem z tego rezygnować. Ograniczyłem z kolei oglądanie filmów, co robiłem tylko i wyłącznie w towarzystwie, które było mi bliskie,\n- odmawiałem każdemu spotkaniu towarzyskiemu, które moim zdaniem było nieproduktywne i nie prowadziło mnie do mojego celu (czyli praktycznie wszystkim),\n- przestałem pochłaniać dość różnorodną literaturę popularno-naukową na rzecz książek, artykułów i materiałów nt. programowania,\n- ograniczyłem również swoje notatkowe szaleństwo, do robienia notatek, także wizualnych, tylko i wyłącznie w trakcie i odnośnie nauki programowania,\n- ograniczyłem nawet czas poświęcany na słuchanie muzyki, której słuchałem wyłącznie w drodze do i z pracy lub podczas sprzątania, zmywania i krótkich przerw od nauki i programowania,\n- a żeby było jeszcze drastyczniej, nie sprawdzałem nawet messengera i wyłączyłem powiadomienia. Albo w ogóle wyłączałem Internet w telefonie na cały dzień.\n\nPo prostu nie było mnie dla nikogo i niczego, oprócz ważnych osób, które można zliczyć na palcach jednej ręki.\n\nNawet sobie nie wyobrażacie, jak wiele czasu można zyskać. Można zyskać dosłownie drugi “dzień pracy”, a co najmniej 3-4 godziny totalnego skupienia po pracy na etacie + całe weekendy. Ponadto, rzeczy, z których zrezygnowałem, sprawiły, że nawet nie tyle nie marnowałem czasu, ile przestałem się rozpraszać. 5 min na Instagramie może sprawić, że będziesz potrzebował/a nawet 20 minut, by wrócić do skupienia na rzeczy, którą robiłeś/aś!\n\nZa każdym razem, kiedy chciałem “skoczyć w bok” i zająć się czymś innym (lub też czymś z wymienionej powyżej listy), zadawałem sobie pytanie:\n\n*W jaki sposób przybliży mnie to do zostania programistą?*\n\nPrawie zawsze odpowiedź brzmiała: w żaden. Więc tego nie robiłem.\n\nPo kilku tygodniach byłem już całkowicie wolnym i produktywnym człowiekiem, zmierzającym prosto do swojego celu. A po roku…\n\n## Co udało mi się osiągnąć w ciągu roku dzięki skupieniu na jednej rzeczy?\n\nW dziedzinie, w którą zanurzyłem się bez opamiętania – ogrom! Nie będę Was zanudzał szczegółami, bo tego jest 3 razy tyle, co ten artykuł, dlatego podsumuję to w następujący sposób:\n\nW obecnej chwili, dokładnie po roku od rozpoczęcia samodzielnej (i darmowej) nauki programowania od zera, mogę stworzyć/ zaprogramować (i stworzyłem wielokrotnie) i opublikować w Internecie responsywną (czyli taką, co dostosowuje swój wygląd do wielkości ekranu telefonu, laptopa lub innych urządzeń) stronę lub aplikację webową (czyli aplikację, która zadziała w Twojej przeglądarce), w której możliwe są:\n\n- rejestracja (zakładanie kont) przez użytkowników oraz ich weryfikacja,\n- dodawanie, usuwanie i edycja jakiegokolwiek contentu (tekst, obrazy, pliki, muzyka) przez użytkowników lub admina, dzięki integracji z bazą danych czasu rzeczywistego (realtime database),\n- dynamiczne generowanie linków,\n- wyszukiwanie treści dzięki wbudowanej (i zaprogramowanej przeze mnie) wyszukiwarce,\n- dodawanie tagów (słów kluczowych) do publikowanych/ dodawanych treści,\n- animacje i wizualizacje,\n- pobieranie danych z innych stron, jeśli oferują taką możliwość (jak np. lista użytkowników jakiegoś portalu lub warunków pogodowych),\n- a nawet takie bajery, jak przełączanie na dark mode (ciemny motyw) 😉\n\nPonadto mogę też stworzyć CMS, czyli aplikację, dzięki której jako admin będziesz mógł zarządzać treścią na swojej stronie oraz… proste gry 2D odpalane w przeglądarce.\n\nInnymi słowy, zostałem JavaScript / React developerem. <h1>Hello, World!</h1>\n\n## Jak możesz podążyć tą samą drogą? Mam dla Ciebie dokładny harmonogram działań\n\nGdyby Was jednak interesowały:\n\n- szczegóły mojej motywacji do zostania programistą,\n- projekty programistyczne, które zrealizowałem,\n- oraz dokładna roczna ścieżka nauki i rozwoju krok po kroku, włącznie z podlinkowanymi darmowymi źródłami, byście np. mogli podążyć tą samą drogą i dołączyć do grona front-endowców w 2022 roku…\n\n…zajrzyjcie do poniższych dwóch artykułów, które opublikowałem na… stworzonej przeze mnie platformie blogowej! Platforma powstała w celach czysto ćwiczeniowych, ale obecnie czysto teoretycznie (i praktycznie) możecie założyć tam konto i publikować tam wpisy.\n\n[5 REASONS WHY I STARTED LEARNING PROGRAMMING\nSUMMARY OF MY FIRST YEAR OF LEARNING WEB DEVELOPMENT. ROADMAP, PROJECTS AND TIPS FOR NEWBIES]()\n\nJeśli z kolei interesują Was moje projekty wraz z opisami i linkami oraz lista umiejętności i narzędzi, to zapraszam do mojego portfolio!\n\n## + Jeden nieoczekiwany (dla mnie) gratis\n\nJeśli skusiliście się, by zajrzeć do moich podlinkowanych w poprzednim akapicie artykułów lub portfolio, to mogliście coś zauważyć. Są napisane w języku angielskim. I to jest właśnie ten nieoczekiwany gratis, który zgarnąłem, poświęcając rok nauce programowania. Było nim wystrzelenie poziomu mojego angielskiego do tego stopnia, że mogę swobodnie czytać:\n\n- artykuły specjalistyczne,\n- przeczytałem też kilka książek nieprogramistycznych w tym roku,\n- dokumentację języków i narzędzi programistycznych\n- oraz… w miarę swobodnie pisać artykuły.\n\nChcąc nie chcąc, ucząc się programowania, bardzo szybko zdajesz sobie sprawę, że praktycznie wszystkie wartościowe dostępne źródła (pomijając oczywiście sam kod), są w języku angielskim i musisz zacząć posługiwać się nim każdego dnia.\n\nWszelkie fora, dokumentacja (czyli instrukcje, jak używać narzędzi i języków programowania) są w języku angielskim. Język angielski (co najmniej B2), którym możemy swobodnie się posługiwać, jest oczywistym wymogiem zawartym w ofertach pracy.\n\nTak więc efektem ubocznym nauki programowania jest też podciągnięcie poziomu języka angielskiego. Czy może być coś równie zachęcające?\n\n## Podsumowanie. Lista zadań krok po kroku, by przekuć swoje postanowienie noworoczne w realny sukces\n\nReasumując, jeśli chcesz dokonać ogromnych i przekraczających Twoje wyobrażenie postępów, wystarczy, że:\n\n- skupisz się w 2022 (lub jakimkolwiek kolejnym) roku na jednej rzeczy\n- i będziesz konsekwentnie podążał wybraną ścieżką wprost do wybranego celu,\nodrzucając wszystko zbędne 😉\n\nOto przypomnienie kroków, które możesz poczynić:\n\n- Zrób listę wszystkich celów, projektów, postanowień, planów i tego, czego chcesz się nauczyć lub dokonać w tym roku.\n- Wybierz z tej listy… 1 rzecz/ obszar/ postanowienie.\n- Ustal harmonogram, plan, zakres działań oraz realny mierzalny cel, do którego mają Cię doprowadzić pod koniec roku. Jest niezbędne, żebyś mógł/ mogła zweryfikować swój sukces lub też na bieżąco oceniać postępy.\n- Odrzuć/ odrzucaj wszystkie pozostałe rzeczy, które ustaliłeś/ aś w punkcie 1. oraz wszelkie inne aktywności, które nie prowadzą Cię do osiągnięcia tego jednego celu.\n- By ułatwić decyzję, za każdym razem zadaj sobie pytanie: czy to, co teraz zamierzam zrobić, przybliża mnie do mojego celu?\n- Na bieżąco sprawdzaj swoje postępy i w razie potrzeby koryguj kurs, ale trzymaj się swojego celu – każda zmiana musi prowadzić do większej efektywności.\n- Stań się innym człowiekiem pod koniec roku i świętuj!\n\nSZCZĘŚLIWEGO I PRODUKTYWNEGO NOWEGO ROKU 2022!\n\n![notatka wizualna każdy dzień to nowy rok](img/kazdy-dzien-to-nowy-rok-postanowienie-noworoczne-vadim-gierko-843x1024.jpg)\n"
        }
      },
      "jak-notowac-efektywnie-rob-notatki-wizualne": {
        "category": "visual-thinking",
        "itemType": "article",
        "metadata": {
          "title": "Jak notować efektywnie? Rób notatki wizualne!",
          "description": "\nCzy zdarzyło Ci się gubić w swoich notatkach?\nNotowałeś/aś wszystko, ale niczego teraz nie pamiętasz?\nZwykłe linearne notatki, które znasz ze szkoły i studiów do niczego się nie nadają...\nChcesz notować efektywnie? Poznaj wizualne notatki!\nDowiesz się, jak je robić krok po kroku. Czytaj dalej!\n\t\t",
          "link": "/jak-notowac-efektywnie-rob-notatki-wizualne",
          "img": {
            "src": "/img/notatki-wizualne-artykul-efektywna-nauka-notowanie-vadim-gierko-sketchnoting-887x1024.jpg",
            "alt": "notatka wizaulna dlaczego warto notować wizualnie"
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "content": "\nW tym artykule powiem Ci:\n\n- dlaczego zwykłe notatki są nieefektywne,\n- czym są notatki wizualne,\n- jak się zaczęła moja przygoda z notowaniem wizualnym i jak korzystam z niego na co dzień,\n- jak robić notatki wizualne krok po kroku.\n\nCzytaj dalej!\n\n## DLACZEGO ZWYKŁE LINEARNE NOTATKI SĄ… BE?\n\n## Zwykłe notatki są nieefektywne\n\nPowiedzmy sobie szczerze:\n\n**tradycyjne, linearne notatki**, które znamy ze szkoły i ze studiów (ale także te, które być może sporządzamy w pracy, podczas spotkań lub przy realizacji projektów), **są totalnie nieefektywne**.\n\nDlaczego?\n\nDlatego, że ***zwykłe*** **notatki** są:\n\n- nudne (nieatrakcyjne wizualnie ani “przestrzennie” dla mózgu, nic się w nich nie “dzieje”),\n- bierne (notując w ten sposób, najczęściej słowo w słowo, nie przetwarzasz informacji, a jedynie ją zapisujesz – w trakcie notowania jesteś “bezmyślną maszyną”),\n- nie nadają się ani do nauki (ciężko jest później w tym wszystkim się połapać + przeglądanie ich zajmuje mnóstwo czasu),\nani do przekazywania wiedzy.\n\nOwszem, zanotowaliśmy informację, aczkolwiek nie jest ona łatwa:\n\n- ani do zapamiętania,\n- ani do odtworzenia,\n- ani nawet do ponownego przejrzenia.\n\n## Zwykłe notatki w żaden sposób nie przystają do obecnych czasów\n\nPrzede wszystkim, linearne notatki są po prostu staromodne i w żaden sposób nie przystają do obecnych czasów.\n\nDlaczego? Dlatego, że:\n\n- nie ma już potrzeby przepisywania książek,\n- wykładowca nie jest jedynym źródłem wiedzy,\n- wiedzy, informacji i źródeł jest tak dużo – nie sposób nad tym zapanować,\n- w obecnym interaktywnym, kolorowym i wielobodźcowym świecie, w którym w dodatku coraz mniej statystycznie czytamy, linearne notatki są ostatnią rzeczą, na którą chcemy patrzeć i z której chcemy się uczyć.\n\nDlatego **zacząłem notować w postaci map myśli i tworzyć kreatywne wizualne notatki**.\n\n## Odejście od tradycyjnego sposobu notowania. Moja historia\n\n### Nauka za pomocą map myśli i notatek wizualnych\n\nW trakcie studiów zmieniłem swoje podejście do notowania. Swoje **zwykłe linearne notatki zacząłem wzbogacać o elementy wizualne (rysunki, strzałki, symbole)**.\n\n**Zaprzestałem notowania wszystkiego „słowo w słowo”** i **skupiłem się na słowach-kluczach**.\n\nPotem, nie zdając sobie z tego sprawy, **zacząłem notować w postaci** ***map myśli***.\n\nZłamałem jednak (jak się okazało) większość zasad tworzenia map myśli i zacząłem tworzyć notatki, będące mieszanką wszystkich rodzajów notatek wizualnych. Nazwałem je ***Kreatywne Notatki***.\n\nZauważyłem, że taki sposób notowania był bardziej efektywny pod względem powtarzania, nauki i przypominania sobie zanotowanych treści. Od wielu lat notuję wyłącznie w ten sposób. Nie mógłbym (a także nie widzę sensu) przestawić się z powrotem na tradycyjne notowanie.\n\nTakże w trakcie samodzielnej nauki, ale też podnoszenia kwalifikacji w miejscu pracy, notuję wizualnie podczas szkoleń, webinarów, lektury książek i ebooków. Nawet w trakcie nauki programowania także notowałem wizualnie!\n\n### Notatki wizualne i mapy myśli podstawą wszystkich moich działań, twórczości i projektów\n\nZ drugiej strony, notatki wizualne sprawdzały się nie tylko podczas nauki, ale także przy planowaniu i realizacji działań/ projektów oraz podczas rozwoju pomysłów.\n\nKreatywne notatki i mapy myśli były podstawą dla napisania mojego pierwszego ebooka ***Łowca pomysłów*** oraz drugiego – [***Zarządzanie Procesem Twórczym***](/ebook-zarzadzanie-procesem-tworczym). Ponadto, myślenie wizualne jest jednym z filarów wyłożonej w nim Koncepcji generowania, rozwoju i realizacji pomysłów.\n\nWszystkie artykuły, które publikuję na tym nowym blogu oraz poprzednim –  lowcapomyslow.pl, ale także posty w social media, również najpierw wizualizuję.\n\n### Przekazywanie wiedzy. Notatki wizualne sprawdzają się najlepiej\n\nKiedy miałem jako doktorant zajęcia ze studentami, ale także prowadziłem [***Warsztaty Zarządzania Procesem Twórczym***](/warsztaty-zarzadzania-procesem-tworczym), robiłem to w oparciu o wcześniej przygotowaną notatkę/i. Ta metoda jeszcze nigdy mnie nie zawiodła. Projektując i tworząc niniejszą stronę www również posiłkowałem się notatkami wizualnymi, w tym gigantyczną notatko-mapą myśli w formacie A3.\n\nOdkąd zacząłem działać na Instagramie jako [*Łowca Pomysłów*](https://www.instagram.com/vadim.gierko/) (obecnie prowadzę profil używając swojego imienia i nazwiska) w zakresie upowszechniania wiedzy nt. [*Zarządzania Procesem Twórczym*](/zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia), a potem jako ***Kreatywne Notatki*** (na [Instagramie](https://www.instagram.com/kreatywnenotatki/) i [Facebooku](https://www.facebook.com/kreatywnenotatkipl/)), dzielę się swoją wiedzą właśnie w postaci notatek wizualnych.\n\nNo i ze statystyk wynika, że ta forma dzielenia się wiedzą bardzo angażuje użytkowników:\n\n- notatki z profilu *Kreatywnych Notatek* na Instagramie zostały zapisane kilka tysięcy razy,\n- profil obserwuje ponad 2300 osób na Instagramie oraz ponad 2500 osób na Facebooku.\n\nDlatego też wykorzystuję swoje notatki jako ilustrację lub podsumowanie do artykułów na blogu. Zauważyłem, że jeśli w poście lub poglądzie linka do artykułu jest notatka wizualna, to więcej osób klika w link.\n\n## Czym są notatki wizualne?\n\nNotowanie wizualne (z ang. *sketchnoting*: *sketch* = szkic, *noting* = notowanie) to sporządzanie notatek nie tylko za pomocą pisma, ale także rysunków, ręcznej typografii, różnych kształtów i elementów wizualnych tj.: strzałki, linie, ramki, „chmurki” itd.\n\nAutorem nazwy *sketchnoting* jest Mike Rohde, autor książki *The Sketchnote Handbook*. Jest to pierwsze opracowanie, szeroko omawiające założenia i sposoby notowania wizualnego, które zapoczątkowało nowy globalny trend kilkanaście lat temu.\n\nNotowanie wizualne staje się coraz bardziej popularne także w Polsce, o czym można się przekonać, wpisując hasła *notowanie wizualne*, *notatki wizualne* lub *sketchnoting* na Instagramie, Pintereście, Facebooku czy w wyszukiwarce internetowej.\n\nObecnie (stanem na 2020 r.) w Polsce profesjonalnie zajmuje się tym kilkanaście osób (wykonują notatki na zamówienie, prowadzą warsztaty i piszą poradniki). Natomiast setki polskich sketchnoterów dzielą się efektami swojej pracy w Internecie.\n\n## Czym z kolei są kreatywne notatki?\n\n***Kreatywne Notatki*** to każdy rodzaj notatek, który różni się od notatek tradycyjnych, linearnych, które znamy ze szkoły i ze studiów.\n\nNotatką Kreatywną według mnie jest zatem np.:\n\n- notatka sporządzona metodą Cornella,\n- mapa myśli,\n- notatka wizualna (sketchnotka),\n- streszczenie wizualne,\n- infografika itd.\n\nZ drugiej strony, ***Kreatywnymi Notatkami nazywam swoje notatki, które są mieszanką wszystkich powyżej wymienionych rodzajów notatek*** (w różnych proporcjach w zależności od konkretnej sytuacji i… natchnienia).\n\nKreatywna notatka to przede wszystkim ***luźny zapis informacji, wzbogacony o elementy wizualne, rysunki (przedmiotów i postaci), ikony, kolory, z wyszczególnionymi słowami kluczowymi i blokami tekstowymi***.\n\nKreatywne Notatki to ***coś pośredniego pomiędzy mapami myśli (wyzwolonymi od wielu zasad), sketchnotingiem a linearnymi notatkami***. Zawierają one zarówno słowa kluczowe, symbole, strzałki, kolory, rysunki, rozmaite czcionki, ale także bloki tekstowe (urywki tekstu, cytaty, komentarze).\n\nNigdy **nie ograniczam się żadnymi zasadami** (co nie znaczy, że ich nie przestrzegam) w tworzeniu notatek. Każda z nich jest inna, co widać na profilach moich Kreatywnych Notatek na Instagramie i Facebooku. Wiele takich notatek wrzuciłem także na swój imienny profil na Instagramie i Facebooku.\n\n## Dlaczego kreatywne/ wizualne notatki są lepsze od tradycyjnych?\n\nKreatywne (wizualne) notatki **angażują cały Twój mózg (obydwie półkule)**. Dzięki temu każda informacja jest zapamiętywana, kodowana i kojarzona na wiele sposobów.\n\n**Treść jest** nie tylko **zróżnicowana wizualnie**, ale także **ma swoje właściwe miejsce w “przestrzeni” kartki**, co dodatkowo sprzyja zapamiętywaniu/ przypominaniu informacji.\n\nNotując wizualnie, bardziej skupiasz się na przyswajanej treści i aktywniej słuchasz lub czytasz. Ponadto notując w ten sposób, **przetwarzasz wiedzę już w trakcie sporządzania notatki** – **budujesz system skojarzeń i konwertujesz słowa na obrazy**. Dzięki temu Twój umysł będzie bardziej efektywnie przetwarzał informację.\n\nPonadto, notatki wizualne są po prostu **ciekawe, atrakcyjne wizualnie, coś się na nich “dzieje”**. To jest bardzo ważne, ponieważ… do takich notatek po prostu chce się powracać!\n\n## Krótki poradnik tworzenia notatek wizualnych\n\nMam nadzieję, że przekonałem Cię, że warto porzucić nieefektywne notowanie linearne i zacząć notować wizualnie. A ponieważ znam się trochę na rzeczy, to mam dla Ciebie krótki poradnik, jak to robić i od czego zacząć. Do dzieła!\n\n- Na środku kartki umieszczamy najważniejsze pojęcie/temat lub też tytuł książki, artykułu czy wykładu.\n- Możemy również umieścić tytuł na górze lub w lewym górnym rogu kartki, dodatkowo umieszczając go w ramce.\n- Przede wszystkim notujemy najważniejsze pojęcia, słowa-klucze.\n- Słowa te mogą być luźnie „porozrzucane” na całej kartce (jeśli np. notujemy czyjś nie do końca usystematyzowany wykład lub prezentację) lub też mogą otaczać główne pojęcie.\n- Wybrane cytaty lub fragmenty cytatów umieszczamy w blokach tekstowych. Bloki tekstowe można umieścić w rożnego rodzaju ramkach (np. chmurkach, kółkach, owalach, prostokątach itd.).\n- Bloki tekstowe, główne pojęcia możemy opatrzeć numerem strony/ źródłem/ imieniem i nazwiskiem autora.\n- Wszelkiego rodzaju strzałki, odnośniki dodatkowo ułatwią uchwycenie zależności pomiędzy słowami kluczami lub blokami tekstu.\n- Używaj różnych krojów (czcionek), kolorów i wielkości liter, ale nie przesadzaj: maksymalnie 3-4 kolory, 2-3 wielkości liter. Chociaż warto wspomnieć, że są sketchnoterzy, którzy piszą wyłącznie czarnymi długopisami lub cienkopisami.\n- Staraj się pisać WIELKIMI LITERAMI lub też po prostu czytelnie.\n- Rób nie tylko symboliczne rysunki i ikonki. Możesz także „zaszaleć”, tworząc małą ilustrację (np. uproszczoną podobiznę okładki książki lub ilustrację tematu).\n- Możesz też dodać cienie do ikonek/rysunków, np. szarym flamastrem. Dzięki temu wybrane przez Ciebie treści będą bardziej uwydatnione, a notatka będzie bardziej czytelna.\n- Nie zapomnij o umieszczeniu daty sporządzenia notatki.\n- Zrób zdjęcie lub skan notatki i prześlij go sobie na maila lub zapisz na telefonie, komputerze, by zawsze mieć do niej dostęp.\n- Ucz się od innych. Oglądaj tutoriale i notatki innych osób i staraj się ich naśladować. Możesz np. obejrzeć moje notatki wizualne, by się zainspirować.\n\n## NOTATKI WIZUALNE A MAPY MYŚLI. RÓŻNICE I PODOBIEŃSTWA\n\nOgólne zasady tworzenia kreatywnych notatek nie odbiegają zbytnio od zasad tworzenia map myśli, chociaż są one bardziej „luźne”. Gdybym miał doradzać początkującym adeptom notowania wizualnego, od czego zacząć, to poleciłbym najpierw naukę robienia map myśli.\n\nJeśli chodzi o zasady tworzenia map myśli, to zapraszam do lektury mojego [poradnika tworzenia map myśli](/mapy-mysli-jak-je-tworzyc-i-jak-z-nich-korzystac) na tym blogu lub mojego gościnnego artykułu w Bazie Wiedzy UMCS pt. [*Najlepszy sposób na notatki? Mapy myśli*](https://www.umcs.pl/pl/baza-wiedzy,19255,najlepszy-sposob-na-notatki-mapy-mysli,90019.chtm).\n\nNotatki wizualne różnią się od map myśli przede wszystkim strukturą. Owszem, mogą być sporządzane w oparciu o promienistą strukturę map myśli (czyli na środku jest słowo kluczowe z otaczającymi go powiązanymi i uzupełniającymi hasłami), lecz w tym przypadku często pomija się używanie linii łączących poszczególne słowa kluczowe. Jest to mój ulubiony sposób organizacji notatki wizualnej.\n\nNatomiast najczęściej notatki wizualne są bardziej „luźnym” zbiorem zanotowanych informacji. Taka struktura określana jest jako „popcorn”. Informacje są „porozrzucane” na kartce i nie mają ściśle wyznaczonego uporządkowania, co nie znaczy, że nie możemy za pomocą strzałek lub innych symboli podkreślić ich wzajemnych powiązań.\n\nTen sposób rejestracji informacji sprawdza się w szczególności wtedy, kiedy tekst lub częściej czyjaś wypowiedź, np. wykład nie ma ściśle określonej struktury lub zawiera wiele dygresji i nie jesteśmy w stanie przewidzieć, co będzie dalej.\n\nNotatki wizualne zawierają także zdecydowanie więcej elementów wizualnych. Często ilość tekstu w stosunku do ikonek, ramek i symboli równa się 50/50. Mogą być także zdecydowanie bardziej kolorowe lub po prostu kolorystycznie „nieuporządkowane”.\n\n## Ostatnie wskazówki i do dzieła!\n\nPamiętaj, że **notatka musi być czytelna i zrozumiała przede wszystkim dla Ciebie**, dlatego wykorzystuj takie ikonki lub rysunki, które wywołują u Ciebie określone skojarzenia.\n\nPamiętaj, że **ta metoda notowania nie wymaga talentu plastycznego**. Nie daj się zwieść pięknym notatkom z Instagrama lub Pintersta! Są to notatki tworzone najczęściej na pokaz, co najmniej dwukrotnie przerysowane i dobrze przemyślane.\n\nNotatka wizualna jest przede wszystkim narzędziem usprawniającym zapamiętanie i usystematyzowanie informacji, a **nie dziełem sztuki**. Chociaż… nic nie stoi na przeszkodzie, by dążyć do tego, by nasze notatki stawały się za każdym razem coraz ładniejsze. Większość moich opublikowanych notatek powstała za pierwszym podejściem, ale pierwsze próby tak nie wyglądały… Praktyka czyni mistrza!\n\nTo jak, zaczynasz tworzyć swoją pierwszą notatkę? Pochwal się nią na Facebooku lub Instagramie i oznacz jeden z moich profili w komentarzu (Vadim Gierko lub Kreatywne Notatki). Chętnie zobaczę, co Ci wyszło 😉\n\n*Adnotacja: niniejszy artykuł zawiera fragmenty mojego gościnnego wpisu [Bazgrolisz na wykładach lub lekcjach? Poznaj notowanie wizualne!](https://www.umcs.pl/pl/baza-wiedzy,19255,bazgrolisz-na-wykladach-lub-lekcjach-poznaj-notowanie-wizualne,90112.chtm), opublikowanego w Bazie Wiedzy UMCS*.\n"
        }
      },
      "mapy-mysli-jak-je-tworzyc-i-jak-z-nich-korzystac": {
        "category": "visual-thinking",
        "itemType": "article",
        "metadata": {
          "title": "Mapy myśli. Jak je tworzyć i jak z nich korzystać?",
          "description": "\nZapewne słyszałeś/aś o tym, czym są mapy myśli.\nNajprawdopodobniej jednak nigdy takiej mapy nie zrobiłeś/aś!\nMusimy to zmienić! Dowiedz się, czym są mapy myśli,\ndlaczego są potężnym i praktycznym narzędziem mentalnym,\ngdzie je można wykorzystać oraz jak je tworzyć krok po kroku!\n\t\t",
          "link": "/mapy-mysli-jak-je-tworzyc-i-jak-z-nich-korzystac",
          "img": {
            "src": "/img/mapa-mapy-mysli-vadim-gierko-notatki-wizualne-poradnik-artykul-nauka-zarzadzanie.jpg",
            "alt": "mapa myśli nt. tworzenia map myśli"
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "content": "\nNie znam bardziej skutecznego narzędzia do notowania, nauki i rozwoju pomysłów, niż mapy myśli (i notatki wizualne). Nie wiesz, jak je robić i jak z nich korzystać? Zapraszam do lektury tego artykułu, w którym znajdziesz prosty przewodnik tworzenia map myśli krok po kroku.\n\n## Czym są mapy myśli?\n\nTworzenie map myśli (ang. *mind map*) to notowanie pewnego zagadnienia za pomocą powiązanych ze sobą strzałkami lub liniami i wynikających z siebie słów–kluczy, które wyodrębniamy z tekstu lub wykładu. Sporządzona w ten sposób notatka ma strukturę promienistą, która odwzorowuje ciąg skojarzeń wychodzących od centralnego słowa kluczowego.\n\nZa twórcę tej metody notowania uważa się powszechnie Tony’ego Buzana. Natomiast już w notatkach samego Leonarda da Vinci sprzed 500 lat można dostrzec podobny schemat sporządzania notatek.\n\nTakże, jedną z najsłynniejszych map myśli, była mapa zrobiona przez Charlesa Darwina, która była fundamentem dla jego teorii o pochodzeniu gatunków (patrz poniżej).\n\n![mapa myśli Darwina](img/mapa-mysli-darwin-vadim-gierko-603x1024.png)\n\n*Zdjęcie pochodzi z [repozytorium wolnych zasobów Wikimedia Commons](https://pl.wikipedia.org/wiki/Plik:Darwin_tree.png)*.\n\n## Dlaczego warto notować w postaci map myśli?\n\nTradycyjne, linearne notatki, które znamy ze szkoły lub ze studiów, nie angażują w wystarczającym stopniu naszego mózgu, o czym pisałem [tutaj](/jak-notowac-efektywnie-rob-notatki-wizualne).\n\nW trakcie sporządzania mapy myśli:\n\n- angażujemy nie tylko lewą, ale także prawą półkulę mózgu,\n- używamy pamięci przestrzennej,\n- budujemy system skojarzeń,\n\ndzięki czemu łatwiej i szybciej zapamiętujemy informacje oraz później odtwarzamy je z pamięci.\n\nArgumentem dla uzasadnienia korzystania z map myśli (oraz innych narzędzi myślenia wizualnego) jest np. cytat z książki Dana Roama *Narysuj swoje myśli*:\n\n*Przetwarzanie bodźców wzrokowych odbywa się w obu częściach mózgu. Być może wolno upatrywać w tym uzasadnienia [dla] myślenia wizualnego, [które] skłania ludzi do jednoczesnego korzystania z kompetencji analitycznych i zdolności twórczych. To może decydować o przewadze tej metody nad rozwiązaniami zakładającymi posługiwanie się wyłącznie słowem mówionym i pisanym (lewa półkula) lub wyłącznie rysunkiem (prawa półkula)*.\n\nNie istnieje bardziej skuteczne narzędzie do notowania, nauki i rozwoju pomysłów, ale także burzy mózgów, rozwiązywania problemów oraz planowania i organizacji działań, niż mapy myśli.\n\n## Dlaczego większość nadal nie korzysta z map myśli?\n\nPojęcie *mapa myśli* (z ang. *mind map*) stało się obecnie dość znane. Mimo to nadal większość osób, które słyszały o mapach myśli, nigdy nie spróbowały takiej mapy stworzyć.\n\nOto najczęściej spotykane wymówki, którymi osoby argumentują swoje niekorzystanie z map myśli:\n\n- nie umiem rysować,\n- u mnie to nie zadziała,\n- nic z tego nie zapamiętam,\n- rysowanie mapy myśli trwa zbyt długo,\n- nie wiem, jak się rysuje mapy myśli…\n\nChciałbym Cię zapewnić, że te wymówki są nieuzasadnione i rozpowszechniane przez osoby, które nigdy nie spróbowały tej metody notowania.\n\n## Gdzie można wykorzystać mapy myśli?\n\n### Notowanie, organizacja i prezentacja informacji\n\nMapy myśli są atrakcyjne wizualnie, przykuwają uwagę i zawsze coś się w nich dzieje, dzięki czemu możesz wykorzystać je podczas:\n\n- nauki,\n- lektury książki, artykułu,\n- planowania i wyznaczania strategii i celów (czegokolwiek),\n- podjęcia decyzji/ wyboru,\n- prezentacji swoich pomysłów/ projektów/ efektów pracy,\n- burzy mózgów (zarówno indywidualnej, jak i w miejscu pracy czy w zespole pracującym nad rozwiązaniem pewnego problemu/ projektem),\n- notowania podczas zebrania pracowniczego, szkolenia,\n- analizy problemów biznesowych.\n\nAtrakcyjność wizualna i skojarzenia, zawarte w samodzielnie sporządzonej mapie myśli gwarantują, że nawet po dłuższym czasie wystarczy spojrzeć na swoją notatkę, a Twój umysł przywoła informacje, a nawet całe fragmenty tekstu i wiedzę, uzupełniając brakujące elementy drogą skojarzeń.\n\n### Generowanie pomysłów i rozwój projektów za pomocą map myśli\n\nMapy myśli są narzędziem uniwersalnym. Są nie tylko jako narzędziem organizacji informacji, ale służą także m. in. do generowania pomysłów i rozwiązań.\n\nMapy myśli, ale także notatki wizualne i rysowanie stanowią narzędzia myślenia wizualnego – jeden z 4 filarów mojej autorskiej [Koncepcji Zarządzania Procesem Twórczym](/zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia), którą zawarłem w swoim [ebooku](/ebook-zarzadzanie-procesem-tworczym).\n\nMapy myśli są podstawą mojej pracy zarówno twórczej, jak i zawodowej. Każdy artykuł, wiele postów, każdy z moich Projektów powstał w oparciu o mapy myśli, które zacząłem tworzyć jeszcze na studiach. Są one także moim podstawowym sposobem na utrwalanie wiedzy, a codziennie przyswajam naprawdę dużo wiedzy z książek oraz artykułów.\n\nPoniżej możesz zobaczyć właśnie takie moje “robocze” mapy myśli. Nie są one na tyle “ładne” i perfekcyjne, by je wrzucić na Instagrama (te ładniejsze zobaczysz dalej), ale pełnią bardzo ważną rolę w rozwoju moich projektów.\n\n![mapa myśli wsparcie](img/mapa-mysli-notatka-wizualna-vadim-gierko-wsparcie-ebook-819x1024.jpg)\n![mapa myśli pinterest instagram patronite](img/mapy-mysli-notatki-wizualne-vadim-gierko-pinterest-patronite-checklista-instagram-768x1024.jpg)\n![mapa myśli wsparcie ebook](img/mapy-mysli-ebook-wsparcie-vadim-gierko-768x1024.jpg)\n\nPierwsza mapa jest streszczeniem, a raczej planem rozdziału do ebooka, nad którym pracowałem i zbiorem informacji nt. wsparcia. Na drugim zdjęciu widać notatki, będące wynikiem researchu nt. Patronite i Pinteresta. Na ostatnim zdjęciu z kolei są 2 notatki, zawierające najważniejsze kwestie i strukturę ebooka, nad którym pracowałem.\n\nJak widać, nie ma w nich zbyt wielu obrazków, ani pięknego wykaligrafowanego pisma. I takie powinny być mapy myśli tworzone na własne potrzeby, a nie [“na pokaz”](/notatki-wizualne-na-pokaz-vs-do-uzytku-wlasnego-porownanie-notatki-nt-patronite-i-jej-szkicu).\n\n## Jak zrobić mapę myśli krok po kroku?\n\n1. Ułóż kartkę A4 poziomo lub pionowo. Z drugiej strony – każda kartka o dowolnym formacie (np. kartka w małym notesie) nadaje się do notowania w postaci map myśli.\n1. Na środku kartki umieszczamy najważniejsze centralne pojęcie, temat, hasło, pytanie, problem, ew. tytuł książki, artykułu lub wykładu. Musi to być najbardziej widoczny element mapy, dlatego warto użyć większej czcionki, pogrubionych liter oraz ew. jaskrawszego koloru.\n1. W miarę pojawiania się nowych wątków, umieszczamy wokół centralnego pojęcia słowa-klucze (obszary, zagadnienia), z których będą „wyrastać” kolejne hasła, skojarzenia, obszary, pomysły itd. Nowe pojęcia łączymy ze sobą za pomocą strzałek i linii.\n1. Pamiętajmy, żeby dbać o hierarchię pojęć w swojej mapie. Im bardziej oddalamy się od pojęcia centralnego, tym mniejsze czcionki stosujemy, robimy mniej ozdobników oraz używamy cieńszych strzałek i linii. Mapa myśli rozwija się od ogółu (od środka) do szczegółu, w związku z tym musimy uwydatniać rzeczy bardziej ogólne o drugorzędnych (zależnych, wynikających).\n1. Pisz WIELKIMI DRUKOWANYMI LITERAMI. Jeśli będziesz pisał/a tak, jak to robisz zazwyczaj w swoich notatkach, to rozczytanie takich słów-kluczy zajmie Ci wiele (na pewno więcej) czasu. PS. Owszem, możesz dodawać krótkie „linearne” dopiski lub komentarze, np. naprawdę istotne definicje lub wybrane cytaty. W tym przypadku możesz pisać swoim zwykłym pismem. Ale nie przesadzaj z takimi blokami tekstowymi, dlatego że:\n1. Mapa myśli musi być czytelna i maksymalnie przejrzysta. Powinieneś/ powinnaś zrobić wszystko, co w Twojej mocy, by móc „ogarnąć” mapę wzrokiem w jednej chwili. Z drugiej strony, pamiętaj, że mapa musi być czytelna przede wszystkim dla Ciebie, nie dla innych.\n1. Stosuj kolory. Najlepiej będzie, jeśli każde słowo kluczowe oraz przyporządkowane do niego kolejne słowa będą innego koloru. Natomiast musisz uważać, by nie przesadzić z kolorami.\n1. Dodawaj do słów kluczowych proste ikonki i symbole.\n1. Dbaj o symetrię mapy. Mapa powinna wyglądać w miarę harmonijnie (nie idealnie). Staraj się uzupełniać puste przestrzenie/ luki (przy okazji dzięki temu istnieje prawdopodobieństwo, że dostrzeżesz pewne luki).\n1. Planuj rozwój mapy z wyprzedzeniem (jeśli warunki na to pozwalają). Przejrzyj pobieżnie lekturę, z której sporządzasz mapę lub spis treści i zaplanuj, gdzie umieścisz najważniejsze pojęcia, np. hasła przewodnie rozdziałów. To samo dotyczy notowania podczas wykładu/ webinaru. Zapoznaj się z programem wydarzenia lub uważnie słuchaj prowadzącego, który najprawdopodobniej poinformuje, o czym będzie mówić.\n1. Stąd też wynika bardzo ważna wskazówka: tworzenie mapy myśli polega nie na rysowaniu, tylko na aktywnym słuchaniu lub czytaniu ze zrozumieniem i umiejętności skupienia się na rzeczach kluczowych, dostrzeganiu zależności oraz tworzeniu skojarzeń. Mapa myśli jest nie tyle nośnikiem treści, ile przede wszystkim systemem skojarzeń, który umożliwi nam przywołanie zdobytej wiedzy/ informacji.\n1. Notatkę należy opatrzeć datą sporządzenia oraz swoim imieniem i nazwiskiem, inicjałami lub podpisem. Nawet jeśli robisz tę mapę na własny użytek – pomoże to później przyporządkować mapę do przedmiotu/ zagadnienia.\n1. Możesz także dodać tytuł mapy, np. na górze, jeśli słowo kluczowe na środku nie wyczerpuje całości zagadnienia, zawartego w mapie.\n1. Nie obawiaj się skreślania, poprawiania mapy podczas jej sporządzania. Mapa myśli jest dla Ciebie i musi być przede wszystkim wyczerpująca i czytelna, a nie ładna. Jeśli zależy Ci na estetyce, to po prostu przepisz później wszystko jeszcze raz. Dzięki temu podwójnie zapamiętasz treść notatki.\n1. Zrób zdjęcie lub skan mapy i prześlij go sobie na maila/ zapisz na telefonie, komputerze, by zawsze mieć do niej dostęp.\n1. Przyporządkuj mapę. Włóż ją do lektury, którą czytasz lub do teczki/ segregatora, w którym przechowujesz materiały z danego przedmiotu/ projektu. Nie zaniedbuj tego kroku!\n\n## KILKA PRZYKŁADÓW MAP MYŚLI Z MOJEGO INSTAGRAMA\n\nNiżej zamieściłem kilka map myśli z mojego profilu [Kreatywne Notatki na Instagramie](https://www.instagram.com/kreatywnenotatki/). Jak widać, bardzo luźnie traktuję zasady tworzenia map myśli i są one bardziej zbliżone do notatek wizualnych. Dlatego też pamiętajcie o tym, że to są Wasze mapy i możecie robić je tak, jak czujecie!\n\n![mapa myśli linkedin](img/mapa-mysli-notatka-wizualna-vadim-gierko-linkedin-892x1024.jpg)\n![mapa myśli firma to ty](img/notatka-wizualna-vadim-gierko-kreatywne-notatki-firma-czyli-ty-paul-jarvis-gosia-zimniak-1024x730.jpg)\n![mapa myśli zmieniaj warunki pracy](img/notatka-wizualna-vadim-gierko-kreatywne-notatki-warunki-pracy-kreatywnosc-mapa-mysli-1024x1024.jpg)\n![mapa myśli design thinking](img/mapa-mysli-design-thinking-vadim-gierko-kreatywne-notatki-1-1024x717.jpg)\n![mapa myśli instagram](img/wizualna-kreatywna-notatka-sketchnoting-mind-map-instagram-pomysl-vadim-gierko-1024x1024.jpg)\n\nZapraszam do obejrzenia pozostałych notatek wizualnych i map myśli, które opublikowałem na moim profilu [Kreatywne Notatki na Instagramie](https://www.instagram.com/kreatywnenotatki/).\n\n## Mapy myśli rozwijają się równolegle do pomysłów\n\nW mapach myśli łatwo jest zawsze coś dodać, coś dopisać czy dorysować. Na tym polega użyteczność i elastyczność map myśli. Przy w miarę rozsądnym umieszczaniu słów kluczy na kartce, pozostaje tam wystarczająco dużo miejsca na nowe elementy.\n\nMożna by rzec, że poprawnie tworzona mapa myśli zaczyna „żyć własnym życiem”. Dąży do harmonii i równowagi, pojawią się w niej pewne luki, które są równoważnikiem elementów, których istnienia jesteśmy pewni, ale nie wiemy do końca, czym są lub jak je należy przedstawić.\n\nZałóżmy, że znamy (lub przemyśleliśmy) na razie pozytywne strony pewnego zjawiska lub procesu. Umieszczamy je po prawej stronie pewnego słowa-klucza. Patrząc na taki układ poczujemy konieczność pozostawienia pewnego pustego miejsca po lewej stronie. Znajdą się negatywne strony tego procesu, nad którymi jeszcze się nie zastanawialiśmy lub na które na razie nie mamy czasu. Następnym razem, kiedy zerkniemy na naszą niedokończoną mapę, od razu dostrzeżemy tę lukę i będziemy wiedzieć, nad czym należy popracować.\n\n## Powodzenia w tworzeniu pierwszej (oraz kolejnych) mapy myśli!\n\nNajważniejsze aspekty tworzenia mapy myśli, które przedstawiłem, są absolutnie wystarczające, by rozpocząć samodzielną naukę i ćwiczenia w tym zakresie.\n\nNie musiałem czytać literatury na temat robienia map myśli, by dojść do wszystkich tajników tej sztuki. Owszem, wymagało to czasu i wielu prób, dlatego zaufaj swojej intuicji, wyobraźni i… improwizuj!\n\nPamiętaj, że każda mapa myśli będzie inna. Im więcej map zrobisz, tym lepiej będą wyglądać i trafniej odwzorowywać treść lektury/ wykładów. Praktyka czyni mistrza!\n\n*Adnotacja: niniejszy artykuł zawiera fragmenty mojego gościnnego artykułu [Najlepszy sposób na notatki? Mapy myśli](https://www.umcs.pl/pl/baza-wiedzy,19255,najlepszy-sposob-na-notatki-mapy-mysli,90019.chtm) opublikowanego w Bazie Wiedzy UMCS, w tym tytułowa mapa*.\n"
        }
      },
      "notatki-wizualne-na-pokaz-vs-do-uzytku-wlasnego-porownanie-notatki-nt-patronite-i-jej-szkicu": {
        "category": "visual-thinking",
        "itemType": "article",
        "metadata": {
          "title": "Notatki wizualne \"na pokaz\" vs. do użytku własnego. Porównanie notatki nt. Patronite i jej szkicu",
          "description": "Zobacz, jaka jest różnica pomiędzy notatkami wizualnymi robionymi \"na pokaz\" - do mediów społecznościowych, a tymi na użytek własny. Widać to na przykładzie mojej notatki nt. platformy Patronite, na której założyłem profil, a szkicem docelowej notatki. Czytaj dalej, a pozbędziesz się wszelkich oporów przed notowaniem wizualnym!",
          "link": "/notatki-wizualne-na-pokaz-vs-do-uzytku-wlasnego-porownanie-notatki-nt-patronite-i-jej-szkicu",
          "img": {
            "src": "/img/patronite-vadim-gierko-kreatywne-wizualne-notatki-819x1024.jpg",
            "alt": "notatka wizualna na temat patronite"
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "content": "\nW sieci widzimy tyle pięknych dopracowanych notatek wizualnych i przejrzystych map myśli… Nic dziwnego, że później mamy wątpliwości odnośnie naszych umiejętności i notatek, a być może nawet zniechęcamy się do notowania wizualnego.\n\nNie dajmy się zwieść! Notowanie “na pokaz”/ na zamówienie/ do mediów społecznościowych to najczęściej całkiem co innego, niż notowanie na własny użytek.\n\nW tym artykule chcę Ci pokazać, jak wygląda moje “zwykłe, robocze” notowanie wizualne i jak bardzo szkic różni się od ostatecznej opublikowanej notatki. W artykule wykorzystałem notatkę i jej szkic nt. platformy *Patronite*, na której założyłem profil w 2020 roku.\n\nHistoria powstania tej notatki da Tobie możliwość wglądu w to, jak powstają moje notatki wizualne oraz jak wykorzystuję je w swoich projektach. Mam nadzieję, że zainspiruję Cię do działania i pozbędziesz się wszelkich oporów, by zacząć notować wizualnie!\n\n## Najpierw kilka słów o samej notatce i wejściu na Patronite\n\nZ okazji dołączenia do społeczności *Patronite* stworzyłem i opublikowałem notatkę wizualną na temat tej platformy oraz tego, jakie są plusy bycia zarówno Autorem, jak i Patronem. Chociaż… na początku nie miałem wcale takiego zamiaru.\n\n### Notatka robocza. Cel: zebranie, organizacja i wykorzystanie informacji na własny użytek\n\nZanim jeszcze podjąłem decyzję o dołączeniu do społeczności *Patronite*, robiłem rozeznanie na temat tej wspaniałej inicjatywy i, jak to zazwyczaj u mnie bywa, sporządzałem notatki (ponieważ czytania było naprawdę dużo) na własny użytek.\n\nW tej roboczej notatce zawarłem najważniejsze info nt. samego *Patronite*, ale również tego, jak zarówno Twórcy, jak i ich Patroni mogą skorzystać z obecności na tej platformie.\n\nA szkic notatki wyglądał tak:\n\n![szkic notatki patronite](img/szkic-notatka-wizualna-patronite-vadim-gierko-kreatywne-notatki-715x1024.jpg)\n\nKiedy już zawarłem w roboczej notatce całą niezbędną informację (m. in. to, w jaki sposób krok po kroku można założyć konto Autora), krok po kroku rozbudowywałem swój profil. Notatka służyła mi pomocą i była “ściągą”, do której zerkałem w razie wątpliwości i w poszukiwaniu wskazówek, jak to zrobić najlepiej.\n\n### Notatka na czysto. Cel: poszerzenie wiedzy społeczności nt. platformy, jej promocja oraz… ogłoszenie wejścia na *Patronite*\n\nOpublikowana notatka ma na celu poszerzenie wiedzy nt. (i promocję) *Patronite* wśród szerszej społeczności.\n\nPrzyznam, że sam dowiedziałem się o *Patronite* dopiero w 2020 roku, z kolei w mojej ankiecie, którą przeprowadziłem na Instagramie, 2/3 głosujących obserwujących także przyznało, że nie słyszeli o Patronite… Gdybym wcześniej odkrył tę platformę, z pewnością byłbym już tutaj 😉\n\n## Ostateczna notatka a szkic. Różnice\n\n###Szkic zawiera więcej informacji i szczegółów\n\nJak widać, szkic notatki zawiera więcej informacji i szczegółów, ale także więcej konkretnych i rozbudowanych wskazówek, niż ostateczna notatka “na czysto”. W związku z tym, na podstawie tego szkicu i informacji w nim zawartych mógłbym stworzyć jeszcze jedną uzupełniającą notatkę na czysto.\n\n### Notatka na czysto jest “ładniejsza”\n\nWarto zwrócić uwagę na to (w szczególności zwracam się tu do osób, które chcą zacząć tworzyć notatki wizualne), że moje notatki, robione na użytek własny, wcale nie są tak dopracowane i “ładne”, jak te, które w ostateczności wrzucam na swoje media społecznościowe…\n\nI takie właśnie mają być! Notatki tworzymy dla siebie i muszą one być czytelne i zrozumiałe wyłącznie dla nas.\n\n### Szkic notatki zawiera mniej elementów wizualnych\n\nTen szkic nie zawiera także aż tylu elementów wizualnych, jak wersja ostateczna, a mimo to świetnie spełniła swoją rolę i równie dobrze ją zapamiętałem, co też jest argumentem dla osób, które przed notowaniem wizualnym powstrzymuje brak rzekomego talentu plastycznego.\n\nJeśli chodzi o pismo/ czcionkę/ font, to także warto zauważyć, że w szkicu notatki nie dbałem zbytnio o piękną kaligrafię, a jedynie o to, by moje pismo było w miarę czytelne.\n\n### Do notowania wizualnego nie potrzebujesz mega narzędzi\n\nPoza tym większość treści w szkicu w ogóle jest napisana ołówkiem, a nie flamastrami czy cienkopisami, jak to robię w swoich “publicznych” notatkach. W związku z tym pamiętaj, że trzeba korzystać z tego, co jest pod ręką – nie potrzebujesz jakichś wymyślnych narzędzi!\n\nKiedy już mój profil na *Patronite* został zweryfikowany, stworzyłem notatkę, którą widzieliście na samej górze wpisu, i opublikowałem na swoim profilu *Kreatywne Notatki* na [Instagramie](https://www.instagram.com/kreatywnenotatki/) oraz [Facebooku](https://www.facebook.com/kreatywnenotatkipl/).\n\nPonadto, wrzuciłem do wyróżnionych stories na Instagramie także film z przyspieszonym nagraniem tego, jak rysuję notatkę (z moją muzyką w tle), dlatego zapraszam [na mój profil](https://www.instagram.com/kreatywnenotatki/).\n\nGdybym z jakichś względów odroczył swoje dołączenie do *Patronite*, to i tak miałbym już szkic notatki na przyszłość, a może nawet i tak bym ją zrobił i opublikował.\n\n## Nie każda notatka robocza zostaje przekształcona w notatkę do publikacji\n\nZresztą, w tym samym czasie robiłem rozeznanie nt. działania na Pintereście i także stworzyłem szkic notatki, na której podsumowałem lekturę kilkunastu artykułów. Efekt? Założyłem [profil na *Pinterest*](https://pl.pinterest.com/kreatywnenotatki/) i zacząłem tam wrzucać swoje notatki (był to kilkurazowa akcja... nie ma mnie tak na razie)!\n\n*Jeśli tworzysz, ale nadal nie ma Cię (ani Twojej twórczości) w mediach społecznościowych, przeczytaj mój artykuł [Jak media społecznościowe stymulują rozwój twórczy i kreatywność?](/jak-media-spolecznosciowe-stymuluja-rozwoj-tworczy-i-kreatywnosc-przyklad-instagrama), by wreszcie wykorzystać swój potencjał oraz potencjał mediów społecznościowych na 100%!*\n\nWiększość moich notatek na użytek własny mają właśnie postać roboczą\nTakich roboczych notatek mam mnóstwo – niektóre z nich są w segregatorach osobnych projektów, inne są włożone do książek, które czytałem.\n\nOpublikowane notatki są tylko częścią stworzonych przeze mnie prac – z notowania wizualnego korzystam na co dzień, przy każdej okazji, bez “parcia” na publikację wyników notowania. Dzięki temu poszerzam swoją wiedzę oraz rozbudowuję swoją wizualną bibliotekę.\n\nNiemniej jednak **większość moich opublikowanych notatek powstaje od razu na czysto**.\n\n## Jak zacząć notować wizualnie? Przydatne linki\n\nJeśli chcesz dowiedzieć się, jak robić takie notatki krok po kroku, zajrzyj do mojego artykułu [*Jak notować efektywnie? Rób notatki wizualne!*](/jak-notowac-efektywnie-rob-notatki-wizualne).\n\nMożesz także dowiedzieć się więcej nt. tworzenia map myśli, których elementy i ogólna struktura stanowią część moich notatek wizualnych, nawet tych, które wrzuciłem do tego postu –> klikaj w artykuł [*Mapy myśli. Jak je tworzyć i jak z nich korzystać?*](/mapy-mysli-jak-je-tworzyc-i-jak-z-nich-korzystac).\n\nZajrzyj też do artykułu [*Jak zacząłem notować wizualnie? Moja historia*](/jak-zaczalem-notowac-wizualnie-moja-historia), by się przekonać, że nauka notowania wizualnego jest długotrwałym procesem.\n\nTo jak, zaczynasz swoją przygodę z notowaniem wizualnym? A może już korzystasz z potęgi narzędzi myślenia wizualnego? Jeśli tak, to daj znać, gdzie wykorzystujesz notatki wizualne i mapy myśli!\n"
        }
      },
      "jak-zaczalem-notowac-wizualnie-moja-historia": {
        "category": "visual-thinking",
        "itemType": "article",
        "metadata": {
          "title": "Jak zacząłem notować wizualnie? Moja historia",
          "description": "Zachęcam Cię do zapoznania się z moją historią! Mam nadzieję, że to Cię zainspiruje do działania i pozbędziesz się wszelkich oporów, by zacząć notować wizualnie.",
          "link": "/jak-zaczalem-notowac-wizualnie-moja-historia",
          "img": {
            "src": "/img/vadim-gierko-tablica-korkowa-praca-notatki-wizualne.jpg",
            "alt": "zdjęcie autora na tle tablicy korkowej z przypiętymi notatkami wizualnymi"
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "content": "\nWiele osób, które chcą rozpocząć swoją przygodę z notowaniem wizualnym lub za pomocą map myśli, zastanawia się nad tym, czy da radę, od czego mają zacząć? Jeśli chcesz zacząć notować wizualnie, ale targają Tobą wątpliwości, czytaj dalej i poznaj moje początki!\n\nPS. i zobacz moje notatki sprzed lat…\n\n## Początkujący sketchnoterzy! Nie dajcie się zwieść pięknym notatkom wizualnym z sieci!\n\nW sieci widzimy tyle pięknych dopracowanych notatek wizualnych i przejrzystych map myśli… Nic dziwnego, że później się słyszy, że nie mam talentu plastycznego, nie dam rady zrobić czegoś takiego, nauka i robienie takich notatek zajmie mi mnóstwo czasu…\n\nNie dajmy się zwieść! Notowanie “na pokaz” lub na zamówienie to najczęściej całkiem co innego, niż notowanie na własny użytek, co unaoczniłem w tym podlinkowanym [artykule](/notatki-wizualne-na-pokaz-vs-do-uzytku-wlasnego-porownanie-notatki-nt-patronite-i-jej-szkicu).\n\nZacząłem właśnie od notowania “dla siebie” (a jak to wyglądało, przekonacie się w dalszej części artykułu). Potem doszedłem do takiego poziomu, że mogłem tymi notatkami pochwalić się w sieci, aż zostałem profesjonalnym sketchnoterem (w swoim mniemaniu 😉\n\nDlatego zachęcam Cię do zapoznania się z moją historią! Mam nadzieję, że to Cię zainspiruje do działania i pozbędziesz się wszelkich oporów, by zacząć notować wizualnie.\n\nMiłej lektury i owocnego notowania!\n\n## Notować wizualnie zacząłem już w trakcie studiów\n\nPod koniec studiów (czyli dekadę wstecz) zmieniłem swoje podejście do notowania. Byłem pilnym studentem, nie opuszczałem zajęć i starannie notowałem. Linearnie…\n\nWidząc, że moje notatki linearne notatki nie spełniają swojej funkcji – nie nadają się ani do skutecznej nauki, ani do zapamiętania i odtworzenia – zacząłem coś zmieniać:\n\n- zaprzestałem notowania wszystkiego „słowo w słowo”,\n- skupiłem się na słowach-kluczach i wypunktowaniach,\n- swoje zwykłe linearne notatki zacząłem wzbogacać o elementy wizualne (rysunki, strzałki, symbole),\n- potem, nie zdając sobie z tego sprawy, zacząłem notować w postaci map myśli (złamałem jednak (jak się okazało) większość zasad ich tworzenia),\n- aż zacząłem tworzyć notatki wizualne z prawdziwego zdarzenia (zanim jeszcze poznałem słowo *sketchnoting*), które opierały się głównie na mapach myśli.\n\nW ten sposób zacząłem tworzyć notatki, będące mieszanką wszystkich rodzajów notatek wizualnych. Dlatego właśnie nazwałem je kreatywne notatki. Ale… moje notatki z tamtego okresu w ogóle nie przypominają obecnych, o czym się zaraz przekonasz.\n\nJak widzisz, moje “nawrócenie” na notowanie wizualne nie było nagłym zdarzeniem czy świadomą decyzją, tylko raczej długotrwałym procesem i eksperymentem.\n\nZauważyłem, że taki sposób notowania był bardziej efektywny pod względem powtarzania, nauki i przypominania sobie zanotowanych treści. Od wielu lat notuję wyłącznie w ten sposób. Nie mógłbym (a także nie widzę sensu) przestawić się z powrotem na tradycyjne notowanie.\n\nTakże w trakcie samodzielnej nauki notuję wizualnie podczas szkoleń, webinarów, lektury książek i ebooków. Cokolwiek czytam (ponad 50 książek rocznie), cokolwiek planuję, cokolwiek rozwijam, czegokolwiek się uczę – robię notatki wizualne i mapy myśli. Zrobiłem ich już kilkaset, natomiast opublikowałem ponad 100.\n\n## Notatki wizualne i mapy myśli stały się podstawą moich działań, twórczości i projektów\n\nNotatki wizualne i mapy myśli sprawdziły się nie tylko podczas nauki. Zacząłem z nich korzystać przy planowaniu i realizacji “ponadprogramowych” działań/ projektów oraz podczas rozwoju pomysłów. A po studiach (w sumie w trakcie doktoratu) zacząłem robić mnóstwo twórczych rzeczy, które właśnie zaowocowały wszystkim tym, czym się obecnie zajmuję.\n\n### Przykładowe notatki z 2012-2014 roku\n\nPoniżej możesz zobaczyć, jak wyglądały moje pierwsze “ładniejsze” notatki, a raczej sketchnotingowe mapy myśli, w latach 2012-2014…\n\n![stara notatka wizualna stowarzyszenie miłośników gitary klasycznej](img/stowarzyszenie-gitara-klasyczna-vadim-gierko-notatka-wizualna-1024x727.jpg)\n\n![stara notatka wizualna pozyskanie środków od miasta na płytę promującą twórczość lubelskich twórców](img/lublin-promocja-plyta-szkic-kultura-miasto-inspiracji-vadim-gierko-notatka-wizualna-1024x720.jpg)\n\nNotatka (a raczej mapa-myśli) z gitarą była wizualizacją mojego pomysłu na stowarzyszenie miłośników gitary klasycznej. Pomysł pozostał pomysłem, ale notatka z okolic 2012 roku się zachowała. Można zauważyć, że notatka była pokolorowana kredkami, a nie flamastrami czy cienkopisami, jak to robię obecnie.\n\nZ kolei notatka obok była pomysłem na pozyskanie środków od miasta na płytę promującą twórczość lubelskich twórców. Tę notatkę w ogóle narysowałem długopisem.\n\nPowyższe notatki dotyczyły rozwoju moich pomysłów. Niemniej jednak notowałem także w tamtym okresie na podstawie lektury książek. Poniższa notatka jest tego przykładem:\n\n![stara notatka wizualna na podstawie lektury konsumpcja](img/konsumpcja-klient-kapitalizm-rynek-vadim-gierko-notatka-wizualna-1024x727.jpg)\n\nJeśli się przyjrzysz powyższej notatce, to zauważysz, że w kwadratowych nawiasach zapisywałem autora jakiejś myśli, by móc później wykorzystać to w przypisach.\n\nNo i rzuca się w oczy to, że nie ma w niej żadnych obrazków/ ikonek – same słowa kluczowe, powiązania, wyliczenia i “pudełka” z tekstem.\n\n### Notatka, od której zaczęły się moje dociekania nt. Procesu Twórczego (2015)\n\nKreatywne notatki i mapy myśli były podstawą dla napisania mojego pierwszego ebooka *Łowca pomysłów* w 2016 roku, a szalona notatka, od której się wszystko zaczęło, wyglądała tak:\n\n![stara notatka będąca podstawą i impulsem do napisania pierwszego ebooka łowca pomysłów](img/lowca-pomyslow-przestrzen-informacyjno-energetyczna-vadim-gierko-notatka-wizualna-768x1098.jpg)\n\n### Powyższa notatka/ mapa myśli była impulsem do napisania pierwszego ebooka...\n\nZawierała założenia mojej koncepcji Przestrzeni Informacyjno-energetycznej, w której krążą pomysły w postaci impulsów/ fal, generowane i odbierane przez umysły. Zarówno koncepcja, jak i notatka, jak widać, są dosyć szalone, ale zabawa była przednia!\n\n### ...oraz drugiego – *Zarządzanie Procesem Twórczym*\n\nPonadto, myślenie wizualne jest jednym z filarów wyłożonej w nim [Koncepcji generowania, rozwoju i realizacji pomysłów](/zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia).\n\nWszystkie artykuły, które publikuję na niniejszej stronie oraz które opublikowałem na nieistniejącym już blogu lowcapomyslow.pl, ale także posty w social media, również najpierw wizualizuję.\n\n## Przekazywanie wiedzy. Notatki wizualne sprawdzają się najlepiej\n\nNa studiach doktoranckich prowadziłem zajęcia ze studentami także w oparciu o wcześniej przygotowane na podstawie lektury notatki wizualne. Wtedy zacząłem co raz bardziej “rozkręcać się” w notowaniu wizualnym.\n\nOdkąd zacząłem prowadzić Warsztaty Zarządzania Procesem Twórczym\n\n![zdjęcie autora z warsztatów zarządzania procesem twórczym](img/zarzadzanie-procesem-tworczym-wykres-warsztaty-szkolenie-vadim-gierko.jpg)\n\noraz Warsztaty Notowania Wizualnego, notatki wizualne stały się podstawą także moich prezentacji.\n\n![zdjęcie autora z warsztatów notowania wizualnego](img/warsztaty-notowanie-wizualne-sketchnoting-notatki-vadim-gierko.jpg)\n\nZdarzyło mi się, że jedna wyświetlona na dużym ekranie mapa myśli była wystarczająca, żeby mówić przez 1,5 godziny! Lubię też rysować mapę myśli na bieżąco na tablicy podczas prezentacji.\n\n## Wejście na Instagram i dzielenie się swoimi notatkami ze społecznością\n\nOd 2018 roku zacząłem się dzielić swoimi notatkami na Instagramie i Facebooku (dziękuję mojej siostrze, że mnie do tego zmotywowała!). Najpierw na Instagramie jako *Łowca Pomysłów*, gdzie dzieliłem się wiedzą nt. Zarządzania Procesem Twórczym. Wtedy jeszcze nie potrafiłem robić dobrych zdjęć notatek i nie wyglądały one zbyt atrakcyjnie.\n\n### Sketchnoting Cafe\n\nDzięki aktywności na Instagramie poznałem wtedy wiele osób, które także notowały wizualnie. I okazało się, że w Lublinie działa prężna grupa entuzjastów notowania wizualnego, którzy w dodatku organizują spotkania! PS. a oto i oni:\n\n![zdjęcie autora wraz z innymi sketchnoterami ze spotkania sketchnoting cafe w Lublinie](img/sketchnoterzy-lublin-notowanie-wizualne-sketchnoting-vadim-gierko.jpg)\n\nWięc wybrałem się na jedno z takich spotkań, określanych jako *Sketchnoting Cafe*, i po tym spotkaniu stwierdziłem, że muszę działać “notatkowo” bardziej na poważnie, więc…\n\n### Kreatywne Notatki na Instagramie\n\nW 2019 roku powstał ściśle dedykowany notatkom wizualnym profil [Kreatywne Notatki na Instagramie](https://www.instagram.com/kreatywnenotatki/) (obecnie ponad 2300 obserwujących).\n\n![screenshot profilu kreatywne notatki na instagramie](img/screen-instagrama-Kreatywne-Notatki-2.jpg)\n![screenshot profilu kreatywne notatki na instagramie](img/screen-instagrama-Kreatywne-Notatki-3-1.jpg)\n![screenshot profilu kreatywne notatki na instagramie](img/screen-instagrama-Kreatywne-Notatki.jpg)\n\ni [Facebooku](https://www.facebook.com/kreatywnenotatkipl/) (obecnie ponad 2500 polubień strony).\n\n![screen facebooka kreatywne notatki](img/screen-facebooka-Kreatywne-Notatki.jpg)\n\nPublikowałem swoje notatki regularnie (co najmniej raz w tygodniu do końca 2020 roku) i zostały one zapisane przez użytkowników kilka tysięcy razy! Dzięki tym statystykom wiem, że są one dla Was wartościowe.\n\nOdkąd zacząłem działać na Instagramie jako *Łowca Pomysłów*, a potem dodatkowo jako *Kreatywne Notatki* (na Instagramie i Facebooku), dzielę się swoją wiedzą właśnie w postaci notatek wizualnych. No i widać, że ta forma dzielenia się wiedzą bardzo angażuje użytkowników.\n\n## Nie musisz mieć talentu plastycznego, by notować wizualnie. A jak to się ma do moich lekcji rysunku?\n\nMimo że sam uczęszczałem na lekcje rysunku akademickiego w dzieciństwie, to nadal twierdzę, że nie musisz umieć rysować, by notować wizualnie. Dlaczego?\n\n### Musisz umieć (i chcieć)… bazgrolić! No i pisać 😉\n\nJeśli zaś chodzi o samą umiejętność rysowania (czyli np. dokładnego odwzorowywania przedmiotów, osób, perspektywy itd.), to można ją ćwiczyć, jak każdą inną. Zresztą, wymienione umiejętności wcale nie są niezbędne, by notować wizualnie, nawet na naprawdę dobrym poziomie.\n\nO swoich lekcjach rysunku wspominam, dlatego że wielokrotnie byłem o to pytany przez obserwujących. Ponadto w wielu moich notatkach można dostrzec “naleciałości” rysunku akademickiego. Uwierz mi, to częściej przeszkadza w notowaniu wizualnym, niż pomaga! W szczególności jeśli mówimy o notowaniu “na luzie”, na użytek własny.\n\nRysunki, ikonki, symbole, elementy wizualne w sketchnotingu muszą być schematyczne, proste i… szybkie w wykonaniu. A do tego nie trzeba żadnych umiejętności plastycznych – nie musisz dokładnie odwzorowywać przedmiotów czy osób. Ponadto, notowanie wizualne to nie sztuka, tylko praktyczne narzędzie zapisu informacji w dużym stopniu w formie wizualnej.\n\n### Ćwiczenie rysunku akademickiego może się jednak przydać\n\nAle oczywiście zachęcam nie tylko do bazgrolenia dla przyjemności (np. rysowania ikonek), ale także do rysunku akademickiego. Perspektywa, cieniowanie, proporcje – to wszystko może się przydać nawet w przypadku prostych ikonek!\n\nWiadomo, wymaga to trochę czasu i wysiłku, ale warto zrezygnować z kilku nieproduktywnych zajęć. Ponadto, jak każdy rodzaj rysowania, jest to bardzo odprężająca czynność, frajda, ale także lepsze rozumienie otaczającego nas świata i jego kształtów.\n\nWięc kiedy zechcesz zaszaleć i “pobawić się w artystę/kę”, możesz bardziej dopracować ilustrację w centrum swojej notatki (lub np. podobiznę autora, prelegenta). Czasami właśnie lubię zaszaleć i zadbać o portrety w swoich notatkach, tak jak widać to poniżej.\n\n![notatka wizualna freddie mercury](img/freddie-mercury-queen-vadim-gierko-notatka-wizualna-819x1024.jpg)\n![notatka wizualna jak zarobić na napisaniu ebooka marcin osman](img/marcin-osman-ebook-kreatywne-notatki-vadim-gierko-1024x722.jpg)\n![notatka wizualna prezentacja a-la Steve Jobs](img/wizualna-kreatywna-notatka-sketchnoting-prezentacja-jobs-vadim-gierko-1024x716.jpg)\n\nW powyższych notatkach miałem właśnie okazję wykorzystać swoje umiejętności w zakresie rysunku akademickiego i sprawiło mi to ogrom przyjemności.\n\nNiemniej jednak, są to wyjątki, ponieważ (nie ukrywam, że) takie dopracowanie wymaga dużo więcej czasu. A warto pamiętać, że notowaniem wizualne jest przede wszystkim sposobem na zapis informacji, a nie sztuką. Musi to zatem być narzędzie skuteczne, efektywne i szybkie.\n\n## Moje notatki powstają przede wszystkim... dla mnie i dotyczą moich zainteresowań\n\nZakres tematyczny moich notatek (robionych na podstawie lektury książek i artykułów oraz szkoleń) jest bardzo szeroki:\n\n- rozwój osobisty,\n- psychologia,\n- kreatywność i rozwój twórczy,\n- minimalizm,\n- przedsiębiorczość i działalność gospodarcza,\n- relacje międzyludzkie,\n- skuteczna nauka,\n- media społecznościowe i blogowanie,\n\ndlatego też każdy znajdzie coś ciekawego dla siebie! Oprócz mediów społecznościowych, możesz zobaczyć moje notatki także w Galerii Kreatywnych Notatek, które powstanie wkrótce.\n\nPonadto wykorzystuję swoje notatki jako ilustrację lub podsumowanie do artykułów na blogu. Zauważyłem, że jeśli w poście lub poglądzie linka do artykułu jest notatka wizualna, to więcej osób klika w link.\n\n## Wejście na Patronite\n\nPod koniec listopada 2020 r. dołączyłem do społeczności Patronite, ponieważ tworzenie notatek oraz przetwarzanie wiedzy i materiałów, ich publikacja, prowadzenie profili w mediach społecznościowych, a także pisanie artykułów zajmowały cały mój czas wolny (pracowałem oprócz tego na etacie).\n\nZ tego też względu stwierdziłem, że może uda mi się zyskać wsparcie osób, z którymi dzielę się swoimi notatkami 🙂\n\nNiestety, moja inicjatywa nie spotkała się z jakimkolwiek odzewem. Po kilku miesiącach zamroziłem swoją działalność polegającą na regularnym publikowaniu notatek wizualnych w Internecie. Zaoszczędzony czas przeznaczyłem na swoją kolejną pasję - naukę programowania.\n\nOczywiście, nadal notuję wizualnie na własny użytek oraz sporadycznie wrzucam coś na Instagrama, niemniej jednak nie publikuję już regularnie, jak to miało miejsce w latach 2018-2020.\n\n## Podsumowanie\n\nJak widzisz, notować wizualnie może każdy, a nauka notowania może przebiegać w sposób naturalny i stopniowy:\n\n- słowa kluczowe, wypunktowania,\n- strzałki, symbole, proste ikonki,\n- mapy myśli (najpierw dość “skromne”),\n- notatki wizualne (które też dopiero z czasem się “rozkecają”).\n\nJeśli chodzi o umiejętność rysowania, to po pierwsze nie jest niezbędna, a po drugie – można ją ćwiczyć regularnie notując.\n\nJeśli już zacząłeś/aś notować wizualnie – podziel się swoimi pracami (i zawartą w nich wiedzą) ze społecznością Internetu! W moim przypadku doprowadziło to do mega rozwoju zarówno pod kątem umiejętności, jak i późniejszych zleceń, bloga i warsztatów.\n"
        }
      }
    },
    "projects": {
      "personal-website-next-js": {
        "category": "web-development",
        "itemType": "devProject",
        "metadata": {
          "title": "vadimgierko.com",
          "description": "My personal static website designed & developed by myself from scratch using React, Next.js, React-Bootstrap, Bootstrap & Markdown.",
          "link": "/personal-website-next-js",
          "img": {
            "src": "/img/web-development/projects/vadimgierko-com-personal-website-next-js-screen-vadim-gierko.png",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "public": true,
          "repoName": "personal-website-next-js",
          "skills": [
            "next_js",
            "react",
            "bootstrap",
            "markdown",
            "css",
            "vercel",
            "github"
          ],
          "features": [
            "rwd",
            "dark mode"
          ]
        }
      },
      "kodujemywbiurze.pl": {
        "category": "web-development",
        "itemType": "devProject",
        "metadata": {
          "title": "kodujemywbiurze.pl",
          "description": "Darmowy kurs programowania webowego dla pracowników biurowych.",
          "link": "/kodujemywbiurze.pl",
          "img": {
            "src": "/img/web-development/projects/kodujemy-w-biurze-pl-strona-internetowa-screenshot.jpg",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "public": true,
          "repoName": "kodujemywbiurze.pl",
          "skills": [
            "svelte",
            "typescript",
            "markdown",
            "css",
            "vercel"
          ],
          "features": [
            "rwd",
            "dark mode"
          ]
        }
      },
      "linky-notes": {
        "category": "web-development",
        "itemType": "devProject",
        "metadata": {
          "title": "Linky Notes",
          "description": "Organize & filter your notes with one or more tags, format your notes using Markdown syntax & create your own unstructured knowledge base!",
          "link": "/linky-notes",
          "img": {
            "src": "/img/web-development/projects/linky-notes-app-vadim-gierko.png",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "public": true,
          "repoName": "linky-notes",
          "skills": [
            "react",
            "next_js",
            "typescript",
            "firebase",
            "bootstrap",
            "markdown",
            "css",
            "vercel"
          ],
          "features": [
            "crud",
            "database",
            "routing",
            "users authentication",
            "rwd",
            "dark mode"
          ]
        }
      },
      "chat-app-react": {
        "category": "web-development",
        "itemType": "devProject",
        "metadata": {
          "title": "Realtime Chat App React",
          "description": "Realtime PWA chat app built with React, TypeScript, Bootstrap, Firebase Authentication & Firestore. Deployed on Vercel.",
          "link": "/chat-app-react",
          "img": {
            "src": "/img/web-development/projects/react-chat-app-vadim-gierko-screenshot.png",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "public": true,
          "repoName": "chat-app-react",
          "skills": [
            "react",
            "react_router",
            "typescript",
            "firebase",
            "bootstrap"
          ],
          "features": [
            "rwd",
            "dark mode"
          ]
        }
      },
      "issue-tracker": {
        "category": "web-development",
        "itemType": "devProject",
        "metadata": {
          "title": "Issue Tracker",
          "description": "Track, manage, filter, sort, rank, nest and mix ordered & unordered issues in your dev projects & have an overview of all issues regardless of the project in 1 table.",
          "link": "/issue-tracker",
          "img": {
            "src": "/img/web-development/projects/issue-tracker-app-vadim-gierko-screenshot.png",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "public": true,
          "repoName": "issue-tracker",
          "skills": [
            "react",
            "react_router",
            "firebase",
            "typescript",
            "bootstrap",
            "markdown"
          ],
          "features": [
            "rwd",
            "dark mode"
          ]
        }
      },
      "markdown-text-editor": {
        "category": "web-development",
        "itemType": "devProject",
        "metadata": {
          "title": "Live Markdown Text Editor",
          "description": "Check how your Markdown text will look like when rendered!",
          "link": "/markdown-text-editor",
          "img": {
            "src": "/img/web-development/projects/markdown-text-editor-by-vadim-gierko.png",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "public": true,
          "repoName": "markdown-text-editor",
          "skills": [
            "react",
            "react_router",
            "markdown",
            "bootstrap"
          ],
          "features": [
            "routing",
            "markdown editor",
            "local storage",
            "rwd"
          ]
        }
      },
      "ebook-zarzadzanie-procesem-tworczym": {
        "category": "creative-process-management",
        "itemType": "project",
        "metadata": {
          "title": "Ebook \"Zarządzanie Procesem Twórczym\"",
          "description": "Jedyny w swoim rodzaju praktyczny poradnik i system Zarządzania Procesem Twórczym krok po kroku oparty o autorską koncepcję.",
          "link": "/ebook-zarzadzanie-procesem-tworczym",
          "img": {
            "src": "/img/okładka-ebook-zarządzanie-procesem-twórczym-Vadim-Gierko-tablet-2048x1536.jpg",
            "alt": "zdjęcie ebooka zarządzanie procesem twórczym na tablecie"
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "content": "\n## Czym jest ebook *Zarządzanie Procesem Twórczym*?\n\nJest to jedyny w swoim rodzaju praktyczny poradnik i przewodnik [Zarządzania Procesem Twórczym](/zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia) krok po kroku – instrukcja obsługi Twojego Twórczego Umysłu.\n\nKsiążka ma prawie 300 stron i zawiera całą moją aktualną wiedzę, którą kumulowałem i generowałem od drugiej połowy 2015 roku!\n\nTen ebook dosłownie przeprowadzi Cię przez cały Proces Twórczy – od Punktu Inicjującego do Realizacji. Książka stanowi uniwersalne kompendium wiedzy na temat Procesu Twórczego.\n\nDzięki wskazówkom i narzędziom przedstawionym w tej książce:\n- przejmiesz kontrolę nad swoją twórczością (a z lektury dowiesz się, że twórczość jest pojęciem bardzo obszernym) i procesem generowania i rozwoju pomysłów,\n- staniesz się bardziej kreatywny/a,\n- zapanujesz nad natchnieniem,\n- pokonasz każdą blokadę twórczą,\n- nauczysz się maksymalnie wykorzystywać te zasoby, które masz w danej chwili.\n\n![notatka wizualna zostań menadżerem zarządzania procesem twórczym](img/zarzadzanie-procesem-tworczym-vadim-gierko-infografika.jpg)\n\n## Co zawiera ebook?\n\n**Autorską Koncepcję Etapów i Punktów Krytycznych Procesu Twórczego**, która wywodzi się z prac Helmholtza, Poincaré-go i Wallasa, ale dzięki kilkunastu innowacjom stała się czymś jakościowo nowym.\n\nJest to niezbędna wiedza teoretyczna, poparta moimi wieloletnimi badaniami, analizą lektury przedmiotu i doświadczeniem, bez której niemożliwe jest sprawne Zarządzanie Procesem Twórczym.\n\nDzięki zrozumieniu struktury i przebiegu Procesu Twórczego będzie Ci łatwiej zdiagnozować, w jakim “miejscu” jest aktualnie Twój Projekt, co pozwoli dobrać odpowiednie działania, których efektem ma być rozwój i realizacja Projektu.\n\nPonadto, dzięki tej wiedzy zaczniesz rozumieć i właściwie interpretować pewne trudności, które zawsze pojawiają się podczas Pracy Twórczej. Zrozumiesz ich źródło i będziesz wiedzieć, jak temu zaradzić i jak na to reagować.\n\n**Pytania Kontrolne i Checklisty**, tworzące spójny i nie mający analogów **praktyczny System Zarządzania Procesem Twórczym**. Pytania Kontrolne do każdego rozdziału odnoszą się i wynikają z Koncepcji Zarządzania Procesem Twórczym i są przełożeniem wiedzy teoretycznej na język praktyki.\n\nPytania Kontrolne (a raczej odpowiedzi, które na nie udzielisz) przeprowadzą Cię krok po kroku przez cały proces pracy nad generowaniem i rozwojem pomysłu/ projektu. Wystarczy po prostu przechodzić od pytania do pytania, które podpowiedzą, jakie konkretne działania trzeba podjąć, aby Projekt cały czas posuwał się do przodu. Dzięki tym Pytaniom i Checklistom nie będziesz już miał/a wymówki: Nie wiem, co teraz mam robić, w którą stronę mam iść.\n\n**Problemy**, z którymi będziesz miał/a do czynienia **oraz wachlarz Rozwiązań tych problemów i Wskazówek**.\n\nAutorskie szczegółowo opisane **“patenty” na Organizację Pracy Twórczej**, wynikające z [Koncepcji Zarządzania Procesem Twórczym](/zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia).\n\nA wisienką na torcie jest **zwięzły Poradnik myślenia wizualnego** i wykorzystania jego narzędzi, tj.: rysowanie, [mapy myśli](/jak-notowac-efektywnie-rob-notatki-wizualne) i [notatki wizualne](/mapy-mysli-jak-je-tworzyc-i-jak-z-nich-korzystac) w procesie generowania i rozwoju pomysłów oraz planowania i realizacji Projektów.\n\n![okładka ebooka](img/zarządzanie-procesem-twórczym-vadim-gierko-ebook-724x1024.jpg)\n\n## Jaki jest cel tej książki?\n\nCelem niniejszego ebooka jest towarzyszenie Tobie w Twoim Procesie Twórczym, żebyś nie był/a pozostawiony/a samemu/ samej sobie. Wiem z doświadczenia, że Twórcy bardzo potrzebują wsparcia, zarówno emocjonalnego, jak i merytorycznego. I jednego, i drugiego rodzaju wsparcia jest w tej książce pod dostatkiem.\n\nBędę towarzyszył Tobie poprzez dostarczanie wiedzy, strategii, narzędzi, praktycznych wskazówek, rozwiązań twórczych problemów, dzięki którym będziesz mógł/a dać z siebie pod względem twórczym wszystko, na co Cię stać.\n\nMoja misją jest jest pomóc Tobie:\n- świadomie zarządzać Procesem Twórczym, zarówno przed, jak i po pojawieniu się pomysłu,\n- stwarzać odpowiednie, pasujące do Twoich indywidualnych potrzeb, warunki Pracy Twórczej oraz efektywnie nią zarządzać,\n- generować, rozwijać, weryfikować i realizować pomysły i projekty,\n- pokonywać i właściwie interpretować charakterystyczne dla Procesu Twórczego problemy, tj.:\n  - impas,\n  - martwy punkt,\n  - blokada twórcza,\n  - brak natchnienia,\n  - brak pomysłów itd.\n\n## Dla kogo jest ta książka?\n\nNajchętniej napisałbym tutaj, że *Zarządzanie Procesem Twórczym* jest dla każdego, ale… mówi się, że jeśli coś jest dla każdego, to w gruncie rzeczy jest dla nikogo.\n\nDlatego napiszę, że niniejsza książka jest dla wszystkich, którzy tworzą lub zamierzają tworzyć coś jakościowo nowego.\n\nJeśli Twoja praca zawodowa, działalność gospodarcza, hobby, zainteresowania, studia wymagają od Ciebie bycia kreatywnym/ą, tworzenia nowych rzeczy, pomysłów, koncepcji, rozwiązań, to ebook *Zarządzanie Procesem Twórczym* jest tym, czego potrzebujesz. I… tym, czego w takiej formie nigdzie nie dostaniesz.\n\nTa książka trafi w odpowiednie ręce, jeśli:\n- Jesteś twórczy/a,\n- Nie jesteś twórczy/a,\n- Jesteś studentem/ką, doktorantem/ką, któremu/ej przyjdzie się zmierzyć z pisaniem referatów, prac dyplomowych, artykułów, robieniem projektów, prezentacji i badań,\n- Jesteś wykładowcą, prowadzącym/ą warsztaty, kursy, szkolenia,\n- Jesteś naukowcem, wynalazcą, badaczem/ką,\n- Jesteś blogerem/ką, twórcą wszelkiego rodzaju contentu/ treści, publicystą/ką, dziennikarzem/ką, autorem/ką,\n- Jesteś artystą/ką, muzykiem, performerem/ką, twórcą oprogramowania\n- Chcesz pozostawić po sobie ślad/ wartościowy wkład w rozwój społeczeństwa,\n- Lubisz pracować nad “grubymi”, złożonymi, wielowątkowymi i długoterminowymi projektami/ koncepcjami/ ideami,\n- Masz 0, 1, nieskończenie wiele pomysłów,\n- Doskwiera Ci brak natchnienia, motywacji, pomysłów, utknąłeś w martwym punkcie.\n\nTo jak, znalazłeś/aś siebie na tej liście?\n\nPonadto, ta książka jest dla Ciebie, nawet jeśli nie masz żadnych problemów z generowaniem i rozwojem pomysłów! Lektura dostarczy Ci wiedzę i “patenty”, które uczynią Cię jeszcze bardziej kreatywnym/ą, a także (najprawdopodobniej) upewni Cię w Twoich racjach (lub wyjaśni, dlaczego jest tak, a nie inaczej).\n\n## Co zyskasz dzięki lekturze ebooka *Zarządzanie Procesem Twórczym*?\n\nOprócz wszystkiego, co opisałem powyżej, chciałbym Cię zapewnić, że dzięki tej książce:\n\n- Zaoszczędzisz mnóstwo czasu,\n- Nie będziesz musiał/a wertować tysięcy stron książek i artykułów,\n- Będziesz bardziej efektywny/a i produktywny/a w generowaniu i realizacji pomysłów i projektów,\n- Będziesz miał/a gotowy plan działania krok po kroku, w czym pomogą zestawy konkretnych, szczegółowych i wynikających z Koncepcji Etapów Procesu Twórczego pytań kontrolnych (które nazywam Systemem Zarządzania Procesem Twórczym właśnie),\n- Przejmiesz stery nad swoją kreatywnością, zaangażujesz w Proces Twórczy nowe, być może nieodkryte wcześniej pokłady umiejętności/ narzędzia,\n- Poradzisz sobie z każdą blokadą twórczą i staniesz się Twórcą Seryjnym (czyli generującym pomysły non stop)!\n\n![okładka ebooka](img/okładka-ebook-zarządzanie-procesem-twórczym-Vadim-Gierko-tablet-1024x768.jpg)\n\n## Gdzie można kupić ebooka?\n\nPremiera książki w formie elektronicznej miała miejsce 8 maja 2020 r. Ebook był dostępny w sklepie internetowym na mojej stronie do końca grudnia 2020 r.\n\n**W chwili obecnej ebook nie jest dostępny w sprzedaży. Jeśli jesteś zainteresowany/a ebookiem, możesz skontaktować się ze mną na [Instagramie](https://www.instagram.com/vadim.gierko/) lub Facebooku (Vadim Gierko)**.\n"
        }
      },
      "warsztaty-zarzadzania-procesem-tworczym": {
        "category": "creative-process-management",
        "itemType": "project",
        "metadata": {
          "title": "Warsztaty Zarządzania Procesem Twórczym",
          "description": "Warsztaty ZPT dla studentów zorganizowane na Uniwersytecie Marii Curie-Skłodowskiej w Lublinie w 2019 r.",
          "link": "/warsztaty-zarzadzania-procesem-tworczym",
          "img": {
            "src": "/img/zarzadzanie-procesem-tworczym-wykres-warsztaty-szkolenie-vadim-gierko-uczestnicy.jpg",
            "alt": "zdjęcie z warsztatów zarządzania procesem twórczym"
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {}
      },
      "blog-lowca-pomyslow": {
        "category": "creative-process-management",
        "itemType": "project",
        "metadata": {
          "title": "Blog nt. Zarządzania Procesem Twórczym \"Łowca Pomysłów\"",
          "description": "W latach 2018-2020 prowadziłem bloga nt. kreatywności, generowania pomysłów oraz organizacji i rozwoju projektów twórczych. Na \"Łowcy Pomysłów\" opublikowałem kilkanaście obszernych artykułów, które później wykorzystałem w wydanym ebooku \"ZPT\"",
          "link": "/blog-lowca-pomyslow",
          "img": {
            "src": "/img/blog-łowca-pomysłów-vadim-gierko-proces-twórczy.jpg",
            "alt": "screen nieistniejącego już bloga \"Łowca Pomsyłów\""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {}
      },
      "profil-lowca-pomyslow-na-facebooku-i-instagramie": {
        "category": "creative-process-management",
        "itemType": "project",
        "metadata": {
          "title": "Profil \"Łowca Pomysłów\" na Facebooku i imienny profil na Instagramie",
          "description": "Od 2018 r. prowadzę profil na Instagramie i Facebooku, na którym dzielę się swoją wiedzą nt. Zarządzania Procesem Twórczym, generowania pomysłów i realizacji twórczych projektów (prawie 200 opublikowanych postów). Od grudnia 2020 roku moja aktywność na profilach została zamrożona w związku ze skupieniem się na nauce programowania.",
          "link": "/profil-lowca-pomyslow-na-facebooku-i-instagramie",
          "img": {
            "src": "/img/screen-instagram-vadim-gierko.png",
            "alt": "screen profilu \"Kreatywnych Notatek\" na Instagramie"
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "externalLinks": [
            {
              "icon": "instagram",
              "link": "https://www.instagram.com/vadim.gierko/",
              "description": "Odwiedź profil na Instagramie"
            },
            {
              "icon": "facebook",
              "link": "https://www.facebook.com/lowcapomyslow/",
              "description": "Odwiedź profil na Facebooku"
            }
          ]
        }
      },
      "profil-kreatywne-notatki-na-instagramie-i-facebooku": {
        "category": "visual-thinking",
        "itemType": "project",
        "metadata": {
          "title": "Profil \"Kreatywne Notatki\" na Instagramie i Facebooku",
          "description": "Od 2018 r. prowadzę profil na Instagramie i Facebooku, na którym dzielę się swoimi notatkami wizualnymi oraz mapami myśli (ponad 100 opublikowanych postów). Profil obserwuje ponad 2300 osób!",
          "link": "/profil-kreatywne-notatki-na-instagramie-i-facebooku",
          "img": {
            "src": "/img/screen-instagrama-Kreatywne-Notatki-2.jpg",
            "alt": "screen profilu \"Kreatywnych Notatek\" na Instagramie"
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "externalLinks": [
            {
              "icon": "instagram",
              "link": "https://www.instagram.com/kreatywnenotatki/",
              "description": "Odwiedź profil na Instagramie"
            },
            {
              "icon": "facebook",
              "link": "https://www.facebook.com/kreatywnenotatkipl/",
              "description": "Odwiedź profil na Facebooku"
            }
          ]
        }
      },
      "blog-kreatywne-notatki": {
        "category": "visual-thinking",
        "itemType": "project",
        "metadata": {
          "title": "Blog \"Kreatywne Notatki\"",
          "description": "w latach 2018-2020 prowadziłem bloga nt. notowania wizualnego \"Kreatywne Notatki\"",
          "link": "/blog-kreatywne-notatki",
          "img": {
            "src": "/img/screen-blog-kreatywne-notatki.png",
            "alt": "screen nieistniejącego już bloga \"Kreatywne Notatki\""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {}
      },
      "warsztaty-myslenia-wizualnego-notatki-wizualne-mapy-mysli": {
        "category": "visual-thinking",
        "itemType": "project",
        "metadata": {
          "title": "Warsztaty Notowania Wizualnego oraz Tworzenia Map Myśli",
          "description": "\nPod koniec 2019 r. zorganizowałem warsztaty notowania wizualnego według autorskiego programu.\nWarsztaty odbyły się w ramach festiwalu “Ukraina w centrum Lublina”.\n    ",
          "link": "/warsztaty-myslenia-wizualnego-notatki-wizualne-mapy-mysli",
          "img": {
            "src": "/img/zarzadzanie-procesem-tworczym-wykres-warsztaty-szkolenie-vadim-gierko-uczestnicy.jpg",
            "alt": "zdjęcie z warsztatów notowania wizualnego oraz tworzenia map myśli na umcs"
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "content": "\nChciałbyś/abyś, aby Twoi pracownicy/ zespół nabyli unikalną, niezwykle efektywną, praktyczną i tak bardzo potrzebną obecnie umiejętność i narzędzie do\n\n- planowania i zarządzania,\n- rozwiązywania problemów,\n- generowania i prezentacji pomysłów,\n- klarownego podsumowywania i sprawozdania wykonanej pracy/ projektów,\n- przyswajania nowej wiedzy i umiejętności?\n\nJest jedno potężne narzędzie, które może ułatwić wszystkie powyższe czynności i wynieść je na zupełnie inny poziom. Tym narzędziem jest myślenie i notowanie wizualne!\n\nCzytaj dalej i dowiedz się, w jaki sposób warsztaty myślenia wizualnego mogą usprawnić pracę i kreatywność Twojego zespołu. Notatki wizualne i mapy myśli całkowicie odmienią Wasze wyniki!\n\n## Czym jest myślenie wizualne? [Notatki wizualne](/jak-notowac-efektywnie-rob-notatki-wizualne) i [mapy myśli](/mapy-mysli-jak-je-tworzyc-i-jak-z-nich-korzystac)\n\nNotowanie wizualne (z ang. *sketchnoting*: *sketch* – szkic, *noting* – notowanie) to metoda tworzenia notatek nie tylko za pomocą pisma, ale także rysunków, ręcznej typografii, różnych kształtów i elementów wizualnych tj.: strzałki, linie, ramki, „chmurki” itd.\n\nNotowanie wizualne staje się coraz bardziej popularne także w Polsce, o czym można się przekonać, wpisując hasła notowanie wizualne, notatki wizualne lub sketchnoting na Instagramie, Pintereście, Facebooku czy w wyszukiwarce internetowej.\n\nW Europie Zachodniej, Stanach Zjednoczonych, Kanadzie notowanie wizualne już od dawna jest standardem. Notatki wizualne są sporządzane na każdej większej konferencji, w ramach większych projektów, w szczególności międzynarodowych.\n\nObecnie w Polsce profesjonalnie zajmuje się tym kilkanaście osób (wykonują notatki na zamówienie, prowadzą warsztaty i piszą poradniki). Natomiast setki polskich sketchnoterów dzielą się efektami swojej pracy w Internecie.\n\n## Jak Twój zespół skorzysta z notatek wizualnych i map myśli w pracy i poza pracą?\n\n![notatka dlaczego warto notować wizualnie](img/notatki-wizualne-artykul-efektywna-nauka-notowanie-vadim-gierko-sketchnoting-887x1024.jpg)\n\nNotatki wizualne i mapy myśli służą jako:\n\n- narzędzie efektywnego zarządzania wiedzą i informacją,\n- niezwykle atrakcyjny sposób na prezentację pomysłów, rozwiązań, projektów i procedur,\n- uatrakcyjnienie Twojej oferty i materiałów marketingowych, artykułów na blogu (Twoim, firmowym czy instytucji) i postów w social media.\n\nDzięki mapom myśli, infografikom i notatkom wizualnym Twój zespół:\n\n- będzie efektywniej zarządzać wiedzą, planować i realizować projekty,\n- usprawni komunikację zarówno wewnątrz swojego zespołu, jak i ze swoimi klientami, obserwującymi i subskrybentami firmowego bloga/ instytucji,\n- łatwiej dotrze zarówno do klientów, jak i przyszłych partnerów w mediach społecznościowych, ponieważ wyglądają one naprawdę obłędnie i sprawią, że Twoje przedsięwzięcie zostanie zauważone i zapamiętane,\n- zbuduje dobre relacje z osobami obserwującymi Twoją markę/ działalność w mediach społecznościowych, subskrybentami bloga firmowego,\n- wypozycjonuje Waszą stronę www/ bloga w Google,\n- podzieli się wartościową i zapadającą w pamięć wiedzą/ informacją, budując tym samym pozycję eksperta – odbiorcy będą Ci za to bardzo wdzięczni!\n\nMogę zorganizować dla Ciebie i Twoich pracowników/ zespołu warsztaty/ szkolenie z zakresu tworzenia i wykorzystywania w praktyce map myśli oraz notowania wizualnego. Nie przegap okazji do podniesienia kwalifikacji swoich pracowników/ swojego zespołu! Dzięki nowym umiejętnościom i narzędziom Twój zespół i Twoje projekty wystartują jak rakieta.\n\nObejrzyj moje notatki wizualne i mapy myśli na profilach *Kreatywnych Notatek* na [Instagramie](https://www.instagram.com/kreatywnenotatki/) lub [Facebooku](https://www.facebook.com/kreatywnenotatkipl/), gdzie obserwuje mnie ponad 2300 i 2500 osób odpowiednio.\n\n![zdjęcie uczestników warsztatów notowania wizualnego tworzących notatki przy stole](img/warsztaty-notowanie-wizualne-sketchnoting-notatki-vadim-gierko-proces-szkolenie.jpg)\n"
        }
      }
    },
    "videos": {
      "jak-tworzyc-lepsze-notatki-ktore-pomoga-w-efektywnej-nauce-or-rozmowa-z-vadimem-gierko-(czesc-1)": {
        "category": "visual-thinking",
        "itemType": "video",
        "metadata": {
          "title": "Jak tworzyć lepsze notatki, które pomogą w efektywnej nauce? | Rozmowa z Vadimem Gierko (część 1)",
          "description": "Posłuchaj 1. części rozmowy Agaty Spendowskiej ze mną nt. tego, jak tworzyć lepsze notatki, które pomogą w lepszej nauce, także nauce języka obcego.",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "id": "kNJxrv4aMDM",
          "width": "885",
          "height": "498"
        }
      },
      "skuteczne-notatki.-jak-je-tworzyc-or-rozmowa-z-vadimem-gierko-(czesc-2)": {
        "category": "visual-thinking",
        "itemType": "video",
        "metadata": {
          "title": "Skuteczne notatki. Jak je tworzyć? |  Rozmowa z Vadimem Gierko (część 2)",
          "description": "Posłuchaj 2. części rozmowy Agaty Spendowskiej ze mną nt. tego, jak tworzyć lepsze notatki, które pomogą w lepszej nauce, także nauce języka obcego.",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "id": "t8QpakTlq_8",
          "width": "885",
          "height": "498"
        }
      },
      "notatka-ktora-hakuje-pamiec...-i-poprawia-nauke:-)": {
        "category": "visual-thinking",
        "itemType": "video",
        "metadata": {
          "title": "Notatka, która HAKUJE PAMIĘĆ... i poprawia naukę:-)",
          "description": "Posłuchaj prezentacji trenera pamięci Macieja Łuczaka nt. tego, jak zhakować mózg podczas nauki na podstawie mojej notatki wizualnej stworzonej podczas webinaru.",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "id": "H01KKQoejvI",
          "width": "885",
          "height": "498"
        }
      }
    },
    "audios": {
      "august-gardens": {
        "category": "music",
        "itemType": "audio",
        "metadata": {
          "title": "August Gardens",
          "description": "",
          "link": "https://soundcloud.com/vadimgierko/august-gardens-by-vadim-gierko",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "src": "https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/493381110&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&visual=true"
        }
      },
      "b-day-theme": {
        "category": "music",
        "itemType": "audio",
        "metadata": {
          "title": "B-day Theme",
          "description": "",
          "link": "https://soundcloud.com/vadimgierko/b-day-theme-vadim-gierko",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "src": "https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/496561764&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&visual=true"
        }
      },
      "elevator-to-sadness": {
        "category": "music",
        "itemType": "audio",
        "metadata": {
          "title": "Elevator To Sadness",
          "description": "",
          "link": "https://soundcloud.com/vadimgierko/elevator-to-sadness-vadim-gierko",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "src": "https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/504060867&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&visual=true"
        }
      }
    },
    "images": {
      "ebook-dlaczego-warto-vadim-gierko-kreatywne-notatki-notatka-wizualna-sketchnoting-poradnik-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "ebook-dlaczego-warto-vadim-gierko-kreatywne-notatki-notatka-wizualna-sketchnoting-poradnik-1024x1024.jpg"
        }
      },
      "esej-vadim-gierko-pisanie-kreatywne-notatki.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "esej-vadim-gierko-pisanie-kreatywne-notatki.jpg"
        }
      },
      "freddie-mercury-queen-vadim-gierko-notatka-wizualna-819x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "freddie-mercury-queen-vadim-gierko-notatka-wizualna-819x1024.jpg"
        }
      },
      "grafika-grafiki-klosinski-jak-tworzyc-notatka-wizualna-kreatywne-notatki-vadim-gierko-819x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "grafika-grafiki-klosinski-jak-tworzyc-notatka-wizualna-kreatywne-notatki-vadim-gierko-819x1024.jpg"
        }
      },
      "instagram-media-spolecznosciowe-rozwoj-tworczy-kreatywnosc-vadim-gierko-notatka-wizualna-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "instagram-media-spolecznosciowe-rozwoj-tworczy-kreatywnosc-vadim-gierko-notatka-wizualna-1024x1024.jpg"
        }
      },
      "introwertyk-kreatywne-notatki-vadim-gierko-1024x955.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "introwertyk-kreatywne-notatki-vadim-gierko-1024x955.jpg"
        }
      },
      "jak-napisac-tekst-vadim-gierko-kreatywne-notatki-notatka-wizualna-sketchnoting-bartlomiej-krawczyk-1024x723.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "jak-napisac-tekst-vadim-gierko-kreatywne-notatki-notatka-wizualna-sketchnoting-bartlomiej-krawczyk-1024x723.jpg"
        }
      },
      "jak-oszczedzac-prad-gaz-woda-vadim-gierko-kreatywne-notatki.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "jak-oszczedzac-prad-gaz-woda-vadim-gierko-kreatywne-notatki.jpg"
        }
      },
      "jak-zhakowac-mozg-vadim-gierko-kreatywne-notatki-notatka-wizualna-sketchnoting-dobra-pamiec-1024x765.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "jak-zhakowac-mozg-vadim-gierko-kreatywne-notatki-notatka-wizualna-sketchnoting-dobra-pamiec-1024x765.jpg"
        }
      },
      "mapa-mapy-mysli-vadim-gierko-notatki-wizualne-poradnik-artykul-nauka-zarzadzanie.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "mapa-mapy-mysli-vadim-gierko-notatki-wizualne-poradnik-artykul-nauka-zarzadzanie.jpg"
        }
      },
      "mapa-mysli-design-thinking-vadim-gierko-kreatywne-notatki-1-1024x717.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "mapa-mysli-design-thinking-vadim-gierko-kreatywne-notatki-1-1024x717.jpg"
        }
      },
      "mapa-mysli-notatka-wizualna-vadim-gierko-linkedin-892x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "mapa-mysli-notatka-wizualna-vadim-gierko-linkedin-892x1024.jpg"
        }
      },
      "marcin-osman-ebook-kreatywne-notatki-vadim-gierko-1024x722.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "marcin-osman-ebook-kreatywne-notatki-vadim-gierko-1024x722.jpg"
        }
      },
      "notatka-wizualna-vadim-gierko-kreatywne-notatki-firma-czyli-ty-paul-jarvis-gosia-zimniak-1024x730.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "notatka-wizualna-vadim-gierko-kreatywne-notatki-firma-czyli-ty-paul-jarvis-gosia-zimniak-1024x730.jpg"
        }
      },
      "notatka-wizualna-vadim-gierko-kreatywne-notatki-warunki-pracy-kreatywnosc-mapa-mysli-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "notatka-wizualna-vadim-gierko-kreatywne-notatki-warunki-pracy-kreatywnosc-mapa-mysli-1024x1024.jpg"
        }
      },
      "notatki-wizualne-artykul-efektywna-nauka-notowanie-vadim-gierko-sketchnoting-887x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "notatki-wizualne-artykul-efektywna-nauka-notowanie-vadim-gierko-sketchnoting-887x1024.jpg"
        }
      },
      "patronite-vadim-gierko-kreatywne-wizualne-notatki-819x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "patronite-vadim-gierko-kreatywne-wizualne-notatki-819x1024.jpg"
        }
      },
      "projekty-praca-tworcza-lowca-pomyslow-notatka-wizualna-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "projekty-praca-tworcza-lowca-pomyslow-notatka-wizualna-1024x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-czytanie-produktywnosc-ksiazki-lektura-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-czytanie-produktywnosc-ksiazki-lektura-1024x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-dalai-lama-czas-zarzadzanie-rozwoj-osobisty-860x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-dalai-lama-czas-zarzadzanie-rozwoj-osobisty-860x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-folowers-instagram-haremska-sprawny-marketing-819x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-folowers-instagram-haremska-sprawny-marketing-819x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-freddie-mercury-queen-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-freddie-mercury-queen-1024x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-identyfikacja-wizualna-instagram-marka-osobista-sprawny-marketing-879x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-identyfikacja-wizualna-instagram-marka-osobista-sprawny-marketing-879x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-instagram-bledy-content-marketing-sprawny-1024x957.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-instagram-bledy-content-marketing-sprawny-1024x957.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-inteligencja-einstein-838x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-inteligencja-einstein-838x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-jak-pisac-lepiej-poradnik-blog-pisanie-pisarz-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-jak-pisac-lepiej-poradnik-blog-pisanie-pisarz-1024x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-koncentracja-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-koncentracja-1024x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-nauka-jezyk-obcy-teachersi-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-nauka-jezyk-obcy-teachersi-1024x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-nawyki-dyscyplina-zarzadzanie-czasem-1024x871.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-nawyki-dyscyplina-zarzadzanie-czasem-1024x871.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-perfekcjonizm-rozwoj-osobisty-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-perfekcjonizm-rozwoj-osobisty-1024x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-pisanie-poradnik-blog-902x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-pisanie-poradnik-blog-902x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-praca-etat-olekszyk-workbalance-kariera-1024x727.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-praca-etat-olekszyk-workbalance-kariera-1024x727.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-praca-gleboka-cal-newport-1024x732.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-praca-gleboka-cal-newport-1024x732.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-reguly-kreatywnego-myslenia-chybicka-1024x726.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-reguly-kreatywnego-myslenia-chybicka-1024x726.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-rok-szkolny-rozwoj-osobisty-dzieci-kreatywnosc-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-rok-szkolny-rozwoj-osobisty-dzieci-kreatywnosc-1024x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-rozwoj-osobisty-weekend-tworczosc-kreatywnosc-913x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-rozwoj-osobisty-weekend-tworczosc-kreatywnosc-913x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-situationship-zwiazek-relacje-psychologia-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-situationship-zwiazek-relacje-psychologia-1024x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-swieta-zero-waste-1024x716.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-swieta-zero-waste-1024x716.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-szkolenia-poradnik-klosinski-sowa-845x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-szkolenia-poradnik-klosinski-sowa-845x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-tworca-tworczosc-czego-zaluje-niespelniony-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-tworca-tworczosc-czego-zaluje-niespelniony-1024x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-warunki-pracy-kreatywnosc-natchnienie-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-warunki-pracy-kreatywnosc-natchnienie-1024x1024.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-zarzadzanie-czasem-business-insider-1024x928.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-zarzadzanie-czasem-business-insider-1024x928.jpg"
        }
      },
      "vadim-gierko-kreatywne-notatki-zwiazek-psychologia-relacje-kobieta-milosc-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "vadim-gierko-kreatywne-notatki-zwiazek-psychologia-relacje-kobieta-milosc-1024x1024.jpg"
        }
      },
      "wizualna-kreatywna-notatka-sketchnoting-design-thinking-suslik-vadim-gierko-1024x713.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "wizualna-kreatywna-notatka-sketchnoting-design-thinking-suslik-vadim-gierko-1024x713.jpg"
        }
      },
      "wizualna-kreatywna-notatka-sketchnoting-klosinski-klient-strategia-vadim-gierko-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "wizualna-kreatywna-notatka-sketchnoting-klosinski-klient-strategia-vadim-gierko-1024x1024.jpg"
        }
      },
      "wizualna-kreatywna-notatka-sketchnoting-mind-map-instagram-pomysl-vadim-gierko-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "wizualna-kreatywna-notatka-sketchnoting-mind-map-instagram-pomysl-vadim-gierko-1024x1024.jpg"
        }
      },
      "wizualna-kreatywna-notatka-sketchnoting-prezentacja-jobs-vadim-gierko-1024x716.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "wizualna-kreatywna-notatka-sketchnoting-prezentacja-jobs-vadim-gierko-1024x716.jpg"
        }
      },
      "wizualna-kreatywna-notatka-sketchnoting-problem-rozwiazanie-watanabe-vadim-gierko-1024x726.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "wizualna-kreatywna-notatka-sketchnoting-problem-rozwiazanie-watanabe-vadim-gierko-1024x726.jpg"
        }
      },
      "zarzadzanie-procesem-tworczym-vadim-gierko-infografika.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "zarzadzanie-procesem-tworczym-vadim-gierko-infografika.jpg"
        }
      },
      "zero-waste-vadim-gierko-kreatywne-notatki-notatka-wizualna-sketchnoting-1024x1024.jpg": {
        "category": "visual-thinking",
        "itemType": "image",
        "metadata": {
          "title": "",
          "description": "",
          "link": "",
          "img": {
            "src": "",
            "alt": ""
          },
          "ogTitle": "",
          "ogDescription": "",
          "ogImage": ""
        },
        "props": {
          "slug": "zero-waste-vadim-gierko-kreatywne-notatki-notatka-wizualna-sketchnoting-1024x1024.jpg"
        }
      }
    }
  },
  "categories": {
    "web-development": {
      "name": "web-development",
      "metadata": {
        "title": "Programowanie stron i aplikacji internetowych",
        "description": "\nJestem web developerem z 4-letnim doświadczeniem programistycznym, który potrafi stworzyć **statyczne (SSG) i dynamiczne (SSR) strony internetowe**, **aplikacje webowe** oraz **podstawowe sklepy internetowe** za pomocą takich technologii, jak m. in.: *React, Next.js, JavaScript, TypeScript, Bootstrap, Firebase i Stripe*.\n\n**Jestem otwarty na oferty pracy na stanowiska Front-end/ Full-stack React/ JavaScript/ TypeScript/ Next.js Developer stacjonarnie w Lublinie lub zdalnie w Polsce**.\n    ",
        "link": "/web-development",
        "img": {
          "src": "",
          "alt": ""
        },
        "ogTitle": "Vadim Gierko | Web Developer",
        "ogDescription": "Programowanie stron i aplikacji internetowych | Portfolio",
        "ogImage": "https://www.vadimgierko.com/img/web-development/projects/vadim-gierko-web-developer-skills-screenshot.png"
      },
      "props": {
        "skills": [
          "typescript",
          "javascript",
          "next_js",
          "react",
          "react_router",
          "firebase",
          "bootstrap",
          "stripe",
          "css",
          "html",
          "markdown",
          "github",
          "vercel"
        ],
        "icon": "laptop"
      },
      "items": {
        "articles": [
          "5-reasons-why-i-started-learning-programming",
          "summary-of-my-first-year-of-learning-web-development-roadmap-projects-and-tips-for-newbies"
        ],
        "projects": [
          "personal-website-next-js",
          "kodujemywbiurze.pl",
          "linky-notes",
          "chat-app-react",
          "issue-tracker",
          "markdown-text-editor"
        ],
        "videos": [],
        "audios": [],
        "images": []
      }
    },
    "creative-process-management": {
      "name": "creative-process-management",
      "metadata": {
        "title": "Zarządzanie Procesem Twórczym (ZPT)",
        "description": "\nOd 2015 roku badam prawidłowości zachodzące w procesie twórczym, opierając się na własnych doświadczeniach oraz na podstawie literatury przedmiotu.\n\nWnioskami, do których doszedłem, oraz autorską koncepcją i systemem Zarządzania Procesem Twórczym podzieliłem się na swoim blogu, profilach na Facebooku i Instagramie, w ebooku oraz podczas warsztatów.\n\t\t\nUważam, że każdy/a jest kreatywny/a, talent i kreatywność można odkrywać i rozwijać, twórczością może być każdy rodzaj działalności, a twórczością i Procesem Twórczym można zarządzać.\n    ",
        "link": "/creative-process-management",
        "img": {
          "src": "",
          "alt": ""
        },
        "ogTitle": "Zarządzanie Procesem Twórczym (ZPT)",
        "ogDescription": "\nOd 2015 roku badam prawidłowości zachodzące w procesie twórczym, opierając się na własnych doświadczeniach oraz na podstawie literatury przedmiotu.\n\nWnioskami, do których doszedłem, oraz autorską koncepcją i systemem Zarządzania Procesem Twórczym podzieliłem się na swoim blogu, profilach na Facebooku i Instagramie, w ebooku oraz podczas warsztatów.\n\t\t\nUważam, że każdy/a jest kreatywny/a, talent i kreatywność można odkrywać i rozwijać, twórczością może być każdy rodzaj działalności, a twórczością i Procesem Twórczym można zarządzać.\n    ",
        "ogImage": ""
      },
      "props": {
        "skills": [],
        "icon": "bulb"
      },
      "items": {
        "articles": [
          "zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia",
          "jak-uporzadkowac-pomysly-wielka-ksiega-pomyslow",
          "dokumentacja-procesu-tworczego-dlaczego-warto-jak-to-robic-krok-po-kroku",
          "jak-media-spolecznosciowe-stymuluja-rozwoj-tworczy-i-kreatywnosc-przyklad-instagrama",
          "jak-jedno-postanowienie-noworoczne-moze-odmienic-twoje-zycie-jesli-skupisz-sie-wylacznie-na-nim-przez-rok-studium-mojego-przypadku"
        ],
        "projects": [
          "ebook-zarzadzanie-procesem-tworczym",
          "warsztaty-zarzadzania-procesem-tworczym",
          "blog-lowca-pomyslow",
          "profil-lowca-pomyslow-na-facebooku-i-instagramie"
        ],
        "videos": [],
        "audios": [],
        "images": []
      }
    },
    "music": {
      "name": "music",
      "metadata": {
        "title": "Muzyka",
        "description": "\nMuzyka towarzyszy mi od najmłodszych lat. Jako nastolatek samodzielnie nauczyłem się grać na gitarze klasycznej, potem ukończyłem szkołę muzyczną I i II stopnia.\n\nBardzo szybko zacząłem też komponować muzykę instrumentalną (ok. 100 utworów) m. in. za pomocą programu Guitar Pro oraz piosenki (ponad 100). Stworzyłem także muzykę do kilku animowanych filmów studenckich oraz do spotu reklamowego festiwalu.\n\t\t\nUczyłem także gry na gitarze w ogniskach muzycznych opierając się o autorski program nauki.\n    ",
        "link": "/music",
        "img": {
          "src": "",
          "alt": ""
        },
        "ogTitle": "",
        "ogDescription": "",
        "ogImage": ""
      },
      "props": {
        "skills": [],
        "icon": "musicalNotes"
      },
      "items": {
        "articles": [],
        "projects": [],
        "videos": [],
        "audios": [
          "august-gardens",
          "b-day-theme",
          "elevator-to-sadness"
        ],
        "images": []
      }
    },
    "visual-thinking": {
      "name": "visual-thinking",
      "metadata": {
        "title": "Myślenie wizualne (notatki wizualne i mapy myśli)",
        "description": "\nCokolwiek czytam, cokolwiek planuję, cokolwiek rozwijam, czegokolwiek się uczę – robię notatki wizualne i mapy myśli.\n\nSwoimi notatkami (ok. 100 postów) dzielę się Facebooku (>2500 obserwujących) oraz na Instagramie (>2300 obserwujących), gdzie zostały zapisane przez użytkowników kilka tysięcy razy! Można je zobaczyć także w galerii na niniejszej stronie.\n\t\t\nProwadziłem też warsztaty, zarówno online, jak i stacjonarne, z notowania wizualnego oraz tworzenia map myśli.\n    ",
        "link": "/visual-thinking",
        "img": {
          "src": "",
          "alt": ""
        },
        "ogTitle": "Myślenie wizualne (notatki wizualne i mapy myśli)",
        "ogDescription": "\nCokolwiek czytam, cokolwiek planuję, cokolwiek rozwijam, czegokolwiek się uczę – robię notatki wizualne i mapy myśli.\n\nSwoimi notatkami (ok. 100 postów) dzielę się Facebooku (>2500 obserwujących) oraz na Instagramie (>2300 obserwujących), gdzie zostały zapisane przez użytkowników kilka tysięcy razy! Można je zobaczyć także w galerii na niniejszej stronie.\n\t\t\nProwadziłem też warsztaty, zarówno online, jak i stacjonarne, z notowania wizualnego oraz tworzenia map myśli.\n    ",
        "ogImage": ""
      },
      "props": {
        "skills": [],
        "icon": "draw"
      },
      "items": {
        "articles": [
          "jak-notowac-efektywnie-rob-notatki-wizualne",
          "mapy-mysli-jak-je-tworzyc-i-jak-z-nich-korzystac",
          "notatki-wizualne-na-pokaz-vs-do-uzytku-wlasnego-porownanie-notatki-nt-patronite-i-jej-szkicu",
          "jak-zaczalem-notowac-wizualnie-moja-historia"
        ],
        "projects": [
          "profil-kreatywne-notatki-na-instagramie-i-facebooku",
          "blog-kreatywne-notatki",
          "warsztaty-myslenia-wizualnego-notatki-wizualne-mapy-mysli"
        ],
        "videos": [
          "jak-tworzyc-lepsze-notatki-ktore-pomoga-w-efektywnej-nauce-or-rozmowa-z-vadimem-gierko-(czesc-1)",
          "skuteczne-notatki.-jak-je-tworzyc-or-rozmowa-z-vadimem-gierko-(czesc-2)",
          "notatka-ktora-hakuje-pamiec...-i-poprawia-nauke:-)"
        ],
        "audios": [],
        "images": [
          "ebook-dlaczego-warto-vadim-gierko-kreatywne-notatki-notatka-wizualna-sketchnoting-poradnik-1024x1024.jpg",
          "esej-vadim-gierko-pisanie-kreatywne-notatki.jpg",
          "freddie-mercury-queen-vadim-gierko-notatka-wizualna-819x1024.jpg",
          "grafika-grafiki-klosinski-jak-tworzyc-notatka-wizualna-kreatywne-notatki-vadim-gierko-819x1024.jpg",
          "instagram-media-spolecznosciowe-rozwoj-tworczy-kreatywnosc-vadim-gierko-notatka-wizualna-1024x1024.jpg",
          "introwertyk-kreatywne-notatki-vadim-gierko-1024x955.jpg",
          "jak-napisac-tekst-vadim-gierko-kreatywne-notatki-notatka-wizualna-sketchnoting-bartlomiej-krawczyk-1024x723.jpg",
          "jak-oszczedzac-prad-gaz-woda-vadim-gierko-kreatywne-notatki.jpg",
          "jak-zhakowac-mozg-vadim-gierko-kreatywne-notatki-notatka-wizualna-sketchnoting-dobra-pamiec-1024x765.jpg",
          "mapa-mapy-mysli-vadim-gierko-notatki-wizualne-poradnik-artykul-nauka-zarzadzanie.jpg",
          "mapa-mysli-design-thinking-vadim-gierko-kreatywne-notatki-1-1024x717.jpg",
          "mapa-mysli-notatka-wizualna-vadim-gierko-linkedin-892x1024.jpg",
          "marcin-osman-ebook-kreatywne-notatki-vadim-gierko-1024x722.jpg",
          "notatka-wizualna-vadim-gierko-kreatywne-notatki-firma-czyli-ty-paul-jarvis-gosia-zimniak-1024x730.jpg",
          "notatka-wizualna-vadim-gierko-kreatywne-notatki-warunki-pracy-kreatywnosc-mapa-mysli-1024x1024.jpg",
          "notatki-wizualne-artykul-efektywna-nauka-notowanie-vadim-gierko-sketchnoting-887x1024.jpg",
          "patronite-vadim-gierko-kreatywne-wizualne-notatki-819x1024.jpg",
          "projekty-praca-tworcza-lowca-pomyslow-notatka-wizualna-1024x1024.jpg",
          "vadim-gierko-kreatywne-notatki-czytanie-produktywnosc-ksiazki-lektura-1024x1024.jpg",
          "vadim-gierko-kreatywne-notatki-dalai-lama-czas-zarzadzanie-rozwoj-osobisty-860x1024.jpg",
          "vadim-gierko-kreatywne-notatki-folowers-instagram-haremska-sprawny-marketing-819x1024.jpg",
          "vadim-gierko-kreatywne-notatki-freddie-mercury-queen-1024x1024.jpg",
          "vadim-gierko-kreatywne-notatki-identyfikacja-wizualna-instagram-marka-osobista-sprawny-marketing-879x1024.jpg",
          "vadim-gierko-kreatywne-notatki-instagram-bledy-content-marketing-sprawny-1024x957.jpg",
          "vadim-gierko-kreatywne-notatki-inteligencja-einstein-838x1024.jpg",
          "vadim-gierko-kreatywne-notatki-jak-pisac-lepiej-poradnik-blog-pisanie-pisarz-1024x1024.jpg",
          "vadim-gierko-kreatywne-notatki-koncentracja-1024x1024.jpg",
          "vadim-gierko-kreatywne-notatki-nauka-jezyk-obcy-teachersi-1024x1024.jpg",
          "vadim-gierko-kreatywne-notatki-nawyki-dyscyplina-zarzadzanie-czasem-1024x871.jpg",
          "vadim-gierko-kreatywne-notatki-perfekcjonizm-rozwoj-osobisty-1024x1024.jpg",
          "vadim-gierko-kreatywne-notatki-pisanie-poradnik-blog-902x1024.jpg",
          "vadim-gierko-kreatywne-notatki-praca-etat-olekszyk-workbalance-kariera-1024x727.jpg",
          "vadim-gierko-kreatywne-notatki-praca-gleboka-cal-newport-1024x732.jpg",
          "vadim-gierko-kreatywne-notatki-reguly-kreatywnego-myslenia-chybicka-1024x726.jpg",
          "vadim-gierko-kreatywne-notatki-rok-szkolny-rozwoj-osobisty-dzieci-kreatywnosc-1024x1024.jpg",
          "vadim-gierko-kreatywne-notatki-rozwoj-osobisty-weekend-tworczosc-kreatywnosc-913x1024.jpg",
          "vadim-gierko-kreatywne-notatki-situationship-zwiazek-relacje-psychologia-1024x1024.jpg",
          "vadim-gierko-kreatywne-notatki-swieta-zero-waste-1024x716.jpg",
          "vadim-gierko-kreatywne-notatki-szkolenia-poradnik-klosinski-sowa-845x1024.jpg",
          "vadim-gierko-kreatywne-notatki-tworca-tworczosc-czego-zaluje-niespelniony-1024x1024.jpg",
          "vadim-gierko-kreatywne-notatki-warunki-pracy-kreatywnosc-natchnienie-1024x1024.jpg",
          "vadim-gierko-kreatywne-notatki-zarzadzanie-czasem-business-insider-1024x928.jpg",
          "vadim-gierko-kreatywne-notatki-zwiazek-psychologia-relacje-kobieta-milosc-1024x1024.jpg",
          "wizualna-kreatywna-notatka-sketchnoting-design-thinking-suslik-vadim-gierko-1024x713.jpg",
          "wizualna-kreatywna-notatka-sketchnoting-klosinski-klient-strategia-vadim-gierko-1024x1024.jpg",
          "wizualna-kreatywna-notatka-sketchnoting-mind-map-instagram-pomysl-vadim-gierko-1024x1024.jpg",
          "wizualna-kreatywna-notatka-sketchnoting-prezentacja-jobs-vadim-gierko-1024x716.jpg",
          "wizualna-kreatywna-notatka-sketchnoting-problem-rozwiazanie-watanabe-vadim-gierko-1024x726.jpg",
          "zarzadzanie-procesem-tworczym-vadim-gierko-infografika.jpg",
          "zero-waste-vadim-gierko-kreatywne-notatki-notatka-wizualna-sketchnoting-1024x1024.jpg"
        ]
      }
    }
  },
  "pages": {
    "web-development": {
      "pageType": "category",
      "slug": "web-development"
    },
    "5-reasons-why-i-started-learning-programming": {
      "pageType": "item",
      "slug": "5-reasons-why-i-started-learning-programming",
      "props": {
        "itemsType": "articles",
        "itemType": "article"
      }
    },
    "summary-of-my-first-year-of-learning-web-development-roadmap-projects-and-tips-for-newbies": {
      "pageType": "item",
      "slug": "summary-of-my-first-year-of-learning-web-development-roadmap-projects-and-tips-for-newbies",
      "props": {
        "itemsType": "articles",
        "itemType": "article"
      }
    },
    "personal-website-next-js": {
      "pageType": "item",
      "slug": "personal-website-next-js",
      "props": {
        "itemsType": "projects",
        "itemType": "devProject"
      }
    },
    "kodujemywbiurze.pl": {
      "pageType": "item",
      "slug": "kodujemywbiurze.pl",
      "props": {
        "itemsType": "projects",
        "itemType": "devProject"
      }
    },
    "linky-notes": {
      "pageType": "item",
      "slug": "linky-notes",
      "props": {
        "itemsType": "projects",
        "itemType": "devProject"
      }
    },
    "chat-app-react": {
      "pageType": "item",
      "slug": "chat-app-react",
      "props": {
        "itemsType": "projects",
        "itemType": "devProject"
      }
    },
    "issue-tracker": {
      "pageType": "item",
      "slug": "issue-tracker",
      "props": {
        "itemsType": "projects",
        "itemType": "devProject"
      }
    },
    "markdown-text-editor": {
      "pageType": "item",
      "slug": "markdown-text-editor",
      "props": {
        "itemsType": "projects",
        "itemType": "devProject"
      }
    },
    "creative-process-management": {
      "pageType": "category",
      "slug": "creative-process-management"
    },
    "zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia": {
      "pageType": "item",
      "slug": "zarzadzanie-procesem-tworczym-czyli-jak-zapanowac-nad-chaosem-tworzenia",
      "props": {
        "itemsType": "articles",
        "itemType": "article"
      }
    },
    "jak-uporzadkowac-pomysly-wielka-ksiega-pomyslow": {
      "pageType": "item",
      "slug": "jak-uporzadkowac-pomysly-wielka-ksiega-pomyslow",
      "props": {
        "itemsType": "articles",
        "itemType": "article"
      }
    },
    "dokumentacja-procesu-tworczego-dlaczego-warto-jak-to-robic-krok-po-kroku": {
      "pageType": "item",
      "slug": "dokumentacja-procesu-tworczego-dlaczego-warto-jak-to-robic-krok-po-kroku",
      "props": {
        "itemsType": "articles",
        "itemType": "article"
      }
    },
    "jak-media-spolecznosciowe-stymuluja-rozwoj-tworczy-i-kreatywnosc-przyklad-instagrama": {
      "pageType": "item",
      "slug": "jak-media-spolecznosciowe-stymuluja-rozwoj-tworczy-i-kreatywnosc-przyklad-instagrama",
      "props": {
        "itemsType": "articles",
        "itemType": "article"
      }
    },
    "jak-jedno-postanowienie-noworoczne-moze-odmienic-twoje-zycie-jesli-skupisz-sie-wylacznie-na-nim-przez-rok-studium-mojego-przypadku": {
      "pageType": "item",
      "slug": "jak-jedno-postanowienie-noworoczne-moze-odmienic-twoje-zycie-jesli-skupisz-sie-wylacznie-na-nim-przez-rok-studium-mojego-przypadku",
      "props": {
        "itemsType": "articles",
        "itemType": "article"
      }
    },
    "ebook-zarzadzanie-procesem-tworczym": {
      "pageType": "item",
      "slug": "ebook-zarzadzanie-procesem-tworczym",
      "props": {
        "itemsType": "projects",
        "itemType": "project"
      }
    },
    "warsztaty-zarzadzania-procesem-tworczym": {
      "pageType": "item",
      "slug": "warsztaty-zarzadzania-procesem-tworczym",
      "props": {
        "itemsType": "projects",
        "itemType": "project"
      }
    },
    "blog-lowca-pomyslow": {
      "pageType": "item",
      "slug": "blog-lowca-pomyslow",
      "props": {
        "itemsType": "projects",
        "itemType": "project"
      }
    },
    "profil-lowca-pomyslow-na-facebooku-i-instagramie": {
      "pageType": "item",
      "slug": "profil-lowca-pomyslow-na-facebooku-i-instagramie",
      "props": {
        "itemsType": "projects",
        "itemType": "project"
      }
    },
    "visual-thinking": {
      "pageType": "category",
      "slug": "visual-thinking"
    },
    "jak-notowac-efektywnie-rob-notatki-wizualne": {
      "pageType": "item",
      "slug": "jak-notowac-efektywnie-rob-notatki-wizualne",
      "props": {
        "itemsType": "articles",
        "itemType": "article"
      }
    },
    "mapy-mysli-jak-je-tworzyc-i-jak-z-nich-korzystac": {
      "pageType": "item",
      "slug": "mapy-mysli-jak-je-tworzyc-i-jak-z-nich-korzystac",
      "props": {
        "itemsType": "articles",
        "itemType": "article"
      }
    },
    "notatki-wizualne-na-pokaz-vs-do-uzytku-wlasnego-porownanie-notatki-nt-patronite-i-jej-szkicu": {
      "pageType": "item",
      "slug": "notatki-wizualne-na-pokaz-vs-do-uzytku-wlasnego-porownanie-notatki-nt-patronite-i-jej-szkicu",
      "props": {
        "itemsType": "articles",
        "itemType": "article"
      }
    },
    "jak-zaczalem-notowac-wizualnie-moja-historia": {
      "pageType": "item",
      "slug": "jak-zaczalem-notowac-wizualnie-moja-historia",
      "props": {
        "itemsType": "articles",
        "itemType": "article"
      }
    },
    "profil-kreatywne-notatki-na-instagramie-i-facebooku": {
      "pageType": "item",
      "slug": "profil-kreatywne-notatki-na-instagramie-i-facebooku",
      "props": {
        "itemsType": "projects",
        "itemType": "project"
      }
    },
    "blog-kreatywne-notatki": {
      "pageType": "item",
      "slug": "blog-kreatywne-notatki",
      "props": {
        "itemsType": "projects",
        "itemType": "project"
      }
    },
    "warsztaty-myslenia-wizualnego-notatki-wizualne-mapy-mysli": {
      "pageType": "item",
      "slug": "warsztaty-myslenia-wizualnego-notatki-wizualne-mapy-mysli",
      "props": {
        "itemsType": "projects",
        "itemType": "project"
      }
    },
    "music": {
      "pageType": "category",
      "slug": "music"
    }
  }
}